--------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\analyses\alex-tmp-repo-2\analysis\output/an_checkassumptions_MI_combine.log
  log type:  text
 opened on:   2 May 2020, 13:27:30

. 
. 
. 
. **************************
. *  Combine imputed data  *
. **************************
. 
. * Put imputed data together (across regions)
. use imputed_1.dta, clear
(Analysis dataset for the poor outcomes in Covid project)

. forvalues k= 2 (1) 9    {
  2. append using imputed_`k'
  3. }
(label ethnicity already defined)
(label ethnicity already defined)
(label ethnicity already defined)
(label ethnicity already defined)
(label ethnicity already defined)
(label ethnicity already defined)
(label ethnicity already defined)
(label ethnicity already defined)

. save imputed, replace
file imputed.dta saved

. forvalues k= 1 (1) 9    {
  2. *erase imputed_`k'.dta
. }

. 
. * Add imputations to the full dataset
. use cr_create_analysis_dataset.dta, clear
(Analysis dataset for the poor outcomes in Covid project)

. merge 1:1 patient_id using imputed.dta
(label ethnicity already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                       136,269
        from master                   136,269  (_merge==1)
        from using                          0  (_merge==2)

    matched                        17,284,325  (_merge==3)
    -----------------------------------------

. 
. * Create ID version for exportation into Stata mi impute
. gen _mi = _n

. 
. 
. /*  Import into -mi- format  */
. 
. mi import wide, imputed(ethnicity = ethnicity1 ethnicity2       ///
> ethnicity3 ethnicity4 ethnicity5) drop clear
(26072725 values of imputed variable ethnicity in m>0 updated to match values in m=0)

. 
. 
. 
. 
. **************************
. *  Analyse imputed data  *
. **************************
. 
. 
. 
. // Analysis model
. 
. mi stset stime_cpnsdeath, fail(cpnsdeath) enter(enter_date)     ///
>         origin(enter_date) id(patient_id)

                id:  patient_id
     failure event:  cpnsdeath != 0 & cpnsdeath < .
obs. time interval:  (stime_cpnsdeath[_n-1], stime_cpnsdeath]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
   17420594  total observations
        466  observations end on or before enter()
------------------------------------------------------------------------------
   17420128  observations remaining, representing
   17420128  subjects
      5,707  failures in single-failure-per-subject data
 1.4615e+09  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        84

. 
.         
. // Check if the MI distribution of ethnicity matches that in the census
. mi estimate: prop ethnicity 

Multiple-imputation estimates     Imputations     =          5
Proportion estimation             Number of obs   = 12,823,353
                                  Average RVI     =     0.0000
                                  Largest FMI     =     0.0000
                                  Complete DF     =   12823352
DF adjustment:   Small sample     DF:     min     =   1.28e+07
                                          avg     =   1.28e+07
Within VCE type:     Analytic             max     =   1.28e+07

-------------------------------------------------------------------------
                        |                                   Normal
                        | Proportion   Std. Err.     [95% Conf. Interval]
------------------------+------------------------------------------------
              ethnicity |
                 White  |   .8545692   .0000984      .8543763    .8547622
                 Mixed  |   .0133655   .0000321      .0133027    .0134284
Asian or Asian British  |   .0802562   .0000759      .0801075    .0804049
                 Black  |   .0266973    .000045      .0266091    .0267855
                 Other  |   .0251117   .0000437       .025026    .0251973
-------------------------------------------------------------------------

. tab ethnicity

             Ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White | 10,958,443       85.46       85.46
                 Mixed |    171,391        1.34       86.79
Asian or Asian British |  1,029,154        8.03       94.82
                 Black |    342,349        2.67       97.49
                 Other |    322,016        2.51      100.00
-----------------------+-----------------------------------
                 Total | 12,823,353      100.00

.         
. * "Analysis" Cox model  (without STP stratification and age splines)
. mi estimate, eform:                                                     ///
>         stcox   agegroup_*                                              ///
>                         male                                                            ///
>                         obese4cat_*                                                     ///
>                         smoke_nomiss_*                                          ///
>                         imd_*                                                           ///
>                         htdiag_or_highbp                                        ///
>                         chronic_respiratory_disease             ///
>                         asthmacat_*                                             ///
>                         chronic_cardiac_disease                         ///
>                         diabcat_*                                                       ///
>                         cancer_exhaem_cat_*                             ///
>                         cancer_haem_cat_*                                       ///
>                         chronic_liver_disease                           ///
>                         stroke_dementia                                         ///
>                         other_neuro                                                     ///
>                         chronic_kidney_disease                          ///
>                         organ_transplant                                        ///
>                         spleen                                                          ///
>                         ra_sle_psoriasis                                        ///
>                         other_immunosuppression                         ///
>                         , strata(stp)
variable agegroup_* not found
an error occurred when mi estimate executed stcox on m=1
r(111);

end of do-file

r(111);

. tab agegroup

Grouped age |      Freq.     Percent        Cum.
------------+-----------------------------------
     18-<40 |  5,973,929       34.29       34.29
     40-<50 |  2,871,926       16.49       50.78
     50-<60 |  3,067,705       17.61       68.39
     60-<70 |  2,406,148       13.81       82.20
     70-<80 |  1,952,091       11.21       93.41
        80+ |  1,148,795        6.59      100.00
------------+-----------------------------------
      Total | 17,420,594      100.00

. do "C:\Users\KRISHN~1\AppData\Local\Temp\5\STD728c_000000.tmp"

. mi estimate, eform:                                                     ///
>         stcox   i.agegroup                                              ///
>                         i.male                                                          ///
>                         i.obese4cat                                                     ///
>                         i.smoke_nomiss                                          ///
>                         i.imd                                                           ///
>                         i.htdiag_or_highbp                                      ///
>                         i.chronic_respiratory_disease           ///
>                         i.asthmacat                                             ///
>                         i.chronic_cardiac_disease                       ///
>                         i.diabcat                                                       ///
>                         i.cancer_exhaem_cat                             ///
>                         i.cancer_haem_cat                                       ///
>                         i.chronic_liver_disease                                 ///
>                         i.stroke_dementia                                               ///
>                         i.other_neuro                                                   ///
>                         i.chronic_kidney_disease                                ///
>                         i.organ_transplant                                      ///
>                         i.spleen                                                                ///
>                         i.ra_sle_psoriasis                                      ///
>                         i.other_immunosuppression                       ///
>                         , strata(stp)

Multiple-imputation estimates                   Imputations       =          5
Stratified Cox regr.: Breslow method for ties   Number of obs     = 17,284,549
                                                Average RVI       =     0.0000
                                                Largest FMI       =     0.0000
DF adjustment:   Large sample                   DF:     min       =   1.22e+61
                                                        avg       =   1.54e+61
                                                        max       =          .
Model F test:       Equal FMI                   F(  37, 4.8e+64)  =     354.89
Within VCE type:          OIM                   Prob > F          =     0.0000

-----------------------------------------------------------------------------------------------
                           _t |     exp(b)   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                     agegroup |
                      40-<50  |   4.328011   .8191327     7.74   0.000      2.98667    6.271759
                      50-<60  |   14.07386   2.357004    15.79   0.000     10.13583    19.54192
                      60-<70  |   29.65097   4.865016    20.66   0.000     21.49696    40.89787
                      70-<80  |   67.39327   10.96703    25.87   0.000     48.98904    92.71161
                         80+  |   176.8784   28.85221    31.73   0.000     128.4777    243.5128
                              |
                       1.male |   1.880619   .0536992    22.12   0.000     1.778261    1.988868
                              |
                    obese4cat |
           Obese I (30-34.9)  |   1.192884   .0409839     5.13   0.000     1.115202    1.275977
          Obese II (35-39.9)  |   1.440952    .072727     7.24   0.000     1.305234    1.590783
             Obese III (40+)  |   2.053507   .1367663    10.80   0.000     1.802208    2.339846
                              |
                 smoke_nomiss |
                      Former  |    1.26347   .0388355     7.61   0.000     1.189601    1.341925
                     Current  |   .8352996   .0480628    -3.13   0.002     .7462159    .9350182
                              |
                          imd |
                           2  |   1.147083   .0515849     3.05   0.002     1.050306    1.252777
                           3  |   1.225388   .0550567     4.52   0.000     1.122094    1.338191
                           4  |   1.496655   .0661174     9.13   0.000     1.372519    1.632018
             5 most deprived  |    1.73616   .0785879    12.19   0.000     1.588765    1.897229
                              |
           1.htdiag_or_highbp |   .9862433   .0319821    -0.43   0.669       .92551    1.050962
1.chronic_respiratory_disease |   1.770114    .060145    16.81   0.000     1.656072     1.89201
                              |
                    asthmacat |
                 Yes, no OCS  |   1.086622    .044143     2.04   0.041     1.003458    1.176678
                Yes with OCS  |   1.199386   .0884988     2.46   0.014      1.03789     1.38601
                              |
    1.chronic_cardiac_disease |   1.303277    .039029     8.85   0.000     1.228983    1.382062
                              |
                      diabcat |
         Controlled diabetes  |   1.482204   .0504046    11.57   0.000     1.386633    1.584362
       Uncontrolled diabetes  |   2.270271   .0949066    19.61   0.000     2.091674    2.464118
  Diabetes, no hba1c measure  |    1.91287   .1284086     9.66   0.000     1.677047    2.181853
                              |
            cancer_exhaem_cat |
                   Last year  |   1.501653   .1471239     4.15   0.000     1.239291    1.819557
               2-5 years ago  |   1.171572   .0769308     2.41   0.016      1.03009    1.332486
                    5+ years  |   .9803192   .0443864    -0.44   0.661     .8970718    1.071292
                              |
              cancer_haem_cat |
                   Last year  |   3.345302   .6460767     6.25   0.000     2.291095    4.884583
               2-5 years ago  |   2.975808   .3378823     9.60   0.000     2.382083    3.717517
                    5+ years  |   1.835858   .1849906     6.03   0.000     1.506842    2.236715
                              |
      1.chronic_liver_disease |   1.563892   .1518409     4.61   0.000     1.292892    1.891696
            1.stroke_dementia |   1.877442   .0683479    17.30   0.000      1.74815    2.016296
                1.other_neuro |    2.37615   .1403009    14.66   0.000     2.116481    2.667679
     1.chronic_kidney_disease |   1.877549   .0571734    20.69   0.000      1.76877    1.993019
           1.organ_transplant |    3.88149   .5695575     9.24   0.000      2.91136    5.174889
                     1.spleen |   1.364311   .2856966     1.48   0.138      .905035    2.056653
           1.ra_sle_psoriasis |   1.201886   .0553341     3.99   0.000     1.098183    1.315383
    1.other_immunosuppression |   1.604591    .269439     2.82   0.005     1.154603    2.229955
-----------------------------------------------------------------------------------------------

. 
. log close
      name:  <unnamed>
       log:  E:\analyses\alex-tmp-repo-2\analysis\output/an_checkassumptions_MI_combine.log
  log type:  text
 closed on:   2 May 2020, 18:00:21
--------------------------------------------------------------------------------------------------------------------
--------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\analyses\alex-tmp-repo-2\analysis\output/an_checkassumptions_MI_combine.log
  log type:  text
 opened on:   2 May 2020, 18:44:46

. 
. 
. mi estimate, eform:                                                     ///
>         stcox   i.ethnicity ///
>                         i.agegroup                                              ///
>                         i.male                                                          ///
>                         i.obese4cat                                                     ///
>                         i.smoke_nomiss                                          ///
>                         i.imd                                                           ///
>                         i.htdiag_or_highbp                                      ///
>                         i.chronic_respiratory_disease           ///
>                         i.asthmacat                                             ///
>                         i.chronic_cardiac_disease                       ///
>                         i.diabcat                                                       ///
>                         i.cancer_exhaem_cat                             ///
>                         i.cancer_haem_cat                                       ///
>                         i.chronic_liver_disease                                 ///
>                         i.stroke_dementia                                               ///
>                         i.other_neuro                                                   ///
>                         i.chronic_kidney_disease                                ///
>                         i.organ_transplant                                      ///
>                         i.spleen                                                                ///
>                         i.ra_sle_psoriasis                                      ///
>                         i.other_immunosuppression                       ///
>                         , strata(stp)

Multiple-imputation estimates                   Imputations       =          5
Stratified Cox regr.: Breslow method for ties   Number of obs     = 12,715,040
                                                Average RVI       =     0.0000
                                                Largest FMI       =     0.0000
DF adjustment:   Large sample                   DF:     min       =   2.54e+61
                                                        avg       =   3.26e+62
                                                        max       =          .
Model F test:       Equal FMI                   F(  41, 1.7e+65)  =     245.43
Within VCE type:          OIM                   Prob > F          =     0.0000

-----------------------------------------------------------------------------------------------
                           _t |     exp(b)   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                    ethnicity |
                       Mixed  |   1.585771   .2578925     2.84   0.005     1.152949    2.181075
      Asian or Asian British  |   1.550059   .0950373     7.15   0.000     1.374546    1.747982
                       Black  |   1.639251   .1419441     5.71   0.000     1.383373    1.942459
                       Other  |   1.344698   .1769439     2.25   0.024     1.039007    1.740329
                              |
                     agegroup |
                      40-<50  |   3.631258    .753143     6.22   0.000     2.418316    5.452567
                      50-<60  |   12.36906   2.258081    13.78   0.000     8.648526    17.69013
                      60-<70  |   25.77001   4.608148    18.17   0.000     18.15115    36.58684
                      70-<80  |   59.75701   10.60053    23.06   0.000     42.20762    84.60322
                         80+  |   148.3255   26.42916    28.06   0.000     104.6034    210.3226
                              |
                       1.male |   1.833336   .0606812    18.31   0.000     1.718179    1.956212
                              |
                    obese4cat |
           Obese I (30-34.9)  |   1.207856   .0476042     4.79   0.000     1.118066    1.304856
          Obese II (35-39.9)  |   1.481855   .0852101     6.84   0.000     1.323913    1.658639
             Obese III (40+)  |   2.053178   .1581178     9.34   0.000     1.765528    2.387694
                              |
                 smoke_nomiss |
                      Former  |   1.329654   .0484806     7.81   0.000     1.237949    1.428152
                     Current  |   .8866028    .058779    -1.82   0.069     .7785688    1.009627
                              |
                          imd |
                           2  |   1.201833   .0649542     3.40   0.001     1.081036    1.336128
                           3  |   1.253338   .0676532     4.18   0.000     1.127513    1.393204
                           4  |   1.535306   .0809017     8.14   0.000     1.384655    1.702348
             5 most deprived  |    1.68945    .091406     9.69   0.000     1.519469    1.878446
                              |
           1.htdiag_or_highbp |   1.016828   .0387186     0.44   0.661     .9437034    1.095618
1.chronic_respiratory_disease |    1.78335   .0697544    14.79   0.000     1.651743    1.925443
                              |
                    asthmacat |
                 Yes, no OCS  |   1.011423   .0479429     0.24   0.811     .9216893    1.109892
                Yes with OCS  |   1.193397   .0985274     2.14   0.032     1.015101    1.403009
                              |
    1.chronic_cardiac_disease |     1.3128   .0456614     7.82   0.000     1.226287    1.405415
                              |
                      diabcat |
         Controlled diabetes  |   1.469398   .0579428     9.76   0.000      1.36011    1.587467
       Uncontrolled diabetes  |   2.148439   .1047125    15.69   0.000     1.952704    2.363794
  Diabetes, no hba1c measure  |   1.987753   .1491803     9.15   0.000     1.715852     2.30274
                              |
            cancer_exhaem_cat |
                   Last year  |   1.631046   .1795194     4.44   0.000     1.314558    2.023732
               2-5 years ago  |   1.195137   .0912885     2.33   0.020     1.028964    1.388146
                    5+ years  |   1.038031   .0540428     0.72   0.473      .937334    1.149546
                              |
              cancer_haem_cat |
                   Last year  |   3.155231   .7263459     4.99   0.000      2.00947    4.954284
               2-5 years ago  |    3.27945   .4141093     9.41   0.000      2.56045    4.200352
                    5+ years  |   1.793835    .212575     4.93   0.000     1.422043    2.262833
                              |
      1.chronic_liver_disease |   1.566928   .1710068     4.12   0.000     1.265182     1.94064
            1.stroke_dementia |    1.83113   .0779571    14.21   0.000     1.684538    1.990479
                1.other_neuro |   2.354066   .1618946    12.45   0.000     2.057215    2.693753
     1.chronic_kidney_disease |   1.923532   .0682238    18.44   0.000     1.794358    2.062006
           1.organ_transplant |   4.162768   .6621963     8.97   0.000      3.04773    5.685752
                     1.spleen |   1.379912   .3267169     1.36   0.174     .8675917    2.194762
           1.ra_sle_psoriasis |   1.141863   .0620333     2.44   0.015      1.02653    1.270156
    1.other_immunosuppression |   1.592959   .2937074     2.53   0.012     1.109842    2.286377
-----------------------------------------------------------------------------------------------

. 
. log close
      name:  <unnamed>
       log:  E:\analyses\alex-tmp-repo-2\analysis\output/an_checkassumptions_MI_combine.log
  log type:  text
 closed on:   2 May 2020, 21:35:28
--------------------------------------------------------------------------------------------------------------------
