---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Github\opencorona-risk-factors-research\analysis\output/an_checks.log
  log type:  text
 opened on:  23 Apr 2020, 11:05:05

. 
. * Open Stata dataset
. use egdata, clear
(Poor factors dummy analysis dataset)

. 
. 
. 
. ******************************************
. *  Check variables take expected values  *
. ******************************************
. 
. * Age
. datacheck age<., nol

. *assert inrange(age, 18, 105)
. datacheck inlist(agegroup, 1, 2, 3, 4, 5, 6), nol

. datacheck inlist(age70, 0, 1), nol

. 
. * Sex
. datacheck inlist(male, 0, 1), nol

. 
. * BMI 
. * assert inrange(bmi, 10, 200) | bmi==.
. datacheck inlist(obese40, 0, 1), nol

. datacheck inlist(bmicat, 1, 2, 3, 4, 5, 6, .u), nol

. 
. * IMD
. datacheck inlist(imd, 1, 2, 3, 4, 5, .u), nol

. 
. * Ethnicity
. datacheck inlist(ethnicity, 1, 2, 3, 4, 5, .u), nol

 (79985 contradictions)

. 
. * Smoking
. datacheck inlist(smoke, 1, 2, 3, .u), nol

 (70480 contradictions)

. datacheck inlist(currentsmoke, 0, 1), nol

 (70480 contradictions)

. 
. * Blood pressure
. datacheck inlist(bpcat, 1, 2, 3, 4, .u), nol

. 
. 
. 
. 
. 
. ***************************************
. *  Cross-check logical relationships  *
. ***************************************
. 
. 
. * BMI
. bysort bmicat: summ bmi

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> bmicat = Underweight (<18.5)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        154     17.2961    1.153335         15       18.4

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> bmicat = Normal (18.5-24.9)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |      4,287    22.55995    1.641963       18.5       24.9

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> bmicat = Overweight (25-29.9)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |      3,968    27.13183    1.380861         25       29.9

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> bmicat = Obese I (30-34.9)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |      1,497    31.88417    1.394325         30       34.9

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> bmicat = Obese II (35-39.9)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |        401    36.78703     1.31914         35       39.9

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> bmicat = Obese III (40+)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         bmi |         75    41.83067    2.495454         40         50


. tab bmicat obese40, m

                     |  Severely obese (cat
                     |          3)
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |    15,221          0 |    15,221 
  Normal (18.5-24.9) |    19,225          0 |    19,225 
Overweight (25-29.9) |    18,970          0 |    18,970 
   Obese I (30-34.9) |    16,478          0 |    16,478 
  Obese II (35-39.9) |    15,456          0 |    15,456 
     Obese III (40+) |    15,145         75 |    15,220 
---------------------+----------------------+----------
               Total |   100,495         75 |   100,570 

. 
. * Age
. bysort agegroup: summ age

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> agegroup = 18-<40

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |     27,739    27.01947    6.238169         18         39

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> agegroup = 40-<50

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |     12,100     44.5638    2.911281         40         49

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> agegroup = 50-<60

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |     22,146    54.68459    2.120079         50         59

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> agegroup = 60-<70

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |      9,454    64.44976    2.911684         60         69

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> agegroup = 70-<80

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |      8,345    74.03212    2.787053         70         79

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-> agegroup = 80+

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |     20,786    89.24925    5.305249         80        105


. tab agegroup age70, m

   Grouped |  70 years and older
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<40 |    27,739          0 |    27,739 
    40-<50 |    12,100          0 |    12,100 
    50-<60 |    22,146          0 |    22,146 
    60-<70 |     9,454          0 |     9,454 
    70-<80 |         0      8,345 |     8,345 
       80+ |         0     20,786 |    20,786 
-----------+----------------------+----------
     Total |    71,439     29,131 |   100,570 

. 
. * Smoking
. tab smoke currentsmoke, m

     Smoking |    Current smoker
      status |         0          . |     Total
-------------+----------------------+----------
       Never |    30,090          0 |    30,090 
           . |         0     70,480 |    70,480 
-------------+----------------------+----------
       Total |    30,090     70,480 |   100,570 

. 
. * Blood pressure
. tab bpcat bphigh, m

               |  Binary high (stage
 Grouped blood |  1/2) blood pressure
      pressure |         0          1 |     Total
---------------+----------------------+----------
        Normal |    51,906          0 |    51,906 
      Elevated |     5,242          0 |     5,242 
 High, stage I |         0     19,217 |    19,217 
High, stage II |         0     24,205 |    24,205 
---------------+----------------------+----------
         Total |    57,148     43,422 |   100,570 

. 
. 
. 
. *********************
. *  Summarise dates  *
. *********************
. 
. * BMI
. *summ bmi_date_measured, format
. /*
> * Dates of comorbidities  
> foreach var of varlist  chronic_respiratory_disease     ///
>                                                 chronic_cardiac_disease                 ///
>                                                 diabetes                                                ///
>                                                 chronic_liver_disease                   ///
>                                                 organ_transplant                                ///     
>                                                 ra_sle_psoriasis  {
> 
>         summ `var'_date, format
>         bysort `var': summ `var'_date
> }
> */
. 
. 
. * Outcome dates
. *****??? 
. summ stime_ituadmission stime_cpnsdeath stime_onscoviddeath,   format

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
stime_itua~n |    100,570   19apr2020    .6429756  01feb2020  20apr2020
stime_cpns~h |    100,570   15apr2020    .5043795  01feb2020  16apr2020
stime_onsc~h |    100,570   05apr2020    .4099991  01feb2020  06apr2020

. summ itu_date died_date_ons died_date_cpns died_date_onscovid, format

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    itu_date |          5   02mar2020    .4472136  02mar2020  03mar2020
died_dat~ons |         11   02mar2020    19.61817  01feb2020  14mar2020
died_dat~pns |          4   04apr2020    2.061553  02apr2020  07apr2020
died_date_~d |          1   14mar2020           .  14mar2020  14mar2020

. 
. 
. 
. 
. 
. ****************************************
. *  Cross-check expected relationships  *
. ****************************************
. 
. 
. /*  Relationships between demographic/lifestyle variables  */
. 
. tab agegroup bmicat,    col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Grouped |                            Grouped BMI
       age | Underweig  Normal (1  Overweigh  Obese I (  Obese II   Obese III |     Total
-----------+------------------------------------------------------------------+----------
    18-<40 |     4,396      4,880      4,904      4,573      4,503      4,483 |    27,739 
           |     28.88      25.38      25.85      27.75      29.13      29.45 |     27.58 
-----------+------------------------------------------------------------------+----------
    40-<50 |     1,480      3,071      2,755      1,909      1,496      1,389 |    12,100 
           |      9.72      15.97      14.52      11.59       9.68       9.13 |     12.03 
-----------+------------------------------------------------------------------+----------
    50-<60 |     3,285      4,351      4,235      3,550      3,394      3,331 |    22,146 
           |     21.58      22.63      22.32      21.54      21.96      21.89 |     22.02 
-----------+------------------------------------------------------------------+----------
    60-<70 |     1,324      1,935      2,020      1,534      1,343      1,298 |     9,454 
           |      8.70      10.07      10.65       9.31       8.69       8.53 |      9.40 
-----------+------------------------------------------------------------------+----------
    70-<80 |     1,219      1,593      1,625      1,394      1,233      1,281 |     8,345 
           |      8.01       8.29       8.57       8.46       7.98       8.42 |      8.30 
-----------+------------------------------------------------------------------+----------
       80+ |     3,517      3,395      3,431      3,518      3,487      3,438 |    20,786 
           |     23.11      17.66      18.09      21.35      22.56      22.59 |     20.67 
-----------+------------------------------------------------------------------+----------
     Total |    15,221     19,225     18,970     16,478     15,456     15,220 |   100,570 
           |    100.00     100.00     100.00     100.00     100.00     100.00 |    100.00 

. tab agegroup smoke,     col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  Smoking
   Grouped |   status
       age |     Never |     Total
-----------+-----------+----------
    18-<40 |     8,243 |     8,243 
           |     27.39 |     27.39 
-----------+-----------+----------
    40-<50 |     3,709 |     3,709 
           |     12.33 |     12.33 
-----------+-----------+----------
    50-<60 |     6,633 |     6,633 
           |     22.04 |     22.04 
-----------+-----------+----------
    60-<70 |     2,784 |     2,784 
           |      9.25 |      9.25 
-----------+-----------+----------
    70-<80 |     2,473 |     2,473 
           |      8.22 |      8.22 
-----------+-----------+----------
       80+ |     6,248 |     6,248 
           |     20.76 |     20.76 
-----------+-----------+----------
     Total |    30,090 |    30,090 
           |    100.00 |    100.00 

. tab agegroup ethnicity, col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Grouped |                       Ethnicity
       age |     White  South Asi      Black      Other      Mixed |     Total
-----------+-------------------------------------------------------+----------
    18-<40 |     1,069         21         20         10     10,014 |    11,134 
           |     10.41      12.80      20.00      41.67      99.89 |     54.09 
-----------+-------------------------------------------------------+----------
    40-<50 |     3,681         90         34          3          2 |     3,810 
           |     35.84      54.88      34.00      12.50       0.02 |     18.51 
-----------+-------------------------------------------------------+----------
    50-<60 |     2,673         22         25          5          2 |     2,727 
           |     26.02      13.41      25.00      20.83       0.02 |     13.25 
-----------+-------------------------------------------------------+----------
    60-<70 |     1,776         16         12          4          2 |     1,810 
           |     17.29       9.76      12.00      16.67       0.02 |      8.79 
-----------+-------------------------------------------------------+----------
    70-<80 |     1,035         13          6          2          4 |     1,060 
           |     10.08       7.93       6.00       8.33       0.04 |      5.15 
-----------+-------------------------------------------------------+----------
       80+ |        38          2          3          0          1 |        44 
           |      0.37       1.22       3.00       0.00       0.01 |      0.21 
-----------+-------------------------------------------------------+----------
     Total |    10,272        164        100         24     10,025 |    20,585 
           |    100.00     100.00     100.00     100.00     100.00 |    100.00 

. tab agegroup imd,               col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Grouped |          Index of Multiple Deprivation (IMD)
       age |         1          2          3          4          5 |     Total
-----------+-------------------------------------------------------+----------
    18-<40 |     2,264      5,151      3,268     11,602      5,190 |    27,475 
           |     12.15      26.60      24.03      43.21      25.08 |     27.71 
-----------+-------------------------------------------------------+----------
    40-<50 |     1,403      3,223      2,333      1,201      3,527 |    11,687 
           |      7.53      16.64      17.16       4.47      17.04 |     11.79 
-----------+-------------------------------------------------------+----------
    50-<60 |    11,414      3,239      2,488      1,191      3,515 |    21,847 
           |     61.27      16.73      18.30       4.44      16.99 |     22.04 
-----------+-------------------------------------------------------+----------
    60-<70 |     1,123      2,493      1,823        941      2,857 |     9,237 
           |      6.03      12.87      13.41       3.50      13.81 |      9.32 
-----------+-------------------------------------------------------+----------
    70-<80 |     1,040      2,207      1,659        824      2,478 |     8,208 
           |      5.58      11.40      12.20       3.07      11.97 |      8.28 
-----------+-------------------------------------------------------+----------
       80+ |     1,384      3,051      2,028     11,091      3,127 |    20,681 
           |      7.43      15.76      14.91      41.31      15.11 |     20.86 
-----------+-------------------------------------------------------+----------
     Total |    18,628     19,364     13,599     26,850     20,694 |    99,135 
           |    100.00     100.00     100.00     100.00     100.00 |    100.00 

. tab agegroup bpcat,     col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Grouped |           Grouped blood pressure
       age |    Normal   Elevated  High, sta  High, sta |     Total
-----------+--------------------------------------------+----------
    18-<40 |    11,716      1,056      2,096     12,871 |    27,739 
           |     22.57      20.14      10.91      53.17 |     27.58 
-----------+--------------------------------------------+----------
    40-<50 |     6,600      1,398      1,762      2,340 |    12,100 
           |     12.72      26.67       9.17       9.67 |     12.03 
-----------+--------------------------------------------+----------
    50-<60 |     6,524      1,095     11,736      2,791 |    22,146 
           |     12.57      20.89      61.07      11.53 |     22.02 
-----------+--------------------------------------------+----------
    60-<70 |     5,219        667      1,258      2,310 |     9,454 
           |     10.05      12.72       6.55       9.54 |      9.40 
-----------+--------------------------------------------+----------
    70-<80 |     4,974        448        991      1,932 |     8,345 
           |      9.58       8.55       5.16       7.98 |      8.30 
-----------+--------------------------------------------+----------
       80+ |    16,873        578      1,374      1,961 |    20,786 
           |     32.51      11.03       7.15       8.10 |     20.67 
-----------+--------------------------------------------+----------
     Total |    51,906      5,242     19,217     24,205 |   100,570 
           |    100.00     100.00     100.00     100.00 |    100.00 

. 
. tab bmicat smoke,               col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |  Smoking
                     |   status
         Grouped BMI |     Never |     Total
---------------------+-----------+----------
 Underweight (<18.5) |     4,412 |     4,412 
                     |     14.66 |     14.66 
---------------------+-----------+----------
  Normal (18.5-24.9) |     5,780 |     5,780 
                     |     19.21 |     19.21 
---------------------+-----------+----------
Overweight (25-29.9) |     5,824 |     5,824 
                     |     19.36 |     19.36 
---------------------+-----------+----------
   Obese I (30-34.9) |     4,901 |     4,901 
                     |     16.29 |     16.29 
---------------------+-----------+----------
  Obese II (35-39.9) |     4,640 |     4,640 
                     |     15.42 |     15.42 
---------------------+-----------+----------
     Obese III (40+) |     4,533 |     4,533 
                     |     15.06 |     15.06 
---------------------+-----------+----------
               Total |    30,090 |    30,090 
                     |    100.00 |    100.00 

. tab bmicat ethnicity,   col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |                       Ethnicity
         Grouped BMI |     White  South Asi      Black      Other      Mixed |     Total
---------------------+-------------------------------------------------------+----------
 Underweight (<18.5) |       193          5         10          6      1,572 |     1,786 
                     |      1.88       3.05      10.00      25.00      15.68 |      8.68 
---------------------+-------------------------------------------------------+----------
  Normal (18.5-24.9) |     4,177         50         26          3      1,642 |     5,898 
                     |     40.66      30.49      26.00      12.50      16.38 |     28.65 
---------------------+-------------------------------------------------------+----------
Overweight (25-29.9) |     3,898         68         25          5      1,729 |     5,725 
                     |     37.95      41.46      25.00      20.83      17.25 |     27.81 
---------------------+-------------------------------------------------------+----------
   Obese I (30-34.9) |     1,470         26         22          2      1,664 |     3,184 
                     |     14.31      15.85      22.00       8.33      16.60 |     15.47 
---------------------+-------------------------------------------------------+----------
  Obese II (35-39.9) |       422          8          9          3      1,730 |     2,172 
                     |      4.11       4.88       9.00      12.50      17.26 |     10.55 
---------------------+-------------------------------------------------------+----------
     Obese III (40+) |       112          7          8          5      1,688 |     1,820 
                     |      1.09       4.27       8.00      20.83      16.84 |      8.84 
---------------------+-------------------------------------------------------+----------
               Total |    10,272        164        100         24     10,025 |    20,585 
                     |    100.00     100.00     100.00     100.00     100.00 |    100.00 

. tab bmicat imd,                 col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |          Index of Multiple Deprivation (IMD)
         Grouped BMI |         1          2          3          4          5 |     Total
---------------------+-------------------------------------------------------+----------
 Underweight (<18.5) |     2,992      2,817      1,914      4,294      3,089 |    15,106 
                     |     16.06      14.55      14.07      15.99      14.93 |     15.24 
---------------------+-------------------------------------------------------+----------
  Normal (18.5-24.9) |     3,325      3,826      2,747      4,617      4,238 |    18,753 
                     |     17.85      19.76      20.20      17.20      20.48 |     18.92 
---------------------+-------------------------------------------------------+----------
Overweight (25-29.9) |     3,240      3,717      2,816      4,698      4,099 |    18,570 
                     |     17.39      19.20      20.71      17.50      19.81 |     18.73 
---------------------+-------------------------------------------------------+----------
   Obese I (30-34.9) |     3,050      3,128      2,236      4,466      3,369 |    16,249 
                     |     16.37      16.15      16.44      16.63      16.28 |     16.39 
---------------------+-------------------------------------------------------+----------
  Obese II (35-39.9) |     3,064      2,892      1,942      4,460      2,970 |    15,328 
                     |     16.45      14.93      14.28      16.61      14.35 |     15.46 
---------------------+-------------------------------------------------------+----------
     Obese III (40+) |     2,957      2,984      1,944      4,315      2,929 |    15,129 
                     |     15.87      15.41      14.30      16.07      14.15 |     15.26 
---------------------+-------------------------------------------------------+----------
               Total |    18,628     19,364     13,599     26,850     20,694 |    99,135 
                     |    100.00     100.00     100.00     100.00     100.00 |    100.00 

. tab bmicat bpcat,               col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |           Grouped blood pressure
         Grouped BMI |    Normal   Elevated  High, sta  High, sta |     Total
---------------------+--------------------------------------------+----------
 Underweight (<18.5) |     8,524        564      2,854      3,279 |    15,221 
                     |     16.42      10.76      14.85      13.55 |     15.13 
---------------------+--------------------------------------------+----------
  Normal (18.5-24.9) |     9,450      1,539      3,712      4,524 |    19,225 
                     |     18.21      29.36      19.32      18.69 |     19.12 
---------------------+--------------------------------------------+----------
Overweight (25-29.9) |     8,983      1,225      3,666      5,096 |    18,970 
                     |     17.31      23.37      19.08      21.05 |     18.86 
---------------------+--------------------------------------------+----------
   Obese I (30-34.9) |     8,475        748      3,093      4,162 |    16,478 
                     |     16.33      14.27      16.10      17.19 |     16.38 
---------------------+--------------------------------------------+----------
  Obese II (35-39.9) |     8,226        590      2,969      3,671 |    15,456 
                     |     15.85      11.26      15.45      15.17 |     15.37 
---------------------+--------------------------------------------+----------
     Obese III (40+) |     8,248        576      2,923      3,473 |    15,220 
                     |     15.89      10.99      15.21      14.35 |     15.13 
---------------------+--------------------------------------------+----------
               Total |    51,906      5,242     19,217     24,205 |   100,570 
                     |    100.00     100.00     100.00     100.00 |    100.00 

. 
. tab smoke ethnicity,    col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

     Smoking |                       Ethnicity
      status |     White  South Asi      Black      Other      Mixed |     Total
-------------+-------------------------------------------------------+----------
       Never |     3,155         51         27          7      2,985 |     6,225 
             |    100.00     100.00     100.00     100.00     100.00 |    100.00 
-------------+-------------------------------------------------------+----------
       Total |     3,155         51         27          7      2,985 |     6,225 
             |    100.00     100.00     100.00     100.00     100.00 |    100.00 

. tab smoke imd,                  col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

     Smoking |          Index of Multiple Deprivation (IMD)
      status |         1          2          3          4          5 |     Total
-------------+-------------------------------------------------------+----------
       Never |     5,521      5,836      4,119      8,056      6,136 |    29,668 
             |    100.00     100.00     100.00     100.00     100.00 |    100.00 
-------------+-------------------------------------------------------+----------
       Total |     5,521      5,836      4,119      8,056      6,136 |    29,668 
             |    100.00     100.00     100.00     100.00     100.00 |    100.00 

. tab smoke bpcat,                col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

     Smoking |           Grouped blood pressure
      status |    Normal   Elevated  High, sta  High, sta |     Total
-------------+--------------------------------------------+----------
       Never |    15,406      1,623      5,815      7,246 |    30,090 
             |    100.00     100.00     100.00     100.00 |    100.00 
-------------+--------------------------------------------+----------
       Total |    15,406      1,623      5,815      7,246 |    30,090 
             |    100.00     100.00     100.00     100.00 |    100.00 

. 
. tab ethnicity imd,              col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

            |          Index of Multiple Deprivation (IMD)
  Ethnicity |         1          2          3          4          5 |     Total
------------+-------------------------------------------------------+----------
      White |       822      2,443      2,158        996      3,037 |     9,456 
            |     96.93      97.10      97.21       9.03      96.72 |     47.88 
------------+-------------------------------------------------------+----------
South Asian |         8         33         41         16         57 |       155 
            |      0.94       1.31       1.85       0.15       1.82 |      0.78 
------------+-------------------------------------------------------+----------
      Black |        10         25         17          8         33 |        93 
            |      1.18       0.99       0.77       0.07       1.05 |      0.47 
------------+-------------------------------------------------------+----------
      Other |         3          6          1          4          9 |        23 
            |      0.35       0.24       0.05       0.04       0.29 |      0.12 
------------+-------------------------------------------------------+----------
      Mixed |         5          9          3     10,001          4 |    10,022 
            |      0.59       0.36       0.14      90.71       0.13 |     50.75 
------------+-------------------------------------------------------+----------
      Total |       848      2,516      2,220     11,025      3,140 |    19,749 
            |    100.00     100.00     100.00     100.00     100.00 |    100.00 

. tab ethnicity bpcat,    col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

            |           Grouped blood pressure
  Ethnicity |    Normal   Elevated  High, sta  High, sta |     Total
------------+--------------------------------------------+----------
      White |     2,212      2,043      2,006      4,011 |    10,272 
            |     93.81      98.17      98.00      28.45 |     49.90 
------------+--------------------------------------------+----------
South Asian |        72         23         17         52 |       164 
            |      3.05       1.11       0.83       0.37 |      0.80 
------------+--------------------------------------------+----------
      Black |        39         13         19         29 |       100 
            |      1.65       0.62       0.93       0.21 |      0.49 
------------+--------------------------------------------+----------
      Other |        20          0          3          1 |        24 
            |      0.85       0.00       0.15       0.01 |      0.12 
------------+--------------------------------------------+----------
      Mixed |        15          2          2     10,006 |    10,025 
            |      0.64       0.10       0.10      70.97 |     48.70 
------------+--------------------------------------------+----------
      Total |     2,358      2,081      2,047     14,099 |    20,585 
            |    100.00     100.00     100.00     100.00 |    100.00 

. 
. tab imd bpcat,                  col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  Index of |
  Multiple |
Deprivatio |           Grouped blood pressure
   n (IMD) |    Normal   Elevated  High, sta  High, sta |     Total
-----------+--------------------------------------------+----------
         1 |     5,694        525     10,956      1,453 |    18,628 
           |     11.10      10.43      57.70       6.11 |     18.79 
-----------+--------------------------------------------+----------
         2 |    11,711      1,264      2,560      3,829 |    19,364 
           |     22.82      25.12      13.48      16.09 |     19.53 
-----------+--------------------------------------------+----------
         3 |     7,265      1,202      1,994      3,138 |    13,599 
           |     14.16      23.89      10.50      13.19 |     13.72 
-----------+--------------------------------------------+----------
         4 |    13,846        593        947     11,464 |    26,850 
           |     26.98      11.78       4.99      48.17 |     27.08 
-----------+--------------------------------------------+----------
         5 |    12,800      1,448      2,532      3,914 |    20,694 
           |     24.94      28.78      13.33      16.45 |     20.87 
-----------+--------------------------------------------+----------
     Total |    51,316      5,032     18,989     23,798 |    99,135 
           |    100.00     100.00     100.00     100.00 |    100.00 

. 
. 
. 
. /*  Relationships with demographic/lifestyle variables  */
. 
. * Relationships with age
. foreach var of varlist  chronic_respiratory_disease     ///
>                                                 asthma                                                  ///
>                                                 chronic_cardiac_disease                 ///
>                                                 diabetes                                                ///
>                                                 cancer_exhaem_lastyr                    ///
>                                                 haemmalig_aanaem_bmtrans_lastyr ///
>                                                 chronic_liver_disease                   ///
>                                                 other_neuro                                             ///
>                                                 chronic_kidney_disease                  ///
>                                                 organ_transplant                                ///     
>                                                 spleen                                                  ///
>                                                 ra_sle_psoriasis                                {
  2.         tab agegroup `var', r
  3. }

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Respiratory disease
   Grouped |    (excl. asthma)
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<40 |    27,567        172 |    27,739 
           |     99.38       0.62 |    100.00 
-----------+----------------------+----------
    40-<50 |    11,996        104 |    12,100 
           |     99.14       0.86 |    100.00 
-----------+----------------------+----------
    50-<60 |    22,031        115 |    22,146 
           |     99.48       0.52 |    100.00 
-----------+----------------------+----------
    60-<70 |     9,370         84 |     9,454 
           |     99.11       0.89 |    100.00 
-----------+----------------------+----------
    70-<80 |     8,284         61 |     8,345 
           |     99.27       0.73 |    100.00 
-----------+----------------------+----------
       80+ |    20,665        121 |    20,786 
           |     99.42       0.58 |    100.00 
-----------+----------------------+----------
     Total |    99,913        657 |   100,570 
           |     99.35       0.65 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped |        Asthma
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<40 |    27,720         19 |    27,739 
           |     99.93       0.07 |    100.00 
-----------+----------------------+----------
    40-<50 |    12,093          7 |    12,100 
           |     99.94       0.06 |    100.00 
-----------+----------------------+----------
    50-<60 |    22,139          7 |    22,146 
           |     99.97       0.03 |    100.00 
-----------+----------------------+----------
    60-<70 |     9,448          6 |     9,454 
           |     99.94       0.06 |    100.00 
-----------+----------------------+----------
    70-<80 |     8,342          3 |     8,345 
           |     99.96       0.04 |    100.00 
-----------+----------------------+----------
       80+ |    20,779          7 |    20,786 
           |     99.97       0.03 |    100.00 
-----------+----------------------+----------
     Total |   100,521         49 |   100,570 
           |     99.95       0.05 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped |     Heart disease
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<40 |    17,120     10,619 |    27,739 
           |     61.72      38.28 |    100.00 
-----------+----------------------+----------
    40-<50 |    11,794        306 |    12,100 
           |     97.47       2.53 |    100.00 
-----------+----------------------+----------
    50-<60 |    11,773     10,373 |    22,146 
           |     53.16      46.84 |    100.00 
-----------+----------------------+----------
    60-<70 |     9,156        298 |     9,454 
           |     96.85       3.15 |    100.00 
-----------+----------------------+----------
    70-<80 |     8,113        232 |     8,345 
           |     97.22       2.78 |    100.00 
-----------+----------------------+----------
       80+ |    20,343        443 |    20,786 
           |     97.87       2.13 |    100.00 
-----------+----------------------+----------
     Total |    78,299     22,271 |   100,570 
           |     77.86      22.14 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped |       Diabetes
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<40 |    16,560     11,179 |    27,739 
           |     59.70      40.30 |    100.00 
-----------+----------------------+----------
    40-<50 |     9,658      2,442 |    12,100 
           |     79.82      20.18 |    100.00 
-----------+----------------------+----------
    50-<60 |    10,302     11,844 |    22,146 
           |     46.52      53.48 |    100.00 
-----------+----------------------+----------
    60-<70 |     8,195      1,259 |     9,454 
           |     86.68      13.32 |    100.00 
-----------+----------------------+----------
    70-<80 |     7,550        795 |     8,345 
           |     90.47       9.53 |    100.00 
-----------+----------------------+----------
       80+ |    20,427        359 |    20,786 
           |     98.27       1.73 |    100.00 
-----------+----------------------+----------
     Total |    72,692     27,878 |   100,570 
           |     72.28      27.72 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Cancer other than
           |   haematological in
   Grouped |       last year
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<40 |    27,738          1 |    27,739 
           |    100.00       0.00 |    100.00 
-----------+----------------------+----------
    40-<50 |    12,100          0 |    12,100 
           |    100.00       0.00 |    100.00 
-----------+----------------------+----------
    50-<60 |    22,145          1 |    22,146 
           |    100.00       0.00 |    100.00 
-----------+----------------------+----------
    60-<70 |     9,453          1 |     9,454 
           |     99.99       0.01 |    100.00 
-----------+----------------------+----------
    70-<80 |     8,345          0 |     8,345 
           |    100.00       0.00 |    100.00 
-----------+----------------------+----------
       80+ |    20,785          1 |    20,786 
           |    100.00       0.00 |    100.00 
-----------+----------------------+----------
     Total |   100,566          4 |   100,570 
           |    100.00       0.00 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           | Haematol malignancy,
           |  aplastic anaemia or
           |      bone marrow
           |  transplant in last
   Grouped |         year
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<40 |    27,738          1 |    27,739 
           |    100.00       0.00 |    100.00 
-----------+----------------------+----------
    40-<50 |    12,099          1 |    12,100 
           |     99.99       0.01 |    100.00 
-----------+----------------------+----------
    50-<60 |    22,146          0 |    22,146 
           |    100.00       0.00 |    100.00 
-----------+----------------------+----------
    60-<70 |     9,454          0 |     9,454 
           |    100.00       0.00 |    100.00 
-----------+----------------------+----------
    70-<80 |     8,345          0 |     8,345 
           |    100.00       0.00 |    100.00 
-----------+----------------------+----------
       80+ |    20,785          1 |    20,786 
           |    100.00       0.00 |    100.00 
-----------+----------------------+----------
     Total |   100,567          3 |   100,570 
           |    100.00       0.00 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped |         Liver
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<40 |    17,723     10,016 |    27,739 
           |     63.89      36.11 |    100.00 
-----------+----------------------+----------
    40-<50 |    12,094          6 |    12,100 
           |     99.95       0.05 |    100.00 
-----------+----------------------+----------
    50-<60 |    22,136         10 |    22,146 
           |     99.95       0.05 |    100.00 
-----------+----------------------+----------
    60-<70 |     9,447          7 |     9,454 
           |     99.93       0.07 |    100.00 
-----------+----------------------+----------
    70-<80 |     8,340          5 |     8,345 
           |     99.94       0.06 |    100.00 
-----------+----------------------+----------
       80+ |    20,769         17 |    20,786 
           |     99.92       0.08 |    100.00 
-----------+----------------------+----------
     Total |    90,509     10,061 |   100,570 
           |     90.00      10.00 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           | Neuro condition other
   Grouped | than stroke/dementia
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<40 |    27,664         75 |    27,739 
           |     99.73       0.27 |    100.00 
-----------+----------------------+----------
    40-<50 |    12,062         38 |    12,100 
           |     99.69       0.31 |    100.00 
-----------+----------------------+----------
    50-<60 |    22,102         44 |    22,146 
           |     99.80       0.20 |    100.00 
-----------+----------------------+----------
    60-<70 |     9,404         50 |     9,454 
           |     99.47       0.53 |    100.00 
-----------+----------------------+----------
    70-<80 |     8,322         23 |     8,345 
           |     99.72       0.28 |    100.00 
-----------+----------------------+----------
       80+ |    20,737         49 |    20,786 
           |     99.76       0.24 |    100.00 
-----------+----------------------+----------
     Total |   100,291        279 |   100,570 
           |     99.72       0.28 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped |    Kidney disease
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<40 |    26,301      1,438 |    27,739 
           |     94.82       5.18 |    100.00 
-----------+----------------------+----------
    40-<50 |    11,519        581 |    12,100 
           |     95.20       4.80 |    100.00 
-----------+----------------------+----------
    50-<60 |    21,042      1,104 |    22,146 
           |     95.01       4.99 |    100.00 
-----------+----------------------+----------
    60-<70 |     8,969        485 |     9,454 
           |     94.87       5.13 |    100.00 
-----------+----------------------+----------
    70-<80 |     7,905        440 |     8,345 
           |     94.73       5.27 |    100.00 
-----------+----------------------+----------
       80+ |    19,732      1,054 |    20,786 
           |     94.93       5.07 |    100.00 
-----------+----------------------+----------
     Total |    95,468      5,102 |   100,570 
           |     94.93       5.07 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Organ transplant
   Grouped |       recipient
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<40 |    27,735          4 |    27,739 
           |     99.99       0.01 |    100.00 
-----------+----------------------+----------
    40-<50 |    12,099          1 |    12,100 
           |     99.99       0.01 |    100.00 
-----------+----------------------+----------
    50-<60 |    22,139          7 |    22,146 
           |     99.97       0.03 |    100.00 
-----------+----------------------+----------
    60-<70 |     9,452          2 |     9,454 
           |     99.98       0.02 |    100.00 
-----------+----------------------+----------
    70-<80 |     8,344          1 |     8,345 
           |     99.99       0.01 |    100.00 
-----------+----------------------+----------
       80+ |    20,782          4 |    20,786 
           |     99.98       0.02 |    100.00 
-----------+----------------------+----------
     Total |   100,551         19 |   100,570 
           |     99.98       0.02 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |    Spleen problems
           |  (dysplenia, sickle
   Grouped |         cell)
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<40 |    27,730          9 |    27,739 
           |     99.97       0.03 |    100.00 
-----------+----------------------+----------
    40-<50 |    12,097          3 |    12,100 
           |     99.98       0.02 |    100.00 
-----------+----------------------+----------
    50-<60 |    12,136     10,010 |    22,146 
           |     54.80      45.20 |    100.00 
-----------+----------------------+----------
    60-<70 |     9,448          6 |     9,454 
           |     99.94       0.06 |    100.00 
-----------+----------------------+----------
    70-<80 |     8,339          6 |     8,345 
           |     99.93       0.07 |    100.00 
-----------+----------------------+----------
       80+ |    20,780          6 |    20,786 
           |     99.97       0.03 |    100.00 
-----------+----------------------+----------
     Total |    90,530     10,040 |   100,570 
           |     90.02       9.98 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  RA, SLE, Psoriasis
   Grouped | (autoimmune disease)
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<40 |    27,568        171 |    27,739 
           |     99.38       0.62 |    100.00 
-----------+----------------------+----------
    40-<50 |    12,002         98 |    12,100 
           |     99.19       0.81 |    100.00 
-----------+----------------------+----------
    50-<60 |    22,048         98 |    22,146 
           |     99.56       0.44 |    100.00 
-----------+----------------------+----------
    60-<70 |     9,365         89 |     9,454 
           |     99.06       0.94 |    100.00 
-----------+----------------------+----------
    70-<80 |     8,270         75 |     8,345 
           |     99.10       0.90 |    100.00 
-----------+----------------------+----------
       80+ |    20,666        120 |    20,786 
           |     99.42       0.58 |    100.00 
-----------+----------------------+----------
     Total |    99,919        651 |   100,570 
           |     99.35       0.65 |    100.00 

. 
. 
. * Relationships with sex
. foreach var of varlist  chronic_respiratory_disease     ///
>                                                 asthma                                                  ///
>                                                 chronic_cardiac_disease                 ///
>                                                 diabetes                                                ///
>                                                 cancer_exhaem_lastyr                    ///
>                                                 haemmalig_aanaem_bmtrans_lastyr ///
>                                                 chronic_liver_disease                   ///
>                                                 other_neuro                                             ///
>                                                 chronic_kidney_disease                  ///
>                                                 organ_transplant                                ///     
>                                                 spleen                                                  ///
>                                                 ra_sle_psoriasis                                {
  2.         tab male `var', r
  3. }

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Respiratory disease
           |    (excl. asthma)
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |    54,943        299 |    55,242 
           |     99.46       0.54 |    100.00 
-----------+----------------------+----------
         1 |    44,970        358 |    45,328 
           |     99.21       0.79 |    100.00 
-----------+----------------------+----------
     Total |    99,913        657 |   100,570 
           |     99.35       0.65 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |        Asthma
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |    55,220         22 |    55,242 
           |     99.96       0.04 |    100.00 
-----------+----------------------+----------
         1 |    45,301         27 |    45,328 
           |     99.94       0.06 |    100.00 
-----------+----------------------+----------
     Total |   100,521         49 |   100,570 
           |     99.95       0.05 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |     Heart disease
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |    44,278     10,964 |    55,242 
           |     80.15      19.85 |    100.00 
-----------+----------------------+----------
         1 |    34,021     11,307 |    45,328 
           |     75.06      24.94 |    100.00 
-----------+----------------------+----------
     Total |    78,299     22,271 |   100,570 
           |     77.86      22.14 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |       Diabetes
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |    41,489     13,753 |    55,242 
           |     75.10      24.90 |    100.00 
-----------+----------------------+----------
         1 |    31,203     14,125 |    45,328 
           |     68.84      31.16 |    100.00 
-----------+----------------------+----------
     Total |    72,692     27,878 |   100,570 
           |     72.28      27.72 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Cancer other than
           |   haematological in
           |       last year
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |    55,240          2 |    55,242 
           |    100.00       0.00 |    100.00 
-----------+----------------------+----------
         1 |    45,326          2 |    45,328 
           |    100.00       0.00 |    100.00 
-----------+----------------------+----------
     Total |   100,566          4 |   100,570 
           |    100.00       0.00 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           | Haematol malignancy,
           |  aplastic anaemia or
           |      bone marrow
           |  transplant in last
           |         year
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |    55,239          3 |    55,242 
           |     99.99       0.01 |    100.00 
-----------+----------------------+----------
         1 |    45,328          0 |    45,328 
           |    100.00       0.00 |    100.00 
-----------+----------------------+----------
     Total |   100,567          3 |   100,570 
           |    100.00       0.00 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |         Liver
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |    45,210     10,032 |    55,242 
           |     81.84      18.16 |    100.00 
-----------+----------------------+----------
         1 |    45,299         29 |    45,328 
           |     99.94       0.06 |    100.00 
-----------+----------------------+----------
     Total |    90,509     10,061 |   100,570 
           |     90.00      10.00 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           | Neuro condition other
           | than stroke/dementia
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |    55,097        145 |    55,242 
           |     99.74       0.26 |    100.00 
-----------+----------------------+----------
         1 |    45,194        134 |    45,328 
           |     99.70       0.30 |    100.00 
-----------+----------------------+----------
     Total |   100,291        279 |   100,570 
           |     99.72       0.28 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |    Kidney disease
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |    52,468      2,774 |    55,242 
           |     94.98       5.02 |    100.00 
-----------+----------------------+----------
         1 |    43,000      2,328 |    45,328 
           |     94.86       5.14 |    100.00 
-----------+----------------------+----------
     Total |    95,468      5,102 |   100,570 
           |     94.93       5.07 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Organ transplant
           |       recipient
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |    55,236          6 |    55,242 
           |     99.99       0.01 |    100.00 
-----------+----------------------+----------
         1 |    45,315         13 |    45,328 
           |     99.97       0.03 |    100.00 
-----------+----------------------+----------
     Total |   100,551         19 |   100,570 
           |     99.98       0.02 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |    Spleen problems
           |  (dysplenia, sickle
           |         cell)
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |    55,226         16 |    55,242 
           |     99.97       0.03 |    100.00 
-----------+----------------------+----------
         1 |    35,304     10,024 |    45,328 
           |     77.89      22.11 |    100.00 
-----------+----------------------+----------
     Total |    90,530     10,040 |   100,570 
           |     90.02       9.98 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  RA, SLE, Psoriasis
           | (autoimmune disease)
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |    54,851        391 |    55,242 
           |     99.29       0.71 |    100.00 
-----------+----------------------+----------
         1 |    45,068        260 |    45,328 
           |     99.43       0.57 |    100.00 
-----------+----------------------+----------
     Total |    99,919        651 |   100,570 
           |     99.35       0.65 |    100.00 

. 
. 
. /*  Relationships between conditions  */
. 
. 
. * Respiratory
. tab chronic_respiratory_disease asthma 

Respirator |
 y disease |
    (excl. |        Asthma
   asthma) |         0          1 |     Total
-----------+----------------------+----------
         0 |    99,865         48 |    99,913 
         1 |       656          1 |       657 
-----------+----------------------+----------
     Total |   100,521         49 |   100,570 

. 
. * Cardiac
. tab diabetes chronic_cardiac_disease

           |     Heart disease
  Diabetes |         0          1 |     Total
-----------+----------------------+----------
         0 |    70,826      1,866 |    72,692 
         1 |     7,473     20,405 |    27,878 
-----------+----------------------+----------
     Total |    78,299     22,271 |   100,570 

. tab chronic_cardiac_disease bpcat

     Heart |           Grouped blood pressure
   disease |    Normal   Elevated  High, sta  High, sta |     Total
-----------+--------------------------------------------+----------
         0 |    51,448      5,095      8,753     13,003 |    78,299 
         1 |       458        147     10,464     11,202 |    22,271 
-----------+--------------------------------------------+----------
     Total |    51,906      5,242     19,217     24,205 |   100,570 

. 
. 
. 
. 
. 
. 
. 
. ********************************************
. *  Cross-check logical date relationships  *
. ********************************************
. 
. * Cross check dates of hosp/itu/death??
. 
. 
. 
. 
. 
. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  C:\Github\opencorona-risk-factors-research\analysis\output/an_checks.log
  log type:  text
 closed on:  23 Apr 2020, 11:05:06
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
