---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Github\opencorona-risk-factors-research\analysis\output/an_descriptive_tables.log
  log type:  text
 opened on:  29 Apr 2020, 22:18:41

. 
. use cr_create_analysis_dataset, clear
(Analysis dataset for the poor outcomes in Covid project)

. 
. 
. **********************************
. *  Distribution in whole cohort  *
. **********************************
. 
. 
. * Demographics
. summ age

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |    100,575    55.50301    23.01524         18        105

. tab agegroup

Grouped age |      Freq.     Percent        Cum.
------------+-----------------------------------
     18-<40 |     27,742       27.58       27.58
     40-<50 |     12,101       12.03       39.62
     50-<60 |     22,146       22.02       61.63
     60-<70 |      9,455        9.40       71.04
     70-<80 |      8,345        8.30       79.33
        80+ |     20,786       20.67      100.00
------------+-----------------------------------
      Total |    100,575      100.00

. tab male

       Male |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     55,244       54.93       54.93
          1 |     45,331       45.07      100.00
------------+-----------------------------------
      Total |    100,575      100.00

. tab bmicat

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |        154        1.48        1.48
  Normal (18.5-24.9) |      4,288       41.29       42.78
Overweight (25-29.9) |      3,969       38.22       81.00
   Obese I (30-34.9) |      1,497       14.42       95.42
  Obese II (35-39.9) |        401        3.86       99.28
     Obese III (40+) |         75        0.72      100.00
---------------------+-----------------------------------
               Total |     10,384      100.00

. tab bmicat, m

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |        154        0.15        0.15
  Normal (18.5-24.9) |      4,288        4.26        4.42
Overweight (25-29.9) |      3,969        3.95        8.36
   Obese I (30-34.9) |      1,497        1.49        9.85
  Obese II (35-39.9) |        401        0.40       10.25
     Obese III (40+) |         75        0.07       10.32
        Unknown (.u) |     90,191       89.68      100.00
---------------------+-----------------------------------
               Total |    100,575      100.00

. tab obese4cat

 Evidence of obesity |
      (4 categories) |      Freq.     Percent        Cum.
---------------------+-----------------------------------
No record of obesity |     98,602       98.04       98.04
   Obese I (30-34.9) |      1,497        1.49       99.53
  Obese II (35-39.9) |        401        0.40       99.93
     Obese III (40+) |         75        0.07      100.00
---------------------+-----------------------------------
               Total |    100,575      100.00

. tab smoke

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |      5,863       12.79       12.79
      Former |     12,807       27.94       40.73
     Current |     27,170       59.27      100.00
-------------+-----------------------------------
       Total |     45,840      100.00

. tab smoke, m

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |      5,863        5.83        5.83
      Former |     12,807       12.73       18.56
     Current |     27,170       27.01       45.58
Unknown (.u) |     54,735       54.42      100.00
-------------+-----------------------------------
       Total |    100,575      100.00

. tab bpcat

 Grouped blood |
      pressure |      Freq.     Percent        Cum.
---------------+-----------------------------------
        Normal |     14,412       26.19       26.19
      Elevated |      3,171        5.76       31.95
 High, stage I |     17,254       31.35       63.30
High, stage II |     20,197       36.70      100.00
---------------+-----------------------------------
         Total |     55,034      100.00

. tab bpcat, m

 Grouped blood |
      pressure |      Freq.     Percent        Cum.
---------------+-----------------------------------
        Normal |     14,412       14.33       14.33
      Elevated |      3,171        3.15       17.48
 High, stage I |     17,254       17.16       34.64
High, stage II |     20,197       20.08       54.72
       Unknown |     45,541       45.28      100.00
---------------+-----------------------------------
         Total |    100,575      100.00

. tab htdiag_or_highbp

  Diagnosed |
hypertensio |
  n or high |
      blood |
   pressure |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     79,002       78.55       78.55
          1 |     21,573       21.45      100.00
------------+-----------------------------------
      Total |    100,575      100.00

. 
. 
. * Comorbidities
. tab chronic_respiratory_disease

Respiratory |
    disease |
     (excl. |
    asthma) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     99,932       99.36       99.36
          1 |        643        0.64      100.00
------------+-----------------------------------
      Total |    100,575      100.00

. tab asthma

     Asthma |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     87,505       87.00       87.00
          1 |     13,070       13.00      100.00
------------+-----------------------------------
      Total |    100,575      100.00

. tab asthmacat

     Asthma, |
  grouped by |
    severity |
   (OCS use) |      Freq.     Percent        Cum.
-------------+-----------------------------------
          No |     87,505       87.00       87.00
 Yes, no OCS |     13,070       13.00      100.00
-------------+-----------------------------------
       Total |    100,575      100.00

. tab chronic_cardiac_disease

      Heart |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     78,304       77.86       77.86
          1 |     22,271       22.14      100.00
------------+-----------------------------------
      Total |    100,575      100.00

. tab diabetes

   Diabetes |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     72,696       72.28       72.28
          1 |     27,879       27.72      100.00
------------+-----------------------------------
      Total |    100,575      100.00

. tab diabcat

         Diabetes, grouped |      Freq.     Percent        Cum.
---------------------------+-----------------------------------
               No diabetes |     72,696       72.28       72.28
Diabetes, no hba1c measure |     27,879       27.72      100.00
---------------------------+-----------------------------------
                     Total |    100,575      100.00

. tab cancer_exhaem_cat

 Cancer (exc. |
haematologica |
  l), grouped |
by time since |
    diagnosis |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never |    100,035       99.46       99.46
    Last year |          4        0.00       99.47
2-5 years ago |          3        0.00       99.47
     5+ years |        533        0.53      100.00
--------------+-----------------------------------
        Total |    100,575      100.00

. tab cancer_haem_cat

Haematologica |
l malignancy, |
   grouped by |
   time since |
    diagnosis |      Freq.     Percent        Cum.
--------------+-----------------------------------
        Never |     90,477       89.96       89.96
    Last year |          2        0.00       89.96
2-5 years ago |          3        0.00       89.96
     5+ years |     10,093       10.04      100.00
--------------+-----------------------------------
        Total |    100,575      100.00

. tab chronic_liver_disease

    Chronic |
      liver |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     90,514       90.00       90.00
          1 |     10,061       10.00      100.00
------------+-----------------------------------
      Total |    100,575      100.00

. tab dementia

   dementia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    100,568       99.99       99.99
          1 |          7        0.01      100.00
------------+-----------------------------------
      Total |    100,575      100.00

. tab stroke

     stroke |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     90,154       89.64       89.64
          1 |     10,421       10.36      100.00
------------+-----------------------------------
      Total |    100,575      100.00

. tab stroke_dementia

  Stroke or |
   dementia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     90,148       89.63       89.63
          1 |     10,427       10.37      100.00
------------+-----------------------------------
      Total |    100,575      100.00

. tab other_neuro

      Neuro |
  condition |
 other than |
stroke/deme |
       ntia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    100,295       99.72       99.72
          1 |        280        0.28      100.00
------------+-----------------------------------
      Total |    100,575      100.00

. tab chronic_kidney_disease

     Kidney |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     99,810       99.24       99.24
          1 |        765        0.76      100.00
------------+-----------------------------------
      Total |    100,575      100.00

. tab organ_transplant

      Organ |
 transplant |
  recipient |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    100,556       99.98       99.98
          1 |         19        0.02      100.00
------------+-----------------------------------
      Total |    100,575      100.00

. tab chronic_kidney_disease

     Kidney |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     99,810       99.24       99.24
          1 |        765        0.76      100.00
------------+-----------------------------------
      Total |    100,575      100.00

. tab organ_transplant

      Organ |
 transplant |
  recipient |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    100,556       99.98       99.98
          1 |         19        0.02      100.00
------------+-----------------------------------
      Total |    100,575      100.00

. tab spleen

     Spleen |
   problems |
(dysplenia, |
     sickle |
      cell) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     90,535       90.02       90.02
          1 |     10,040        9.98      100.00
------------+-----------------------------------
      Total |    100,575      100.00

. tab ra_sle_psoriasis

   RA, SLE, |
  Psoriasis |
(autoimmune |
   disease) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     99,924       99.35       99.35
          1 |        651        0.65      100.00
------------+-----------------------------------
      Total |    100,575      100.00

. tab other_immunosuppression

Immunosuppr |
      essed |
(combinatio |
          n |
 algorithm) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    100,551       99.98       99.98
          1 |         24        0.02      100.00
------------+-----------------------------------
      Total |    100,575      100.00

. 
. tab imd 

        Index of |
        Multiple |
     Deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |     20,713       20.88       20.88
               2 |     26,874       27.09       47.98
               3 |     13,582       13.69       61.67
               4 |     19,362       19.52       81.19
 5 most deprived |     18,657       18.81      100.00
-----------------+-----------------------------------
           Total |     99,188      100.00

. tab imd, m

        Index of |
        Multiple |
     Deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |     20,713       20.59       20.59
               2 |     26,874       26.72       47.31
               3 |     13,582       13.50       60.82
               4 |     19,362       19.25       80.07
 5 most deprived |     18,657       18.55       98.62
         Unknown |      1,387        1.38      100.00
-----------------+-----------------------------------
           Total |    100,575      100.00

. tab ethnicity

             Ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |     10,272       49.90       49.90
                 Mixed |        165        0.80       50.70
Asian or Asian British |        100        0.49       51.19
                 Black |         24        0.12       51.30
                 Other |     10,024       48.70      100.00
-----------------------+-----------------------------------
                 Total |     20,585      100.00

. tab ethnicity, m

             Ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |     10,272       10.21       10.21
                 Mixed |        165        0.16       10.38
Asian or Asian British |        100        0.10       10.48
                 Black |         24        0.02       10.50
                 Other |     10,024        9.97       20.47
               Unknown |     79,990       79.53      100.00
-----------------------+-----------------------------------
                 Total |    100,575      100.00

. *tab urban
. tab region

     Geographical region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
                    East |         61        0.08        0.08
                  London |          7        0.01        0.09
              North East |        569        0.76        0.85
              North West |         30        0.04        0.89
              South East |          1        0.00        0.89
              South West |          1        0.00        0.89
           West Midlands |        386        0.51        1.41
Yorkshire and The Humber |     73,986       98.59      100.00
-------------------------+-----------------------------------
                   Total |     75,041      100.00

. 
. 
. * Outcomes
. tab onscoviddeath

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
  ONS covid |
      death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    100,574      100.00      100.00
          1 |          1        0.00      100.00
------------+-----------------------------------
      Total |    100,575      100.00

. tab cpnsdeath

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
 CPNS covid |
      death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    100,571      100.00      100.00
          1 |          4        0.00      100.00
------------+-----------------------------------
      Total |    100,575      100.00

. tab ituadmission

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
        ITU |
  admission |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    100,570      100.00      100.00
          1 |          5        0.00      100.00
------------+-----------------------------------
      Total |    100,575      100.00

. * tab ecds
. 
. 
. 
. 
. 
. **********************************
. *  Number (%) with each outcome  *
. **********************************
. 
. foreach outvar of varlist onscoviddeath cpnsdeath ituadmission {
  2. 
. *** Repeat for each outcome
. 
.         * Demographics
.         tab agegroup                                                    `outvar', col
  3.         tab male                                                                `outvar', col
  4.         tab bmicat                                                              `outvar', col m 
  5.         tab smoke                                                               `outvar', col m
  6.         tab obese4cat                                                   `outvar', col m 
  7. 
.         * Comorbidities
.         tab chronic_respiratory_disease                 `outvar', col
  8.         tab asthma                                                              `outvar', col
  9.         tab asthmacat                                                   `outvar', col
 10.         tab chronic_cardiac_disease                     `outvar', col
 11.         tab diabetes                                                    `outvar', col
 12.         tab diabcat                                                     `outvar', col
 13.         tab cancer_exhaem_cat                                   `outvar', col
 14.         tab cancer_haem_cat                                             `outvar', col
 15.         tab chronic_liver_disease                               `outvar', col
 16.         tab stroke                                                              `outvar', col
 17.         tab dementia                                                    `outvar', col
 18.         tab stroke_dementia                                     `outvar', col
 19.         tab other_neuro                                                 `outvar', col
 20.         tab chronic_kidney_disease                              `outvar', col
 21.         tab organ_transplant                                    `outvar', col
 22.         tab spleen                                                              `outvar', col
 23.         tab ra_sle_psoriasis                                    `outvar', col
 24.         tab other_immunosuppression                             `outvar', col
 25.         
.         tab imd                                                                 `outvar', col m
 26.         tab ethnicity                                                   `outvar', col m
 27.         *tab urban                                                              `outvar', col
.         tab region                                                              `outvar', col
 28. }

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: ONS covid
   Grouped |         death
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<40 |    27,742          0 |    27,742 
           |     27.58       0.00 |     27.58 
-----------+----------------------+----------
    40-<50 |    12,101          0 |    12,101 
           |     12.03       0.00 |     12.03 
-----------+----------------------+----------
    50-<60 |    22,146          0 |    22,146 
           |     22.02       0.00 |     22.02 
-----------+----------------------+----------
    60-<70 |     9,455          0 |     9,455 
           |      9.40       0.00 |      9.40 
-----------+----------------------+----------
    70-<80 |     8,345          0 |     8,345 
           |      8.30       0.00 |      8.30 
-----------+----------------------+----------
       80+ |    20,785          1 |    20,786 
           |     20.67     100.00 |     20.67 
-----------+----------------------+----------
     Total |   100,574          1 |   100,575 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: ONS covid
           |         death
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |    55,243          1 |    55,244 
           |     54.93     100.00 |     54.93 
-----------+----------------------+----------
         1 |    45,331          0 |    45,331 
           |     45.07       0.00 |     45.07 
-----------+----------------------+----------
     Total |   100,574          1 |   100,575 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |  outcome: ONS covid
                     |         death
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |       154          0 |       154 
                     |      0.15       0.00 |      0.15 
---------------------+----------------------+----------
  Normal (18.5-24.9) |     4,288          0 |     4,288 
                     |      4.26       0.00 |      4.26 
---------------------+----------------------+----------
Overweight (25-29.9) |     3,969          0 |     3,969 
                     |      3.95       0.00 |      3.95 
---------------------+----------------------+----------
   Obese I (30-34.9) |     1,497          0 |     1,497 
                     |      1.49       0.00 |      1.49 
---------------------+----------------------+----------
  Obese II (35-39.9) |       401          0 |       401 
                     |      0.40       0.00 |      0.40 
---------------------+----------------------+----------
     Obese III (40+) |        75          0 |        75 
                     |      0.07       0.00 |      0.07 
---------------------+----------------------+----------
        Unknown (.u) |    90,190          1 |    90,191 
                     |     89.68     100.00 |     89.68 
---------------------+----------------------+----------
               Total |   100,574          1 |   100,575 
                     |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   Failure/censoring
             |     indicator for
             |  outcome: ONS covid
     Smoking |         death
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |     5,863          0 |     5,863 
             |      5.83       0.00 |      5.83 
-------------+----------------------+----------
      Former |    12,807          0 |    12,807 
             |     12.73       0.00 |     12.73 
-------------+----------------------+----------
     Current |    27,170          0 |    27,170 
             |     27.01       0.00 |     27.01 
-------------+----------------------+----------
Unknown (.u) |    54,734          1 |    54,735 
             |     54.42     100.00 |     54.42 
-------------+----------------------+----------
       Total |   100,574          1 |   100,575 
             |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |  outcome: ONS covid
 Evidence of obesity |         death
      (4 categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity |    98,601          1 |    98,602 
                     |     98.04     100.00 |     98.04 
---------------------+----------------------+----------
   Obese I (30-34.9) |     1,497          0 |     1,497 
                     |      1.49       0.00 |      1.49 
---------------------+----------------------+----------
  Obese II (35-39.9) |       401          0 |       401 
                     |      0.40       0.00 |      0.40 
---------------------+----------------------+----------
     Obese III (40+) |        75          0 |        75 
                     |      0.07       0.00 |      0.07 
---------------------+----------------------+----------
               Total |   100,574          1 |   100,575 
                     |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
Respirator |     indicator for
 y disease |  outcome: ONS covid
    (excl. |         death
   asthma) |         0          1 |     Total
-----------+----------------------+----------
         0 |    99,931          1 |    99,932 
           |     99.36     100.00 |     99.36 
-----------+----------------------+----------
         1 |       643          0 |       643 
           |      0.64       0.00 |      0.64 
-----------+----------------------+----------
     Total |   100,574          1 |   100,575 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: ONS covid
           |         death
    Asthma |         0          1 |     Total
-----------+----------------------+----------
         0 |    87,504          1 |    87,505 
           |     87.00     100.00 |     87.00 
-----------+----------------------+----------
         1 |    13,070          0 |    13,070 
           |     13.00       0.00 |     13.00 
-----------+----------------------+----------
     Total |   100,574          1 |   100,575 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   Failure/censoring
     Asthma, |     indicator for
  grouped by |  outcome: ONS covid
    severity |         death
   (OCS use) |         0          1 |     Total
-------------+----------------------+----------
          No |    87,504          1 |    87,505 
             |     87.00     100.00 |     87.00 
-------------+----------------------+----------
 Yes, no OCS |    13,070          0 |    13,070 
             |     13.00       0.00 |     13.00 
-------------+----------------------+----------
       Total |   100,574          1 |   100,575 
             |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: ONS covid
     Heart |         death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    78,303          1 |    78,304 
           |     77.86     100.00 |     77.86 
-----------+----------------------+----------
         1 |    22,271          0 |    22,271 
           |     22.14       0.00 |     22.14 
-----------+----------------------+----------
     Total |   100,574          1 |   100,575 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: ONS covid
           |         death
  Diabetes |         0          1 |     Total
-----------+----------------------+----------
         0 |    72,695          1 |    72,696 
           |     72.28     100.00 |     72.28 
-----------+----------------------+----------
         1 |    27,879          0 |    27,879 
           |     27.72       0.00 |     27.72 
-----------+----------------------+----------
     Total |   100,574          1 |   100,575 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |  outcome: ONS covid
                      |         death
    Diabetes, grouped |         0          1 |     Total
----------------------+----------------------+----------
          No diabetes |    72,695          1 |    72,696 
                      |     72.28     100.00 |     72.28 
----------------------+----------------------+----------
Diabetes, no hba1c me |    27,879          0 |    27,879 
                      |     27.72       0.00 |     27.72 
----------------------+----------------------+----------
                Total |   100,574          1 |   100,575 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

 Cancer (exc. |   Failure/censoring
haematologica |     indicator for
  l), grouped |  outcome: ONS covid
by time since |         death
    diagnosis |         0          1 |     Total
--------------+----------------------+----------
        Never |   100,034          1 |   100,035 
              |     99.46     100.00 |     99.46 
--------------+----------------------+----------
    Last year |         4          0 |         4 
              |      0.00       0.00 |      0.00 
--------------+----------------------+----------
2-5 years ago |         3          0 |         3 
              |      0.00       0.00 |      0.00 
--------------+----------------------+----------
     5+ years |       533          0 |       533 
              |      0.53       0.00 |      0.53 
--------------+----------------------+----------
        Total |   100,574          1 |   100,575 
              |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Haematologica |   Failure/censoring
l malignancy, |     indicator for
   grouped by |  outcome: ONS covid
   time since |         death
    diagnosis |         0          1 |     Total
--------------+----------------------+----------
        Never |    90,476          1 |    90,477 
              |     89.96     100.00 |     89.96 
--------------+----------------------+----------
    Last year |         2          0 |         2 
              |      0.00       0.00 |      0.00 
--------------+----------------------+----------
2-5 years ago |         3          0 |         3 
              |      0.00       0.00 |      0.00 
--------------+----------------------+----------
     5+ years |    10,093          0 |    10,093 
              |     10.04       0.00 |     10.04 
--------------+----------------------+----------
        Total |   100,574          1 |   100,575 
              |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: ONS covid
     liver |         death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    90,513          1 |    90,514 
           |     90.00     100.00 |     90.00 
-----------+----------------------+----------
         1 |    10,061          0 |    10,061 
           |     10.00       0.00 |     10.00 
-----------+----------------------+----------
     Total |   100,574          1 |   100,575 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: ONS covid
           |         death
    stroke |         0          1 |     Total
-----------+----------------------+----------
         0 |    90,153          1 |    90,154 
           |     89.64     100.00 |     89.64 
-----------+----------------------+----------
         1 |    10,421          0 |    10,421 
           |     10.36       0.00 |     10.36 
-----------+----------------------+----------
     Total |   100,574          1 |   100,575 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: ONS covid
           |         death
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |   100,567          1 |   100,568 
           |     99.99     100.00 |     99.99 
-----------+----------------------+----------
         1 |         7          0 |         7 
           |      0.01       0.00 |      0.01 
-----------+----------------------+----------
     Total |   100,574          1 |   100,575 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: ONS covid
 Stroke or |         death
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |    90,147          1 |    90,148 
           |     89.63     100.00 |     89.63 
-----------+----------------------+----------
         1 |    10,427          0 |    10,427 
           |     10.37       0.00 |     10.37 
-----------+----------------------+----------
     Total |   100,574          1 |   100,575 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

     Neuro |   Failure/censoring
 condition |     indicator for
other than |  outcome: ONS covid
stroke/dem |         death
     entia |         0          1 |     Total
-----------+----------------------+----------
         0 |   100,294          1 |   100,295 
           |     99.72     100.00 |     99.72 
-----------+----------------------+----------
         1 |       280          0 |       280 
           |      0.28       0.00 |      0.28 
-----------+----------------------+----------
     Total |   100,574          1 |   100,575 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: ONS covid
    Kidney |         death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    99,809          1 |    99,810 
           |     99.24     100.00 |     99.24 
-----------+----------------------+----------
         1 |       765          0 |       765 
           |      0.76       0.00 |      0.76 
-----------+----------------------+----------
     Total |   100,574          1 |   100,575 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
     Organ |  outcome: ONS covid
transplant |         death
 recipient |         0          1 |     Total
-----------+----------------------+----------
         0 |   100,555          1 |   100,556 
           |     99.98     100.00 |     99.98 
-----------+----------------------+----------
         1 |        19          0 |        19 
           |      0.02       0.00 |      0.02 
-----------+----------------------+----------
     Total |   100,574          1 |   100,575 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

    Spleen |   Failure/censoring
  problems |     indicator for
(dysplenia |  outcome: ONS covid
  , sickle |         death
     cell) |         0          1 |     Total
-----------+----------------------+----------
         0 |    90,534          1 |    90,535 
           |     90.02     100.00 |     90.02 
-----------+----------------------+----------
         1 |    10,040          0 |    10,040 
           |      9.98       0.00 |      9.98 
-----------+----------------------+----------
     Total |   100,574          1 |   100,575 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
  RA, SLE, |     indicator for
 Psoriasis |  outcome: ONS covid
(autoimmun |         death
e disease) |         0          1 |     Total
-----------+----------------------+----------
         0 |    99,923          1 |    99,924 
           |     99.35     100.00 |     99.35 
-----------+----------------------+----------
         1 |       651          0 |       651 
           |      0.65       0.00 |      0.65 
-----------+----------------------+----------
     Total |   100,574          1 |   100,575 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |   Failure/censoring
    ressed |     indicator for
(combinati |  outcome: ONS covid
        on |         death
algorithm) |         0          1 |     Total
-----------+----------------------+----------
         0 |   100,550          1 |   100,551 
           |     99.98     100.00 |     99.98 
-----------+----------------------+----------
         1 |        24          0 |        24 
           |      0.02       0.00 |      0.02 
-----------+----------------------+----------
     Total |   100,574          1 |   100,575 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                 |   Failure/censoring
        Index of |     indicator for
        Multiple |  outcome: ONS covid
     Deprivation |         death
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived |    20,713          0 |    20,713 
                 |     20.59       0.00 |     20.59 
-----------------+----------------------+----------
               2 |    26,874          0 |    26,874 
                 |     26.72       0.00 |     26.72 
-----------------+----------------------+----------
               3 |    13,582          0 |    13,582 
                 |     13.50       0.00 |     13.50 
-----------------+----------------------+----------
               4 |    19,361          1 |    19,362 
                 |     19.25     100.00 |     19.25 
-----------------+----------------------+----------
 5 most deprived |    18,657          0 |    18,657 
                 |     18.55       0.00 |     18.55 
-----------------+----------------------+----------
         Unknown |     1,387          0 |     1,387 
                 |      1.38       0.00 |      1.38 
-----------------+----------------------+----------
           Total |   100,574          1 |   100,575 
                 |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |  outcome: ONS covid
                      |         death
            Ethnicity |         0          1 |     Total
----------------------+----------------------+----------
                White |    10,272          0 |    10,272 
                      |     10.21       0.00 |     10.21 
----------------------+----------------------+----------
                Mixed |       165          0 |       165 
                      |      0.16       0.00 |      0.16 
----------------------+----------------------+----------
Asian or Asian Britis |       100          0 |       100 
                      |      0.10       0.00 |      0.10 
----------------------+----------------------+----------
                Black |        24          0 |        24 
                      |      0.02       0.00 |      0.02 
----------------------+----------------------+----------
                Other |    10,024          0 |    10,024 
                      |      9.97       0.00 |      9.97 
----------------------+----------------------+----------
              Unknown |    79,989          1 |    79,990 
                      |     79.53     100.00 |     79.53 
----------------------+----------------------+----------
                Total |   100,574          1 |   100,575 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      | Failure/ce
                      |  nsoring
                      | indicator
                      |    for
                      |  outcome:
                      | ONS covid
                      |   death
  Geographical region |         0 |     Total
----------------------+-----------+----------
                 East |        61 |        61 
                      |      0.08 |      0.08 
----------------------+-----------+----------
               London |         7 |         7 
                      |      0.01 |      0.01 
----------------------+-----------+----------
           North East |       569 |       569 
                      |      0.76 |      0.76 
----------------------+-----------+----------
           North West |        30 |        30 
                      |      0.04 |      0.04 
----------------------+-----------+----------
           South East |         1 |         1 
                      |      0.00 |      0.00 
----------------------+-----------+----------
           South West |         1 |         1 
                      |      0.00 |      0.00 
----------------------+-----------+----------
        West Midlands |       386 |       386 
                      |      0.51 |      0.51 
----------------------+-----------+----------
Yorkshire and The H.. |    73,986 |    73,986 
                      |     98.59 |     98.59 
----------------------+-----------+----------
                Total |    75,041 |    75,041 
                      |    100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: CPNS covid
   Grouped |         death
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<40 |    27,740          2 |    27,742 
           |     27.58      50.00 |     27.58 
-----------+----------------------+----------
    40-<50 |    12,100          1 |    12,101 
           |     12.03      25.00 |     12.03 
-----------+----------------------+----------
    50-<60 |    22,145          1 |    22,146 
           |     22.02      25.00 |     22.02 
-----------+----------------------+----------
    60-<70 |     9,455          0 |     9,455 
           |      9.40       0.00 |      9.40 
-----------+----------------------+----------
    70-<80 |     8,345          0 |     8,345 
           |      8.30       0.00 |      8.30 
-----------+----------------------+----------
       80+ |    20,786          0 |    20,786 
           |     20.67       0.00 |     20.67 
-----------+----------------------+----------
     Total |   100,571          4 |   100,575 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: CPNS covid
           |         death
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |    55,240          4 |    55,244 
           |     54.93     100.00 |     54.93 
-----------+----------------------+----------
         1 |    45,331          0 |    45,331 
           |     45.07       0.00 |     45.07 
-----------+----------------------+----------
     Total |   100,571          4 |   100,575 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |  outcome: CPNS covid
                     |         death
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |       154          0 |       154 
                     |      0.15       0.00 |      0.15 
---------------------+----------------------+----------
  Normal (18.5-24.9) |     4,288          0 |     4,288 
                     |      4.26       0.00 |      4.26 
---------------------+----------------------+----------
Overweight (25-29.9) |     3,969          0 |     3,969 
                     |      3.95       0.00 |      3.95 
---------------------+----------------------+----------
   Obese I (30-34.9) |     1,497          0 |     1,497 
                     |      1.49       0.00 |      1.49 
---------------------+----------------------+----------
  Obese II (35-39.9) |       401          0 |       401 
                     |      0.40       0.00 |      0.40 
---------------------+----------------------+----------
     Obese III (40+) |        75          0 |        75 
                     |      0.07       0.00 |      0.07 
---------------------+----------------------+----------
        Unknown (.u) |    90,187          4 |    90,191 
                     |     89.67     100.00 |     89.68 
---------------------+----------------------+----------
               Total |   100,571          4 |   100,575 
                     |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   Failure/censoring
             |     indicator for
             |  outcome: CPNS covid
     Smoking |         death
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |     5,863          0 |     5,863 
             |      5.83       0.00 |      5.83 
-------------+----------------------+----------
      Former |    12,807          0 |    12,807 
             |     12.73       0.00 |     12.73 
-------------+----------------------+----------
     Current |    27,170          0 |    27,170 
             |     27.02       0.00 |     27.01 
-------------+----------------------+----------
Unknown (.u) |    54,731          4 |    54,735 
             |     54.42     100.00 |     54.42 
-------------+----------------------+----------
       Total |   100,571          4 |   100,575 
             |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |  outcome: CPNS covid
 Evidence of obesity |         death
      (4 categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity |    98,598          4 |    98,602 
                     |     98.04     100.00 |     98.04 
---------------------+----------------------+----------
   Obese I (30-34.9) |     1,497          0 |     1,497 
                     |      1.49       0.00 |      1.49 
---------------------+----------------------+----------
  Obese II (35-39.9) |       401          0 |       401 
                     |      0.40       0.00 |      0.40 
---------------------+----------------------+----------
     Obese III (40+) |        75          0 |        75 
                     |      0.07       0.00 |      0.07 
---------------------+----------------------+----------
               Total |   100,571          4 |   100,575 
                     |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
Respirator |     indicator for
 y disease |  outcome: CPNS covid
    (excl. |         death
   asthma) |         0          1 |     Total
-----------+----------------------+----------
         0 |    99,928          4 |    99,932 
           |     99.36     100.00 |     99.36 
-----------+----------------------+----------
         1 |       643          0 |       643 
           |      0.64       0.00 |      0.64 
-----------+----------------------+----------
     Total |   100,571          4 |   100,575 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: CPNS covid
           |         death
    Asthma |         0          1 |     Total
-----------+----------------------+----------
         0 |    87,501          4 |    87,505 
           |     87.00     100.00 |     87.00 
-----------+----------------------+----------
         1 |    13,070          0 |    13,070 
           |     13.00       0.00 |     13.00 
-----------+----------------------+----------
     Total |   100,571          4 |   100,575 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   Failure/censoring
     Asthma, |     indicator for
  grouped by |  outcome: CPNS covid
    severity |         death
   (OCS use) |         0          1 |     Total
-------------+----------------------+----------
          No |    87,501          4 |    87,505 
             |     87.00     100.00 |     87.00 
-------------+----------------------+----------
 Yes, no OCS |    13,070          0 |    13,070 
             |     13.00       0.00 |     13.00 
-------------+----------------------+----------
       Total |   100,571          4 |   100,575 
             |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: CPNS covid
     Heart |         death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    78,300          4 |    78,304 
           |     77.86     100.00 |     77.86 
-----------+----------------------+----------
         1 |    22,271          0 |    22,271 
           |     22.14       0.00 |     22.14 
-----------+----------------------+----------
     Total |   100,571          4 |   100,575 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: CPNS covid
           |         death
  Diabetes |         0          1 |     Total
-----------+----------------------+----------
         0 |    72,692          4 |    72,696 
           |     72.28     100.00 |     72.28 
-----------+----------------------+----------
         1 |    27,879          0 |    27,879 
           |     27.72       0.00 |     27.72 
-----------+----------------------+----------
     Total |   100,571          4 |   100,575 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |  outcome: CPNS covid
                      |         death
    Diabetes, grouped |         0          1 |     Total
----------------------+----------------------+----------
          No diabetes |    72,692          4 |    72,696 
                      |     72.28     100.00 |     72.28 
----------------------+----------------------+----------
Diabetes, no hba1c me |    27,879          0 |    27,879 
                      |     27.72       0.00 |     27.72 
----------------------+----------------------+----------
                Total |   100,571          4 |   100,575 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

 Cancer (exc. |   Failure/censoring
haematologica |     indicator for
  l), grouped |  outcome: CPNS covid
by time since |         death
    diagnosis |         0          1 |     Total
--------------+----------------------+----------
        Never |   100,031          4 |   100,035 
              |     99.46     100.00 |     99.46 
--------------+----------------------+----------
    Last year |         4          0 |         4 
              |      0.00       0.00 |      0.00 
--------------+----------------------+----------
2-5 years ago |         3          0 |         3 
              |      0.00       0.00 |      0.00 
--------------+----------------------+----------
     5+ years |       533          0 |       533 
              |      0.53       0.00 |      0.53 
--------------+----------------------+----------
        Total |   100,571          4 |   100,575 
              |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Haematologica |   Failure/censoring
l malignancy, |     indicator for
   grouped by |  outcome: CPNS covid
   time since |         death
    diagnosis |         0          1 |     Total
--------------+----------------------+----------
        Never |    90,473          4 |    90,477 
              |     89.96     100.00 |     89.96 
--------------+----------------------+----------
    Last year |         2          0 |         2 
              |      0.00       0.00 |      0.00 
--------------+----------------------+----------
2-5 years ago |         3          0 |         3 
              |      0.00       0.00 |      0.00 
--------------+----------------------+----------
     5+ years |    10,093          0 |    10,093 
              |     10.04       0.00 |     10.04 
--------------+----------------------+----------
        Total |   100,571          4 |   100,575 
              |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: CPNS covid
     liver |         death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    90,510          4 |    90,514 
           |     90.00     100.00 |     90.00 
-----------+----------------------+----------
         1 |    10,061          0 |    10,061 
           |     10.00       0.00 |     10.00 
-----------+----------------------+----------
     Total |   100,571          4 |   100,575 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: CPNS covid
           |         death
    stroke |         0          1 |     Total
-----------+----------------------+----------
         0 |    90,150          4 |    90,154 
           |     89.64     100.00 |     89.64 
-----------+----------------------+----------
         1 |    10,421          0 |    10,421 
           |     10.36       0.00 |     10.36 
-----------+----------------------+----------
     Total |   100,571          4 |   100,575 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: CPNS covid
           |         death
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |   100,564          4 |   100,568 
           |     99.99     100.00 |     99.99 
-----------+----------------------+----------
         1 |         7          0 |         7 
           |      0.01       0.00 |      0.01 
-----------+----------------------+----------
     Total |   100,571          4 |   100,575 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: CPNS covid
 Stroke or |         death
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |    90,144          4 |    90,148 
           |     89.63     100.00 |     89.63 
-----------+----------------------+----------
         1 |    10,427          0 |    10,427 
           |     10.37       0.00 |     10.37 
-----------+----------------------+----------
     Total |   100,571          4 |   100,575 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

     Neuro |   Failure/censoring
 condition |     indicator for
other than |  outcome: CPNS covid
stroke/dem |         death
     entia |         0          1 |     Total
-----------+----------------------+----------
         0 |   100,291          4 |   100,295 
           |     99.72     100.00 |     99.72 
-----------+----------------------+----------
         1 |       280          0 |       280 
           |      0.28       0.00 |      0.28 
-----------+----------------------+----------
     Total |   100,571          4 |   100,575 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: CPNS covid
    Kidney |         death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    99,806          4 |    99,810 
           |     99.24     100.00 |     99.24 
-----------+----------------------+----------
         1 |       765          0 |       765 
           |      0.76       0.00 |      0.76 
-----------+----------------------+----------
     Total |   100,571          4 |   100,575 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
     Organ |  outcome: CPNS covid
transplant |         death
 recipient |         0          1 |     Total
-----------+----------------------+----------
         0 |   100,552          4 |   100,556 
           |     99.98     100.00 |     99.98 
-----------+----------------------+----------
         1 |        19          0 |        19 
           |      0.02       0.00 |      0.02 
-----------+----------------------+----------
     Total |   100,571          4 |   100,575 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

    Spleen |   Failure/censoring
  problems |     indicator for
(dysplenia |  outcome: CPNS covid
  , sickle |         death
     cell) |         0          1 |     Total
-----------+----------------------+----------
         0 |    90,531          4 |    90,535 
           |     90.02     100.00 |     90.02 
-----------+----------------------+----------
         1 |    10,040          0 |    10,040 
           |      9.98       0.00 |      9.98 
-----------+----------------------+----------
     Total |   100,571          4 |   100,575 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
  RA, SLE, |     indicator for
 Psoriasis |  outcome: CPNS covid
(autoimmun |         death
e disease) |         0          1 |     Total
-----------+----------------------+----------
         0 |    99,920          4 |    99,924 
           |     99.35     100.00 |     99.35 
-----------+----------------------+----------
         1 |       651          0 |       651 
           |      0.65       0.00 |      0.65 
-----------+----------------------+----------
     Total |   100,571          4 |   100,575 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |   Failure/censoring
    ressed |     indicator for
(combinati |  outcome: CPNS covid
        on |         death
algorithm) |         0          1 |     Total
-----------+----------------------+----------
         0 |   100,547          4 |   100,551 
           |     99.98     100.00 |     99.98 
-----------+----------------------+----------
         1 |        24          0 |        24 
           |      0.02       0.00 |      0.02 
-----------+----------------------+----------
     Total |   100,571          4 |   100,575 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                 |   Failure/censoring
        Index of |     indicator for
        Multiple |  outcome: CPNS covid
     Deprivation |         death
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived |    20,713          0 |    20,713 
                 |     20.60       0.00 |     20.59 
-----------------+----------------------+----------
               2 |    26,874          0 |    26,874 
                 |     26.72       0.00 |     26.72 
-----------------+----------------------+----------
               3 |    13,581          1 |    13,582 
                 |     13.50      25.00 |     13.50 
-----------------+----------------------+----------
               4 |    19,359          3 |    19,362 
                 |     19.25      75.00 |     19.25 
-----------------+----------------------+----------
 5 most deprived |    18,657          0 |    18,657 
                 |     18.55       0.00 |     18.55 
-----------------+----------------------+----------
         Unknown |     1,387          0 |     1,387 
                 |      1.38       0.00 |      1.38 
-----------------+----------------------+----------
           Total |   100,571          4 |   100,575 
                 |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |  outcome: CPNS covid
                      |         death
            Ethnicity |         0          1 |     Total
----------------------+----------------------+----------
                White |    10,272          0 |    10,272 
                      |     10.21       0.00 |     10.21 
----------------------+----------------------+----------
                Mixed |       165          0 |       165 
                      |      0.16       0.00 |      0.16 
----------------------+----------------------+----------
Asian or Asian Britis |       100          0 |       100 
                      |      0.10       0.00 |      0.10 
----------------------+----------------------+----------
                Black |        24          0 |        24 
                      |      0.02       0.00 |      0.02 
----------------------+----------------------+----------
                Other |    10,024          0 |    10,024 
                      |      9.97       0.00 |      9.97 
----------------------+----------------------+----------
              Unknown |    79,986          4 |    79,990 
                      |     79.53     100.00 |     79.53 
----------------------+----------------------+----------
                Total |   100,571          4 |   100,575 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      | Failure/ce
                      |  nsoring
                      | indicator
                      |    for
                      |  outcome:
                      | CPNS covid
                      |   death
  Geographical region |         0 |     Total
----------------------+-----------+----------
                 East |        61 |        61 
                      |      0.08 |      0.08 
----------------------+-----------+----------
               London |         7 |         7 
                      |      0.01 |      0.01 
----------------------+-----------+----------
           North East |       569 |       569 
                      |      0.76 |      0.76 
----------------------+-----------+----------
           North West |        30 |        30 
                      |      0.04 |      0.04 
----------------------+-----------+----------
           South East |         1 |         1 
                      |      0.00 |      0.00 
----------------------+-----------+----------
           South West |         1 |         1 
                      |      0.00 |      0.00 
----------------------+-----------+----------
        West Midlands |       386 |       386 
                      |      0.51 |      0.51 
----------------------+-----------+----------
Yorkshire and The H.. |    73,986 |    73,986 
                      |     98.59 |     98.59 
----------------------+-----------+----------
                Total |    75,041 |    75,041 
                      |    100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |     outcome: ITU
   Grouped |       admission
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<40 |    27,739          3 |    27,742 
           |     27.58      60.00 |     27.58 
-----------+----------------------+----------
    40-<50 |    12,100          1 |    12,101 
           |     12.03      20.00 |     12.03 
-----------+----------------------+----------
    50-<60 |    22,146          0 |    22,146 
           |     22.02       0.00 |     22.02 
-----------+----------------------+----------
    60-<70 |     9,455          0 |     9,455 
           |      9.40       0.00 |      9.40 
-----------+----------------------+----------
    70-<80 |     8,345          0 |     8,345 
           |      8.30       0.00 |      8.30 
-----------+----------------------+----------
       80+ |    20,785          1 |    20,786 
           |     20.67      20.00 |     20.67 
-----------+----------------------+----------
     Total |   100,570          5 |   100,575 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |     outcome: ITU
           |       admission
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |    55,243          1 |    55,244 
           |     54.93      20.00 |     54.93 
-----------+----------------------+----------
         1 |    45,327          4 |    45,331 
           |     45.07      80.00 |     45.07 
-----------+----------------------+----------
     Total |   100,570          5 |   100,575 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |     outcome: ITU
                     |       admission
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |       154          0 |       154 
                     |      0.15       0.00 |      0.15 
---------------------+----------------------+----------
  Normal (18.5-24.9) |     4,288          0 |     4,288 
                     |      4.26       0.00 |      4.26 
---------------------+----------------------+----------
Overweight (25-29.9) |     3,968          1 |     3,969 
                     |      3.95      20.00 |      3.95 
---------------------+----------------------+----------
   Obese I (30-34.9) |     1,497          0 |     1,497 
                     |      1.49       0.00 |      1.49 
---------------------+----------------------+----------
  Obese II (35-39.9) |       401          0 |       401 
                     |      0.40       0.00 |      0.40 
---------------------+----------------------+----------
     Obese III (40+) |        75          0 |        75 
                     |      0.07       0.00 |      0.07 
---------------------+----------------------+----------
        Unknown (.u) |    90,187          4 |    90,191 
                     |     89.68      80.00 |     89.68 
---------------------+----------------------+----------
               Total |   100,570          5 |   100,575 
                     |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   Failure/censoring
             |     indicator for
             |     outcome: ITU
     Smoking |       admission
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |     5,863          0 |     5,863 
             |      5.83       0.00 |      5.83 
-------------+----------------------+----------
      Former |    12,807          0 |    12,807 
             |     12.73       0.00 |     12.73 
-------------+----------------------+----------
     Current |    27,169          1 |    27,170 
             |     27.02      20.00 |     27.01 
-------------+----------------------+----------
Unknown (.u) |    54,731          4 |    54,735 
             |     54.42      80.00 |     54.42 
-------------+----------------------+----------
       Total |   100,570          5 |   100,575 
             |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |     outcome: ITU
 Evidence of obesity |       admission
      (4 categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity |    98,597          5 |    98,602 
                     |     98.04     100.00 |     98.04 
---------------------+----------------------+----------
   Obese I (30-34.9) |     1,497          0 |     1,497 
                     |      1.49       0.00 |      1.49 
---------------------+----------------------+----------
  Obese II (35-39.9) |       401          0 |       401 
                     |      0.40       0.00 |      0.40 
---------------------+----------------------+----------
     Obese III (40+) |        75          0 |        75 
                     |      0.07       0.00 |      0.07 
---------------------+----------------------+----------
               Total |   100,570          5 |   100,575 
                     |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
Respirator |     indicator for
 y disease |     outcome: ITU
    (excl. |       admission
   asthma) |         0          1 |     Total
-----------+----------------------+----------
         0 |    99,927          5 |    99,932 
           |     99.36     100.00 |     99.36 
-----------+----------------------+----------
         1 |       643          0 |       643 
           |      0.64       0.00 |      0.64 
-----------+----------------------+----------
     Total |   100,570          5 |   100,575 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |     outcome: ITU
           |       admission
    Asthma |         0          1 |     Total
-----------+----------------------+----------
         0 |    87,501          4 |    87,505 
           |     87.01      80.00 |     87.00 
-----------+----------------------+----------
         1 |    13,069          1 |    13,070 
           |     12.99      20.00 |     13.00 
-----------+----------------------+----------
     Total |   100,570          5 |   100,575 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   Failure/censoring
     Asthma, |     indicator for
  grouped by |     outcome: ITU
    severity |       admission
   (OCS use) |         0          1 |     Total
-------------+----------------------+----------
          No |    87,501          4 |    87,505 
             |     87.01      80.00 |     87.00 
-------------+----------------------+----------
 Yes, no OCS |    13,069          1 |    13,070 
             |     12.99      20.00 |     13.00 
-------------+----------------------+----------
       Total |   100,570          5 |   100,575 
             |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |     outcome: ITU
     Heart |       admission
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    78,301          3 |    78,304 
           |     77.86      60.00 |     77.86 
-----------+----------------------+----------
         1 |    22,269          2 |    22,271 
           |     22.14      40.00 |     22.14 
-----------+----------------------+----------
     Total |   100,570          5 |   100,575 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |     outcome: ITU
           |       admission
  Diabetes |         0          1 |     Total
-----------+----------------------+----------
         0 |    72,692          4 |    72,696 
           |     72.28      80.00 |     72.28 
-----------+----------------------+----------
         1 |    27,878          1 |    27,879 
           |     27.72      20.00 |     27.72 
-----------+----------------------+----------
     Total |   100,570          5 |   100,575 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |     outcome: ITU
                      |       admission
    Diabetes, grouped |         0          1 |     Total
----------------------+----------------------+----------
          No diabetes |    72,692          4 |    72,696 
                      |     72.28      80.00 |     72.28 
----------------------+----------------------+----------
Diabetes, no hba1c me |    27,878          1 |    27,879 
                      |     27.72      20.00 |     27.72 
----------------------+----------------------+----------
                Total |   100,570          5 |   100,575 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

 Cancer (exc. |   Failure/censoring
haematologica |     indicator for
  l), grouped |     outcome: ITU
by time since |       admission
    diagnosis |         0          1 |     Total
--------------+----------------------+----------
        Never |   100,030          5 |   100,035 
              |     99.46     100.00 |     99.46 
--------------+----------------------+----------
    Last year |         4          0 |         4 
              |      0.00       0.00 |      0.00 
--------------+----------------------+----------
2-5 years ago |         3          0 |         3 
              |      0.00       0.00 |      0.00 
--------------+----------------------+----------
     5+ years |       533          0 |       533 
              |      0.53       0.00 |      0.53 
--------------+----------------------+----------
        Total |   100,570          5 |   100,575 
              |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Haematologica |   Failure/censoring
l malignancy, |     indicator for
   grouped by |     outcome: ITU
   time since |       admission
    diagnosis |         0          1 |     Total
--------------+----------------------+----------
        Never |    90,472          5 |    90,477 
              |     89.96     100.00 |     89.96 
--------------+----------------------+----------
    Last year |         2          0 |         2 
              |      0.00       0.00 |      0.00 
--------------+----------------------+----------
2-5 years ago |         3          0 |         3 
              |      0.00       0.00 |      0.00 
--------------+----------------------+----------
     5+ years |    10,093          0 |    10,093 
              |     10.04       0.00 |     10.04 
--------------+----------------------+----------
        Total |   100,570          5 |   100,575 
              |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |     outcome: ITU
     liver |       admission
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    90,509          5 |    90,514 
           |     90.00     100.00 |     90.00 
-----------+----------------------+----------
         1 |    10,061          0 |    10,061 
           |     10.00       0.00 |     10.00 
-----------+----------------------+----------
     Total |   100,570          5 |   100,575 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |     outcome: ITU
           |       admission
    stroke |         0          1 |     Total
-----------+----------------------+----------
         0 |    90,149          5 |    90,154 
           |     89.64     100.00 |     89.64 
-----------+----------------------+----------
         1 |    10,421          0 |    10,421 
           |     10.36       0.00 |     10.36 
-----------+----------------------+----------
     Total |   100,570          5 |   100,575 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |     outcome: ITU
           |       admission
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |   100,563          5 |   100,568 
           |     99.99     100.00 |     99.99 
-----------+----------------------+----------
         1 |         7          0 |         7 
           |      0.01       0.00 |      0.01 
-----------+----------------------+----------
     Total |   100,570          5 |   100,575 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |     outcome: ITU
 Stroke or |       admission
  dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |    90,143          5 |    90,148 
           |     89.63     100.00 |     89.63 
-----------+----------------------+----------
         1 |    10,427          0 |    10,427 
           |     10.37       0.00 |     10.37 
-----------+----------------------+----------
     Total |   100,570          5 |   100,575 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

     Neuro |   Failure/censoring
 condition |     indicator for
other than |     outcome: ITU
stroke/dem |       admission
     entia |         0          1 |     Total
-----------+----------------------+----------
         0 |   100,290          5 |   100,295 
           |     99.72     100.00 |     99.72 
-----------+----------------------+----------
         1 |       280          0 |       280 
           |      0.28       0.00 |      0.28 
-----------+----------------------+----------
     Total |   100,570          5 |   100,575 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |     outcome: ITU
    Kidney |       admission
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    99,805          5 |    99,810 
           |     99.24     100.00 |     99.24 
-----------+----------------------+----------
         1 |       765          0 |       765 
           |      0.76       0.00 |      0.76 
-----------+----------------------+----------
     Total |   100,570          5 |   100,575 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
     Organ |     outcome: ITU
transplant |       admission
 recipient |         0          1 |     Total
-----------+----------------------+----------
         0 |   100,551          5 |   100,556 
           |     99.98     100.00 |     99.98 
-----------+----------------------+----------
         1 |        19          0 |        19 
           |      0.02       0.00 |      0.02 
-----------+----------------------+----------
     Total |   100,570          5 |   100,575 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

    Spleen |   Failure/censoring
  problems |     indicator for
(dysplenia |     outcome: ITU
  , sickle |       admission
     cell) |         0          1 |     Total
-----------+----------------------+----------
         0 |    90,530          5 |    90,535 
           |     90.02     100.00 |     90.02 
-----------+----------------------+----------
         1 |    10,040          0 |    10,040 
           |      9.98       0.00 |      9.98 
-----------+----------------------+----------
     Total |   100,570          5 |   100,575 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
  RA, SLE, |     indicator for
 Psoriasis |     outcome: ITU
(autoimmun |       admission
e disease) |         0          1 |     Total
-----------+----------------------+----------
         0 |    99,919          5 |    99,924 
           |     99.35     100.00 |     99.35 
-----------+----------------------+----------
         1 |       651          0 |       651 
           |      0.65       0.00 |      0.65 
-----------+----------------------+----------
     Total |   100,570          5 |   100,575 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Immunosupp |   Failure/censoring
    ressed |     indicator for
(combinati |     outcome: ITU
        on |       admission
algorithm) |         0          1 |     Total
-----------+----------------------+----------
         0 |   100,546          5 |   100,551 
           |     99.98     100.00 |     99.98 
-----------+----------------------+----------
         1 |        24          0 |        24 
           |      0.02       0.00 |      0.02 
-----------+----------------------+----------
     Total |   100,570          5 |   100,575 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                 |   Failure/censoring
        Index of |     indicator for
        Multiple |     outcome: ITU
     Deprivation |       admission
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived |    20,711          2 |    20,713 
                 |     20.59      40.00 |     20.59 
-----------------+----------------------+----------
               2 |    26,871          3 |    26,874 
                 |     26.72      60.00 |     26.72 
-----------------+----------------------+----------
               3 |    13,582          0 |    13,582 
                 |     13.51       0.00 |     13.50 
-----------------+----------------------+----------
               4 |    19,362          0 |    19,362 
                 |     19.25       0.00 |     19.25 
-----------------+----------------------+----------
 5 most deprived |    18,657          0 |    18,657 
                 |     18.55       0.00 |     18.55 
-----------------+----------------------+----------
         Unknown |     1,387          0 |     1,387 
                 |      1.38       0.00 |      1.38 
-----------------+----------------------+----------
           Total |   100,570          5 |   100,575 
                 |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |     outcome: ITU
                      |       admission
            Ethnicity |         0          1 |     Total
----------------------+----------------------+----------
                White |    10,272          0 |    10,272 
                      |     10.21       0.00 |     10.21 
----------------------+----------------------+----------
                Mixed |       165          0 |       165 
                      |      0.16       0.00 |      0.16 
----------------------+----------------------+----------
Asian or Asian Britis |       100          0 |       100 
                      |      0.10       0.00 |      0.10 
----------------------+----------------------+----------
                Black |        24          0 |        24 
                      |      0.02       0.00 |      0.02 
----------------------+----------------------+----------
                Other |    10,024          0 |    10,024 
                      |      9.97       0.00 |      9.97 
----------------------+----------------------+----------
              Unknown |    79,985          5 |    79,990 
                      |     79.53     100.00 |     79.53 
----------------------+----------------------+----------
                Total |   100,570          5 |   100,575 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   Failure/censoring
                      |     indicator for
                      |     outcome: ITU
                      |       admission
  Geographical region |         0          1 |     Total
----------------------+----------------------+----------
                 East |        61          0 |        61 
                      |      0.08       0.00 |      0.08 
----------------------+----------------------+----------
               London |         7          0 |         7 
                      |      0.01       0.00 |      0.01 
----------------------+----------------------+----------
           North East |       569          0 |       569 
                      |      0.76       0.00 |      0.76 
----------------------+----------------------+----------
           North West |        30          0 |        30 
                      |      0.04       0.00 |      0.04 
----------------------+----------------------+----------
           South East |         1          0 |         1 
                      |      0.00       0.00 |      0.00 
----------------------+----------------------+----------
           South West |         1          0 |         1 
                      |      0.00       0.00 |      0.00 
----------------------+----------------------+----------
        West Midlands |       386          0 |       386 
                      |      0.51       0.00 |      0.51 
----------------------+----------------------+----------
Yorkshire and The H.. |    73,981          5 |    73,986 
                      |     98.59     100.00 |     98.59 
----------------------+----------------------+----------
                Total |    75,036          5 |    75,041 
                      |    100.00     100.00 |    100.00 

. 
. 
. 
. * Close the log file
. log close
      name:  <unnamed>
       log:  C:\Github\opencorona-risk-factors-research\analysis\output/an_descriptive_tables.log
  log type:  text
 closed on:  29 Apr 2020, 22:18:43
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
