----------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Github\opencorona-risk-factors-research\analysis\output/an_descriptive_tables.log
  log type:  text
 opened on:  18 Apr 2020, 18:20:04

. 
. use egdata, clear
(Poor factors dummy analysis dataset)

. 
. **********************************
. *  Distribution in whole cohort  *
. **********************************
. 
. 
. * Demographics
. summ age

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |    141,510    54.14491    21.16692         18        105

. tab agegroup

Grouped age |      Freq.     Percent        Cum.
------------+-----------------------------------
     18-<40 |     35,665       25.20       25.20
     40-<50 |     27,420       19.38       44.58
     50-<60 |     29,777       21.04       65.62
     60-<70 |     14,464       10.22       75.84
     70-<80 |     11,763        8.31       84.16
        80+ |     22,421       15.84      100.00
------------+-----------------------------------
      Total |    141,510      100.00

. tab male

       Male |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     77,697       54.91       54.91
          1 |     63,813       45.09      100.00
------------+-----------------------------------
      Total |    141,510      100.00

. tab bmicat

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |      8,989        8.49        8.49
  Normal (18.5-24.9) |     21,051       19.88       28.37
Overweight (25-29.9) |     18,494       17.47       45.83
   Obese I (30-34.9) |     18,219       17.21       63.04
  Obese II (35-39.9) |     16,534       15.61       78.65
     Obese III (40+) |     22,603       21.35      100.00
---------------------+-----------------------------------
               Total |    105,890      100.00

. tab bmicat, m

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |      8,989        6.35        6.35
  Normal (18.5-24.9) |     21,051       14.88       21.23
Overweight (25-29.9) |     18,494       13.07       34.30
   Obese I (30-34.9) |     18,219       12.87       47.17
  Obese II (35-39.9) |     16,534       11.68       58.86
     Obese III (40+) |     22,603       15.97       74.83
        Unknown (.u) |     35,620       25.17      100.00
---------------------+-----------------------------------
               Total |    141,510      100.00

. tab smoke

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |     42,683       33.93       33.93
      Former |     59,412       47.23       81.17
     Current |     23,687       18.83      100.00
-------------+-----------------------------------
       Total |    125,782      100.00

. tab smoke, m

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |     42,683       30.16       30.16
      Former |     59,412       41.98       72.15
     Current |     23,687       16.74       88.89
Unknown (.u) |     15,728       11.11      100.00
-------------+-----------------------------------
       Total |    141,510      100.00

. 
. * Comorbidities
. tab chronic_respiratory_disease

Respiratory |
    disease |
     (excl. |
    asthma) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    140,591       99.35       99.35
          1 |        919        0.65      100.00
------------+-----------------------------------
      Total |    141,510      100.00

. tab asthma

     Asthma |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    141,404       99.93       99.93
          1 |        106        0.07      100.00
------------+-----------------------------------
      Total |    141,510      100.00

. tab chronic_cardiac_disease

      Heart |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    118,631       83.83       83.83
          1 |     22,879       16.17      100.00
------------+-----------------------------------
      Total |    141,510      100.00

. tab diabetes

   Diabetes |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     99,481       70.30       70.30
          1 |     42,029       29.70      100.00
------------+-----------------------------------
      Total |    141,510      100.00

. tab lung_cancer

Lung cancer |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    141,476       99.98       99.98
          1 |         34        0.02      100.00
------------+-----------------------------------
      Total |    141,510      100.00

. tab haem_cancer

      Haem. |
     cancer |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    131,356       92.82       92.82
          1 |     10,154        7.18      100.00
------------+-----------------------------------
      Total |    141,510      100.00

. tab other_cancer

 Any cancer |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    140,753       99.47       99.47
          1 |        757        0.53      100.00
------------+-----------------------------------
      Total |    141,510      100.00

. tab cancer

     Cancer |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    130,579       92.28       92.28
          1 |     10,931        7.72      100.00
------------+-----------------------------------
      Total |    141,510      100.00

. tab chronic_liver_disease

      Liver |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    131,437       92.88       92.88
          1 |     10,073        7.12      100.00
------------+-----------------------------------
      Total |    141,510      100.00

. tab neurological_condition

Neurologica |
  l disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    140,591       99.35       99.35
          1 |        919        0.65      100.00
------------+-----------------------------------
      Total |    141,510      100.00

. tab chronic_kidney_disease

     Kidney |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    141,510      100.00      100.00
------------+-----------------------------------
      Total |    141,510      100.00

. tab organ_transplant

      Organ |
 transplant |
  recipient |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    141,489       99.99       99.99
          1 |         21        0.01      100.00
------------+-----------------------------------
      Total |    141,510      100.00

. tab dysplenia

  Dysplenia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    131,464       92.90       92.90
          1 |     10,046        7.10      100.00
------------+-----------------------------------
      Total |    141,510      100.00

. tab sickle_cell

Sickle cell |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    141,509      100.00      100.00
          1 |          1        0.00      100.00
------------+-----------------------------------
      Total |    141,510      100.00

. tab spleen

     Spleen |
   problems |
(dysplenia, |
     sickle |
      cell) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    131,463       92.90       92.90
          1 |     10,047        7.10      100.00
------------+-----------------------------------
      Total |    141,510      100.00

. tab ra_sle_psoriasis

   RA, SLE, |
  Psoriasis |
(autoimmune |
   disease) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    140,634       99.38       99.38
          1 |        876        0.62      100.00
------------+-----------------------------------
      Total |    141,510      100.00

. tab immunosuppressed

Immunosuppr |
      essed |
(combinatio |
          n |
 algorithm) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    130,545       92.25       92.25
          1 |     10,965        7.75      100.00
------------+-----------------------------------
      Total |    141,510      100.00

. 
. tab bpcat

 Grouped blood |
      pressure |      Freq.     Percent        Cum.
---------------+-----------------------------------
        Normal |     52,590       37.16       37.16
      Elevated |     11,481        8.11       45.28
 High, stage I |     39,464       27.89       73.16
High, stage II |     37,975       26.84      100.00
---------------+-----------------------------------
         Total |    141,510      100.00

. 
. summ bp_sys,  detail

                   Systolic blood pressure
-------------------------------------------------------------
      Percentiles      Smallest
 1%     75.25041       47.21651
 5%     85.36712       47.31984
10%     90.80013       49.14478       Obs             141,510
25%     99.90793         52.278       Sum of Wgt.     141,510

50%      110.077                      Mean           110.0484
                        Largest       Std. Dev.      15.00071
75%     120.2156       169.2426
90%     129.3091       169.6917       Variance       225.0214
95%     134.6863       169.6974       Skewness      -.0048248
99%     144.8793       175.9461       Kurtosis       2.968958

. summ bp_dias, detail

                  Diastolic blood pressure
-------------------------------------------------------------
      Percentiles      Smallest
 1%     44.99889       14.61039
 5%     55.29982       15.76301
10%     60.79022       16.01794       Obs             141,510
25%     69.82079       19.57638       Sum of Wgt.     141,510

50%      80.0164                      Mean           79.96835
                        Largest       Std. Dev.      15.01346
75%     90.05379       142.9181
90%     99.19635       143.8417       Variance       225.4041
95%     104.7278       146.3899       Skewness        .003336
99%     114.7474       147.2473       Kurtosis       3.009456

. 
. * Adjustment variables 
. tab imd 

   Index of |
   Multiple |
Deprivation |
      (IMD) |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     22,624       16.43       16.43
          2 |     29,406       21.36       37.79
          3 |     28,910       21.00       58.79
          4 |     28,122       20.43       79.21
          5 |     28,621       20.79      100.00
------------+-----------------------------------
      Total |    137,683      100.00

. *tab ethnicity
. tab ethnicity, m

   Ethnicity |      Freq.     Percent        Cum.
-------------+-----------------------------------
       White |     42,146       29.78       29.78
       Black |     19,839       14.02       43.80
       Asian |      7,966        5.63       49.43
       Mixed |      7,103        5.02       54.45
       Other |      6,479        4.58       59.03
Unknown (.u) |     57,977       40.97      100.00
-------------+-----------------------------------
       Total |    141,510      100.00

. *tab urban
. 
. 
. * Outcomes
. tab died

 Death from |
   Covid-19 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    127,443       90.06       90.06
          1 |     14,067        9.94      100.00
------------+-----------------------------------
      Total |    141,510      100.00

. tab itu

Admitted to |
    ITU for |
   Covid-19 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    134,529       95.07       95.07
          1 |      6,981        4.93      100.00
------------+-----------------------------------
      Total |    141,510      100.00

. tab hosp

Hospitalise |
      d for |
   Covid-19 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    113,541       80.24       80.24
          1 |     27,969       19.76      100.00
------------+-----------------------------------
      Total |    141,510      100.00

. * tab compoutcome
. 
. 
. 
. **********************************
. *  Number (%) with each outcome  *
. **********************************
. 
. foreach outvar of varlist died hosp itu {
  2. 
. *** Repeat for each outcome
. 
.         * Demographics
.         tab agegroup                                                    `outvar', row
  3.         tab male                                                                `outvar', row
  4.         tab bmicat                                                              `outvar', row m 
  5.         tab smoke                                                               `outvar', row m
  6. 
.         * Comorbidities
.         tab chronic_respiratory_disease                 `outvar', row
  7.         tab asthma                                                              `outvar', row
  8.         tab chronic_cardiac_disease                     `outvar', row
  9.         tab diabetes                                                    `outvar', row
 10.         tab lung_cancer                                                 `outvar', row
 11.         tab haem_cancer                                                 `outvar', row
 12.         tab other_cancer                                                `outvar', row
 13.         tab cancer                                                              `outvar', row
 14.         tab chronic_liver_disease                               `outvar', row
 15.         tab neurological_condition                              `outvar', row
 16.         tab chronic_kidney_disease                              `outvar', row
 17.         tab organ_transplant                                    `outvar', row
 18.         tab spleen                                                              `outvar', row
 19.         tab immunosuppressed                                    `outvar', row
 20.         tab ra_sle_psoriasis                                    `outvar', row
 21.         
.         * Adjustment variables 
.         tab imd                                                                 `outvar', row
 22.         *tab ethnicity                                                  `outvar', row m
.         *tab urban                                                              `outvar', row
. }

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped |  Death from Covid-19
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<40 |    32,041      3,624 |    35,665 
           |     89.84      10.16 |    100.00 
-----------+----------------------+----------
    40-<50 |    24,801      2,619 |    27,420 
           |     90.45       9.55 |    100.00 
-----------+----------------------+----------
    50-<60 |    26,772      3,005 |    29,777 
           |     89.91      10.09 |    100.00 
-----------+----------------------+----------
    60-<70 |    13,028      1,436 |    14,464 
           |     90.07       9.93 |    100.00 
-----------+----------------------+----------
    70-<80 |    10,581      1,182 |    11,763 
           |     89.95      10.05 |    100.00 
-----------+----------------------+----------
       80+ |    20,220      2,201 |    22,421 
           |     90.18       9.82 |    100.00 
-----------+----------------------+----------
     Total |   127,443     14,067 |   141,510 
           |     90.06       9.94 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Death from Covid-19
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |    70,002      7,695 |    77,697 
           |     90.10       9.90 |    100.00 
-----------+----------------------+----------
         1 |    57,441      6,372 |    63,813 
           |     90.01       9.99 |    100.00 
-----------+----------------------+----------
     Total |   127,443     14,067 |   141,510 
           |     90.06       9.94 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                     |  Death from Covid-19
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |     8,120        869 |     8,989 
                     |     90.33       9.67 |    100.00 
---------------------+----------------------+----------
  Normal (18.5-24.9) |    18,938      2,113 |    21,051 
                     |     89.96      10.04 |    100.00 
---------------------+----------------------+----------
Overweight (25-29.9) |    16,601      1,893 |    18,494 
                     |     89.76      10.24 |    100.00 
---------------------+----------------------+----------
   Obese I (30-34.9) |    16,442      1,777 |    18,219 
                     |     90.25       9.75 |    100.00 
---------------------+----------------------+----------
  Obese II (35-39.9) |    14,855      1,679 |    16,534 
                     |     89.85      10.15 |    100.00 
---------------------+----------------------+----------
     Obese III (40+) |    20,406      2,197 |    22,603 
                     |     90.28       9.72 |    100.00 
---------------------+----------------------+----------
        Unknown (.u) |    32,081      3,539 |    35,620 
                     |     90.06       9.94 |    100.00 
---------------------+----------------------+----------
               Total |   127,443     14,067 |   141,510 
                     |     90.06       9.94 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Smoking |  Death from Covid-19
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |    38,375      4,308 |    42,683 
             |     89.91      10.09 |    100.00 
-------------+----------------------+----------
      Former |    53,512      5,900 |    59,412 
             |     90.07       9.93 |    100.00 
-------------+----------------------+----------
     Current |    21,386      2,301 |    23,687 
             |     90.29       9.71 |    100.00 
-------------+----------------------+----------
Unknown (.u) |    14,170      1,558 |    15,728 
             |     90.09       9.91 |    100.00 
-------------+----------------------+----------
       Total |   127,443     14,067 |   141,510 
             |     90.06       9.94 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

Respirator |
 y disease |
    (excl. |  Death from Covid-19
   asthma) |         0          1 |     Total
-----------+----------------------+----------
         0 |   126,615     13,976 |   140,591 
           |     90.06       9.94 |    100.00 
-----------+----------------------+----------
         1 |       828         91 |       919 
           |     90.10       9.90 |    100.00 
-----------+----------------------+----------
     Total |   127,443     14,067 |   141,510 
           |     90.06       9.94 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Death from Covid-19
    Asthma |         0          1 |     Total
-----------+----------------------+----------
         0 |   127,354     14,050 |   141,404 
           |     90.06       9.94 |    100.00 
-----------+----------------------+----------
         1 |        89         17 |       106 
           |     83.96      16.04 |    100.00 
-----------+----------------------+----------
     Total |   127,443     14,067 |   141,510 
           |     90.06       9.94 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Heart |  Death from Covid-19
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |   106,855     11,776 |   118,631 
           |     90.07       9.93 |    100.00 
-----------+----------------------+----------
         1 |    20,588      2,291 |    22,879 
           |     89.99      10.01 |    100.00 
-----------+----------------------+----------
     Total |   127,443     14,067 |   141,510 
           |     90.06       9.94 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Death from Covid-19
  Diabetes |         0          1 |     Total
-----------+----------------------+----------
         0 |    89,618      9,863 |    99,481 
           |     90.09       9.91 |    100.00 
-----------+----------------------+----------
         1 |    37,825      4,204 |    42,029 
           |     90.00      10.00 |    100.00 
-----------+----------------------+----------
     Total |   127,443     14,067 |   141,510 
           |     90.06       9.94 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

      Lung |  Death from Covid-19
    cancer |         0          1 |     Total
-----------+----------------------+----------
         0 |   127,415     14,061 |   141,476 
           |     90.06       9.94 |    100.00 
-----------+----------------------+----------
         1 |        28          6 |        34 
           |     82.35      17.65 |    100.00 
-----------+----------------------+----------
     Total |   127,443     14,067 |   141,510 
           |     90.06       9.94 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Haem. |  Death from Covid-19
    cancer |         0          1 |     Total
-----------+----------------------+----------
         0 |   118,345     13,011 |   131,356 
           |     90.09       9.91 |    100.00 
-----------+----------------------+----------
         1 |     9,098      1,056 |    10,154 
           |     89.60      10.40 |    100.00 
-----------+----------------------+----------
     Total |   127,443     14,067 |   141,510 
           |     90.06       9.94 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Death from Covid-19
Any cancer |         0          1 |     Total
-----------+----------------------+----------
         0 |   126,764     13,989 |   140,753 
           |     90.06       9.94 |    100.00 
-----------+----------------------+----------
         1 |       679         78 |       757 
           |     89.70      10.30 |    100.00 
-----------+----------------------+----------
     Total |   127,443     14,067 |   141,510 
           |     90.06       9.94 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Death from Covid-19
    Cancer |         0          1 |     Total
-----------+----------------------+----------
         0 |   117,651     12,928 |   130,579 
           |     90.10       9.90 |    100.00 
-----------+----------------------+----------
         1 |     9,792      1,139 |    10,931 
           |     89.58      10.42 |    100.00 
-----------+----------------------+----------
     Total |   127,443     14,067 |   141,510 
           |     90.06       9.94 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Death from Covid-19
     Liver |         0          1 |     Total
-----------+----------------------+----------
         0 |   118,412     13,025 |   131,437 
           |     90.09       9.91 |    100.00 
-----------+----------------------+----------
         1 |     9,031      1,042 |    10,073 
           |     89.66      10.34 |    100.00 
-----------+----------------------+----------
     Total |   127,443     14,067 |   141,510 
           |     90.06       9.94 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

Neurologic |  Death from Covid-19
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 |   126,615     13,976 |   140,591 
           |     90.06       9.94 |    100.00 
-----------+----------------------+----------
         1 |       828         91 |       919 
           |     90.10       9.90 |    100.00 
-----------+----------------------+----------
     Total |   127,443     14,067 |   141,510 
           |     90.06       9.94 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

    Kidney |  Death from Covid-19
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |   127,443     14,067 |   141,510 
           |     90.06       9.94 |    100.00 
-----------+----------------------+----------
     Total |   127,443     14,067 |   141,510 
           |     90.06       9.94 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Organ |
transplant |  Death from Covid-19
 recipient |         0          1 |     Total
-----------+----------------------+----------
         0 |   127,426     14,063 |   141,489 
           |     90.06       9.94 |    100.00 
-----------+----------------------+----------
         1 |        17          4 |        21 
           |     80.95      19.05 |    100.00 
-----------+----------------------+----------
     Total |   127,443     14,067 |   141,510 
           |     90.06       9.94 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

    Spleen |
  problems |
(dysplenia |
  , sickle |  Death from Covid-19
     cell) |         0          1 |     Total
-----------+----------------------+----------
         0 |   118,351     13,112 |   131,463 
           |     90.03       9.97 |    100.00 
-----------+----------------------+----------
         1 |     9,092        955 |    10,047 
           |     90.49       9.51 |    100.00 
-----------+----------------------+----------
     Total |   127,443     14,067 |   141,510 
           |     90.06       9.94 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

Immunosupp |
    ressed |
(combinati |
        on |  Death from Covid-19
algorithm) |         0          1 |     Total
-----------+----------------------+----------
         0 |   117,524     13,021 |   130,545 
           |     90.03       9.97 |    100.00 
-----------+----------------------+----------
         1 |     9,919      1,046 |    10,965 
           |     90.46       9.54 |    100.00 
-----------+----------------------+----------
     Total |   127,443     14,067 |   141,510 
           |     90.06       9.94 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

  RA, SLE, |
 Psoriasis |
(autoimmun |  Death from Covid-19
e disease) |         0          1 |     Total
-----------+----------------------+----------
         0 |   126,650     13,984 |   140,634 
           |     90.06       9.94 |    100.00 
-----------+----------------------+----------
         1 |       793         83 |       876 
           |     90.53       9.47 |    100.00 
-----------+----------------------+----------
     Total |   127,443     14,067 |   141,510 
           |     90.06       9.94 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

  Index of |
  Multiple |
Deprivatio |  Death from Covid-19
   n (IMD) |         0          1 |     Total
-----------+----------------------+----------
         1 |    20,340      2,284 |    22,624 
           |     89.90      10.10 |    100.00 
-----------+----------------------+----------
         2 |    26,429      2,977 |    29,406 
           |     89.88      10.12 |    100.00 
-----------+----------------------+----------
         3 |    25,977      2,933 |    28,910 
           |     89.85      10.15 |    100.00 
-----------+----------------------+----------
         4 |    25,384      2,738 |    28,122 
           |     90.26       9.74 |    100.00 
-----------+----------------------+----------
         5 |    25,867      2,754 |    28,621 
           |     90.38       9.62 |    100.00 
-----------+----------------------+----------
     Total |   123,997     13,686 |   137,683 
           |     90.06       9.94 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Hospitalised for
   Grouped |       Covid-19
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<40 |    28,704      6,961 |    35,665 
           |     80.48      19.52 |    100.00 
-----------+----------------------+----------
    40-<50 |    21,953      5,467 |    27,420 
           |     80.06      19.94 |    100.00 
-----------+----------------------+----------
    50-<60 |    23,869      5,908 |    29,777 
           |     80.16      19.84 |    100.00 
-----------+----------------------+----------
    60-<70 |    11,588      2,876 |    14,464 
           |     80.12      19.88 |    100.00 
-----------+----------------------+----------
    70-<80 |     9,402      2,361 |    11,763 
           |     79.93      20.07 |    100.00 
-----------+----------------------+----------
       80+ |    18,025      4,396 |    22,421 
           |     80.39      19.61 |    100.00 
-----------+----------------------+----------
     Total |   113,541     27,969 |   141,510 
           |     80.24      19.76 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Hospitalised for
           |       Covid-19
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |    62,389     15,308 |    77,697 
           |     80.30      19.70 |    100.00 
-----------+----------------------+----------
         1 |    51,152     12,661 |    63,813 
           |     80.16      19.84 |    100.00 
-----------+----------------------+----------
     Total |   113,541     27,969 |   141,510 
           |     80.24      19.76 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                     |   Hospitalised for
                     |       Covid-19
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |     7,141      1,848 |     8,989 
                     |     79.44      20.56 |    100.00 
---------------------+----------------------+----------
  Normal (18.5-24.9) |    16,899      4,152 |    21,051 
                     |     80.28      19.72 |    100.00 
---------------------+----------------------+----------
Overweight (25-29.9) |    14,897      3,597 |    18,494 
                     |     80.55      19.45 |    100.00 
---------------------+----------------------+----------
   Obese I (30-34.9) |    14,608      3,611 |    18,219 
                     |     80.18      19.82 |    100.00 
---------------------+----------------------+----------
  Obese II (35-39.9) |    13,202      3,332 |    16,534 
                     |     79.85      20.15 |    100.00 
---------------------+----------------------+----------
     Obese III (40+) |    18,088      4,515 |    22,603 
                     |     80.02      19.98 |    100.00 
---------------------+----------------------+----------
        Unknown (.u) |    28,706      6,914 |    35,620 
                     |     80.59      19.41 |    100.00 
---------------------+----------------------+----------
               Total |   113,541     27,969 |   141,510 
                     |     80.24      19.76 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |   Hospitalised for
     Smoking |       Covid-19
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |    34,232      8,451 |    42,683 
             |     80.20      19.80 |    100.00 
-------------+----------------------+----------
      Former |    47,615     11,797 |    59,412 
             |     80.14      19.86 |    100.00 
-------------+----------------------+----------
     Current |    19,024      4,663 |    23,687 
             |     80.31      19.69 |    100.00 
-------------+----------------------+----------
Unknown (.u) |    12,670      3,058 |    15,728 
             |     80.56      19.44 |    100.00 
-------------+----------------------+----------
       Total |   113,541     27,969 |   141,510 
             |     80.24      19.76 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

Respirator |
 y disease |   Hospitalised for
    (excl. |       Covid-19
   asthma) |         0          1 |     Total
-----------+----------------------+----------
         0 |   112,807     27,784 |   140,591 
           |     80.24      19.76 |    100.00 
-----------+----------------------+----------
         1 |       734        185 |       919 
           |     79.87      20.13 |    100.00 
-----------+----------------------+----------
     Total |   113,541     27,969 |   141,510 
           |     80.24      19.76 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Hospitalised for
           |       Covid-19
    Asthma |         0          1 |     Total
-----------+----------------------+----------
         0 |   113,454     27,950 |   141,404 
           |     80.23      19.77 |    100.00 
-----------+----------------------+----------
         1 |        87         19 |       106 
           |     82.08      17.92 |    100.00 
-----------+----------------------+----------
     Total |   113,541     27,969 |   141,510 
           |     80.24      19.76 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Hospitalised for
     Heart |       Covid-19
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    95,162     23,469 |   118,631 
           |     80.22      19.78 |    100.00 
-----------+----------------------+----------
         1 |    18,379      4,500 |    22,879 
           |     80.33      19.67 |    100.00 
-----------+----------------------+----------
     Total |   113,541     27,969 |   141,510 
           |     80.24      19.76 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Hospitalised for
           |       Covid-19
  Diabetes |         0          1 |     Total
-----------+----------------------+----------
         0 |    79,779     19,702 |    99,481 
           |     80.20      19.80 |    100.00 
-----------+----------------------+----------
         1 |    33,762      8,267 |    42,029 
           |     80.33      19.67 |    100.00 
-----------+----------------------+----------
     Total |   113,541     27,969 |   141,510 
           |     80.24      19.76 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Hospitalised for
      Lung |       Covid-19
    cancer |         0          1 |     Total
-----------+----------------------+----------
         0 |   113,511     27,965 |   141,476 
           |     80.23      19.77 |    100.00 
-----------+----------------------+----------
         1 |        30          4 |        34 
           |     88.24      11.76 |    100.00 
-----------+----------------------+----------
     Total |   113,541     27,969 |   141,510 
           |     80.24      19.76 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Hospitalised for
     Haem. |       Covid-19
    cancer |         0          1 |     Total
-----------+----------------------+----------
         0 |   105,350     26,006 |   131,356 
           |     80.20      19.80 |    100.00 
-----------+----------------------+----------
         1 |     8,191      1,963 |    10,154 
           |     80.67      19.33 |    100.00 
-----------+----------------------+----------
     Total |   113,541     27,969 |   141,510 
           |     80.24      19.76 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Hospitalised for
           |       Covid-19
Any cancer |         0          1 |     Total
-----------+----------------------+----------
         0 |   112,929     27,824 |   140,753 
           |     80.23      19.77 |    100.00 
-----------+----------------------+----------
         1 |       612        145 |       757 
           |     80.85      19.15 |    100.00 
-----------+----------------------+----------
     Total |   113,541     27,969 |   141,510 
           |     80.24      19.76 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Hospitalised for
           |       Covid-19
    Cancer |         0          1 |     Total
-----------+----------------------+----------
         0 |   104,720     25,859 |   130,579 
           |     80.20      19.80 |    100.00 
-----------+----------------------+----------
         1 |     8,821      2,110 |    10,931 
           |     80.70      19.30 |    100.00 
-----------+----------------------+----------
     Total |   113,541     27,969 |   141,510 
           |     80.24      19.76 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Hospitalised for
           |       Covid-19
     Liver |         0          1 |     Total
-----------+----------------------+----------
         0 |   105,418     26,019 |   131,437 
           |     80.20      19.80 |    100.00 
-----------+----------------------+----------
         1 |     8,123      1,950 |    10,073 
           |     80.64      19.36 |    100.00 
-----------+----------------------+----------
     Total |   113,541     27,969 |   141,510 
           |     80.24      19.76 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Hospitalised for
Neurologic |       Covid-19
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 |   112,807     27,784 |   140,591 
           |     80.24      19.76 |    100.00 
-----------+----------------------+----------
         1 |       734        185 |       919 
           |     79.87      20.13 |    100.00 
-----------+----------------------+----------
     Total |   113,541     27,969 |   141,510 
           |     80.24      19.76 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Hospitalised for
    Kidney |       Covid-19
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |   113,541     27,969 |   141,510 
           |     80.24      19.76 |    100.00 
-----------+----------------------+----------
     Total |   113,541     27,969 |   141,510 
           |     80.24      19.76 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Organ |   Hospitalised for
transplant |       Covid-19
 recipient |         0          1 |     Total
-----------+----------------------+----------
         0 |   113,526     27,963 |   141,489 
           |     80.24      19.76 |    100.00 
-----------+----------------------+----------
         1 |        15          6 |        21 
           |     71.43      28.57 |    100.00 
-----------+----------------------+----------
     Total |   113,541     27,969 |   141,510 
           |     80.24      19.76 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

    Spleen |
  problems |
(dysplenia |   Hospitalised for
  , sickle |       Covid-19
     cell) |         0          1 |     Total
-----------+----------------------+----------
         0 |   105,507     25,956 |   131,463 
           |     80.26      19.74 |    100.00 
-----------+----------------------+----------
         1 |     8,034      2,013 |    10,047 
           |     79.96      20.04 |    100.00 
-----------+----------------------+----------
     Total |   113,541     27,969 |   141,510 
           |     80.24      19.76 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

Immunosupp |
    ressed |
(combinati |   Hospitalised for
        on |       Covid-19
algorithm) |         0          1 |     Total
-----------+----------------------+----------
         0 |   104,773     25,772 |   130,545 
           |     80.26      19.74 |    100.00 
-----------+----------------------+----------
         1 |     8,768      2,197 |    10,965 
           |     79.96      20.04 |    100.00 
-----------+----------------------+----------
     Total |   113,541     27,969 |   141,510 
           |     80.24      19.76 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

  RA, SLE, |
 Psoriasis |   Hospitalised for
(autoimmun |       Covid-19
e disease) |         0          1 |     Total
-----------+----------------------+----------
         0 |   112,829     27,805 |   140,634 
           |     80.23      19.77 |    100.00 
-----------+----------------------+----------
         1 |       712        164 |       876 
           |     81.28      18.72 |    100.00 
-----------+----------------------+----------
     Total |   113,541     27,969 |   141,510 
           |     80.24      19.76 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

  Index of |
  Multiple |   Hospitalised for
Deprivatio |       Covid-19
   n (IMD) |         0          1 |     Total
-----------+----------------------+----------
         1 |    18,142      4,482 |    22,624 
           |     80.19      19.81 |    100.00 
-----------+----------------------+----------
         2 |    23,492      5,914 |    29,406 
           |     79.89      20.11 |    100.00 
-----------+----------------------+----------
         3 |    23,224      5,686 |    28,910 
           |     80.33      19.67 |    100.00 
-----------+----------------------+----------
         4 |    22,575      5,547 |    28,122 
           |     80.28      19.72 |    100.00 
-----------+----------------------+----------
         5 |    23,032      5,589 |    28,621 
           |     80.47      19.53 |    100.00 
-----------+----------------------+----------
     Total |   110,465     27,218 |   137,683 
           |     80.23      19.77 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Admitted to ITU for
   Grouped |       Covid-19
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<40 |    33,887      1,778 |    35,665 
           |     95.01       4.99 |    100.00 
-----------+----------------------+----------
    40-<50 |    26,063      1,357 |    27,420 
           |     95.05       4.95 |    100.00 
-----------+----------------------+----------
    50-<60 |    28,288      1,489 |    29,777 
           |     95.00       5.00 |    100.00 
-----------+----------------------+----------
    60-<70 |    13,762        702 |    14,464 
           |     95.15       4.85 |    100.00 
-----------+----------------------+----------
    70-<80 |    11,184        579 |    11,763 
           |     95.08       4.92 |    100.00 
-----------+----------------------+----------
       80+ |    21,345      1,076 |    22,421 
           |     95.20       4.80 |    100.00 
-----------+----------------------+----------
     Total |   134,529      6,981 |   141,510 
           |     95.07       4.93 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Admitted to ITU for
           |       Covid-19
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |    73,857      3,840 |    77,697 
           |     95.06       4.94 |    100.00 
-----------+----------------------+----------
         1 |    60,672      3,141 |    63,813 
           |     95.08       4.92 |    100.00 
-----------+----------------------+----------
     Total |   134,529      6,981 |   141,510 
           |     95.07       4.93 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                     |  Admitted to ITU for
                     |       Covid-19
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |     8,540        449 |     8,989 
                     |     95.01       4.99 |    100.00 
---------------------+----------------------+----------
  Normal (18.5-24.9) |    20,022      1,029 |    21,051 
                     |     95.11       4.89 |    100.00 
---------------------+----------------------+----------
Overweight (25-29.9) |    17,589        905 |    18,494 
                     |     95.11       4.89 |    100.00 
---------------------+----------------------+----------
   Obese I (30-34.9) |    17,290        929 |    18,219 
                     |     94.90       5.10 |    100.00 
---------------------+----------------------+----------
  Obese II (35-39.9) |    15,727        807 |    16,534 
                     |     95.12       4.88 |    100.00 
---------------------+----------------------+----------
     Obese III (40+) |    21,513      1,090 |    22,603 
                     |     95.18       4.82 |    100.00 
---------------------+----------------------+----------
        Unknown (.u) |    33,848      1,772 |    35,620 
                     |     95.03       4.97 |    100.00 
---------------------+----------------------+----------
               Total |   134,529      6,981 |   141,510 
                     |     95.07       4.93 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |  Admitted to ITU for
     Smoking |       Covid-19
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |    40,582      2,101 |    42,683 
             |     95.08       4.92 |    100.00 
-------------+----------------------+----------
      Former |    56,486      2,926 |    59,412 
             |     95.08       4.92 |    100.00 
-------------+----------------------+----------
     Current |    22,546      1,141 |    23,687 
             |     95.18       4.82 |    100.00 
-------------+----------------------+----------
Unknown (.u) |    14,915        813 |    15,728 
             |     94.83       5.17 |    100.00 
-------------+----------------------+----------
       Total |   134,529      6,981 |   141,510 
             |     95.07       4.93 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

Respirator |
 y disease |  Admitted to ITU for
    (excl. |       Covid-19
   asthma) |         0          1 |     Total
-----------+----------------------+----------
         0 |   133,650      6,941 |   140,591 
           |     95.06       4.94 |    100.00 
-----------+----------------------+----------
         1 |       879         40 |       919 
           |     95.65       4.35 |    100.00 
-----------+----------------------+----------
     Total |   134,529      6,981 |   141,510 
           |     95.07       4.93 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Admitted to ITU for
           |       Covid-19
    Asthma |         0          1 |     Total
-----------+----------------------+----------
         0 |   134,427      6,977 |   141,404 
           |     95.07       4.93 |    100.00 
-----------+----------------------+----------
         1 |       102          4 |       106 
           |     96.23       3.77 |    100.00 
-----------+----------------------+----------
     Total |   134,529      6,981 |   141,510 
           |     95.07       4.93 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Admitted to ITU for
     Heart |       Covid-19
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |   112,800      5,831 |   118,631 
           |     95.08       4.92 |    100.00 
-----------+----------------------+----------
         1 |    21,729      1,150 |    22,879 
           |     94.97       5.03 |    100.00 
-----------+----------------------+----------
     Total |   134,529      6,981 |   141,510 
           |     95.07       4.93 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Admitted to ITU for
           |       Covid-19
  Diabetes |         0          1 |     Total
-----------+----------------------+----------
         0 |    94,608      4,873 |    99,481 
           |     95.10       4.90 |    100.00 
-----------+----------------------+----------
         1 |    39,921      2,108 |    42,029 
           |     94.98       5.02 |    100.00 
-----------+----------------------+----------
     Total |   134,529      6,981 |   141,510 
           |     95.07       4.93 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Admitted to ITU for
      Lung |       Covid-19
    cancer |         0          1 |     Total
-----------+----------------------+----------
         0 |   134,496      6,980 |   141,476 
           |     95.07       4.93 |    100.00 
-----------+----------------------+----------
         1 |        33          1 |        34 
           |     97.06       2.94 |    100.00 
-----------+----------------------+----------
     Total |   134,529      6,981 |   141,510 
           |     95.07       4.93 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Admitted to ITU for
     Haem. |       Covid-19
    cancer |         0          1 |     Total
-----------+----------------------+----------
         0 |   124,903      6,453 |   131,356 
           |     95.09       4.91 |    100.00 
-----------+----------------------+----------
         1 |     9,626        528 |    10,154 
           |     94.80       5.20 |    100.00 
-----------+----------------------+----------
     Total |   134,529      6,981 |   141,510 
           |     95.07       4.93 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Admitted to ITU for
           |       Covid-19
Any cancer |         0          1 |     Total
-----------+----------------------+----------
         0 |   133,830      6,923 |   140,753 
           |     95.08       4.92 |    100.00 
-----------+----------------------+----------
         1 |       699         58 |       757 
           |     92.34       7.66 |    100.00 
-----------+----------------------+----------
     Total |   134,529      6,981 |   141,510 
           |     95.07       4.93 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Admitted to ITU for
           |       Covid-19
    Cancer |         0          1 |     Total
-----------+----------------------+----------
         0 |   124,183      6,396 |   130,579 
           |     95.10       4.90 |    100.00 
-----------+----------------------+----------
         1 |    10,346        585 |    10,931 
           |     94.65       5.35 |    100.00 
-----------+----------------------+----------
     Total |   134,529      6,981 |   141,510 
           |     95.07       4.93 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Admitted to ITU for
           |       Covid-19
     Liver |         0          1 |     Total
-----------+----------------------+----------
         0 |   124,984      6,453 |   131,437 
           |     95.09       4.91 |    100.00 
-----------+----------------------+----------
         1 |     9,545        528 |    10,073 
           |     94.76       5.24 |    100.00 
-----------+----------------------+----------
     Total |   134,529      6,981 |   141,510 
           |     95.07       4.93 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Admitted to ITU for
Neurologic |       Covid-19
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 |   133,650      6,941 |   140,591 
           |     95.06       4.94 |    100.00 
-----------+----------------------+----------
         1 |       879         40 |       919 
           |     95.65       4.35 |    100.00 
-----------+----------------------+----------
     Total |   134,529      6,981 |   141,510 
           |     95.07       4.93 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Admitted to ITU for
    Kidney |       Covid-19
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |   134,529      6,981 |   141,510 
           |     95.07       4.93 |    100.00 
-----------+----------------------+----------
     Total |   134,529      6,981 |   141,510 
           |     95.07       4.93 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Organ |  Admitted to ITU for
transplant |       Covid-19
 recipient |         0          1 |     Total
-----------+----------------------+----------
         0 |   134,508      6,981 |   141,489 
           |     95.07       4.93 |    100.00 
-----------+----------------------+----------
         1 |        21          0 |        21 
           |    100.00       0.00 |    100.00 
-----------+----------------------+----------
     Total |   134,529      6,981 |   141,510 
           |     95.07       4.93 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

    Spleen |
  problems |
(dysplenia |  Admitted to ITU for
  , sickle |       Covid-19
     cell) |         0          1 |     Total
-----------+----------------------+----------
         0 |   124,977      6,486 |   131,463 
           |     95.07       4.93 |    100.00 
-----------+----------------------+----------
         1 |     9,552        495 |    10,047 
           |     95.07       4.93 |    100.00 
-----------+----------------------+----------
     Total |   134,529      6,981 |   141,510 
           |     95.07       4.93 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

Immunosupp |
    ressed |
(combinati |  Admitted to ITU for
        on |       Covid-19
algorithm) |         0          1 |     Total
-----------+----------------------+----------
         0 |   124,099      6,446 |   130,545 
           |     95.06       4.94 |    100.00 
-----------+----------------------+----------
         1 |    10,430        535 |    10,965 
           |     95.12       4.88 |    100.00 
-----------+----------------------+----------
     Total |   134,529      6,981 |   141,510 
           |     95.07       4.93 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

  RA, SLE, |
 Psoriasis |  Admitted to ITU for
(autoimmun |       Covid-19
e disease) |         0          1 |     Total
-----------+----------------------+----------
         0 |   133,703      6,931 |   140,634 
           |     95.07       4.93 |    100.00 
-----------+----------------------+----------
         1 |       826         50 |       876 
           |     94.29       5.71 |    100.00 
-----------+----------------------+----------
     Total |   134,529      6,981 |   141,510 
           |     95.07       4.93 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

  Index of |
  Multiple |  Admitted to ITU for
Deprivatio |       Covid-19
   n (IMD) |         0          1 |     Total
-----------+----------------------+----------
         1 |    21,505      1,119 |    22,624 
           |     95.05       4.95 |    100.00 
-----------+----------------------+----------
         2 |    27,987      1,419 |    29,406 
           |     95.17       4.83 |    100.00 
-----------+----------------------+----------
         3 |    27,454      1,456 |    28,910 
           |     94.96       5.04 |    100.00 
-----------+----------------------+----------
         4 |    26,745      1,377 |    28,122 
           |     95.10       4.90 |    100.00 
-----------+----------------------+----------
         5 |    27,211      1,410 |    28,621 
           |     95.07       4.93 |    100.00 
-----------+----------------------+----------
     Total |   130,902      6,781 |   137,683 
           |     95.07       4.93 |    100.00 

. 
. 
. 
. * Close the log file
. log close
      name:  <unnamed>
       log:  C:\Github\opencorona-risk-factors-research\analysis\output/an_descriptive_tables.log
  log type:  text
 closed on:  18 Apr 2020, 18:20:07
----------------------------------------------------------------------------------------------------------------------------------------------------------
