-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/app/notebook/analysis/output/an_descriptive_tables.log
  log type:  text
 opened on:  19 Apr 2020, 17:32:56

. 
. use egdata, clear
(Poor factors dummy analysis dataset)

. 
. **********************************
. *  Distribution in whole cohort  *
. **********************************
. 
. 
. * Demographics
. summ age

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |    141,510    54.14491    21.16692         18        105

. tab agegroup

Grouped age |      Freq.     Percent        Cum.
------------+-----------------------------------
     18-<40 |     35,665       25.20       25.20
     40-<50 |     27,420       19.38       44.58
     50-<60 |     29,777       21.04       65.62
     60-<70 |     14,464       10.22       75.84
     70-<80 |     11,763        8.31       84.16
        80+ |     22,421       15.84      100.00
------------+-----------------------------------
      Total |    141,510      100.00

. tab male

       Male |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     77,697       54.91       54.91
          1 |     63,813       45.09      100.00
------------+-----------------------------------
      Total |    141,510      100.00

. tab bmicat

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |      8,955        8.46        8.46
  Normal (18.5-24.9) |     21,059       19.89       28.35
Overweight (25-29.9) |     18,485       17.46       45.81
   Obese I (30-34.9) |     18,250       17.24       63.04
  Obese II (35-39.9) |     16,530       15.61       78.65
     Obese III (40+) |     22,600       21.35      100.00
---------------------+-----------------------------------
               Total |    105,879      100.00

. tab bmicat, m

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |      8,955        6.33        6.33
  Normal (18.5-24.9) |     21,059       14.88       21.21
Overweight (25-29.9) |     18,485       13.06       34.27
   Obese I (30-34.9) |     18,250       12.90       47.17
  Obese II (35-39.9) |     16,530       11.68       58.85
     Obese III (40+) |     22,600       15.97       74.82
        Unknown (.u) |     35,631       25.18      100.00
---------------------+-----------------------------------
               Total |    141,510      100.00

. tab smoke

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |     42,649       33.92       33.92
      Former |     59,419       47.25       81.17
     Current |     23,683       18.83      100.00
-------------+-----------------------------------
       Total |    125,751      100.00

. tab smoke, m

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |     42,649       30.14       30.14
      Former |     59,419       41.99       72.13
     Current |     23,683       16.74       88.86
Unknown (.u) |     15,759       11.14      100.00
-------------+-----------------------------------
       Total |    141,510      100.00

. 
. * Comorbidities
. tab chronic_respiratory_disease

Respiratory |
    disease |
     (excl. |
    asthma) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    140,591       99.35       99.35
          1 |        919        0.65      100.00
------------+-----------------------------------
      Total |    141,510      100.00

. tab asthma

     Asthma |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    141,404       99.93       99.93
          1 |        106        0.07      100.00
------------+-----------------------------------
      Total |    141,510      100.00

. tab chronic_cardiac_disease

      Heart |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    118,631       83.83       83.83
          1 |     22,879       16.17      100.00
------------+-----------------------------------
      Total |    141,510      100.00

. tab diabetes

   Diabetes |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     99,481       70.30       70.30
          1 |     42,029       29.70      100.00
------------+-----------------------------------
      Total |    141,510      100.00

. tab lung_cancer

Lung cancer |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    141,476       99.98       99.98
          1 |         34        0.02      100.00
------------+-----------------------------------
      Total |    141,510      100.00

. tab haem_cancer

      Haem. |
     cancer |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    131,356       92.82       92.82
          1 |     10,154        7.18      100.00
------------+-----------------------------------
      Total |    141,510      100.00

. tab other_cancer

 Any cancer |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    140,753       99.47       99.47
          1 |        757        0.53      100.00
------------+-----------------------------------
      Total |    141,510      100.00

. tab cancer

     Cancer |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    130,579       92.28       92.28
          1 |     10,931        7.72      100.00
------------+-----------------------------------
      Total |    141,510      100.00

. tab chronic_liver_disease

      Liver |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    131,437       92.88       92.88
          1 |     10,073        7.12      100.00
------------+-----------------------------------
      Total |    141,510      100.00

. tab neurological_condition

Neurologica |
  l disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    140,591       99.35       99.35
          1 |        919        0.65      100.00
------------+-----------------------------------
      Total |    141,510      100.00

. tab chronic_kidney_disease

     Kidney |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    141,510      100.00      100.00
------------+-----------------------------------
      Total |    141,510      100.00

. tab organ_transplant

      Organ |
 transplant |
  recipient |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    141,489       99.99       99.99
          1 |         21        0.01      100.00
------------+-----------------------------------
      Total |    141,510      100.00

. tab dysplenia

  Dysplenia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    131,464       92.90       92.90
          1 |     10,046        7.10      100.00
------------+-----------------------------------
      Total |    141,510      100.00

. tab sickle_cell

Sickle cell |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    141,509      100.00      100.00
          1 |          1        0.00      100.00
------------+-----------------------------------
      Total |    141,510      100.00

. tab spleen

     Spleen |
   problems |
(dysplenia, |
     sickle |
      cell) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    131,463       92.90       92.90
          1 |     10,047        7.10      100.00
------------+-----------------------------------
      Total |    141,510      100.00

. tab ra_sle_psoriasis

   RA, SLE, |
  Psoriasis |
(autoimmune |
   disease) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    140,634       99.38       99.38
          1 |        876        0.62      100.00
------------+-----------------------------------
      Total |    141,510      100.00

. tab immunosuppressed

Immunosuppr |
      essed |
(combinatio |
          n |
 algorithm) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    130,545       92.25       92.25
          1 |     10,965        7.75      100.00
------------+-----------------------------------
      Total |    141,510      100.00

. 
. tab bpcat

 Grouped blood |
      pressure |      Freq.     Percent        Cum.
---------------+-----------------------------------
        Normal |     52,645       37.20       37.20
      Elevated |     11,483        8.11       45.32
 High, stage I |     39,405       27.85       73.16
High, stage II |     37,977       26.84      100.00
---------------+-----------------------------------
         Total |    141,510      100.00

. 
. summ bp_sys,  detail

                   Systolic blood pressure
-------------------------------------------------------------
      Percentiles      Smallest
 1%     75.18619       47.21651
 5%     85.31656       47.31984
10%     90.75184       49.14478       Obs             141,510
25%     99.89835         52.278       Sum of Wgt.     141,510

50%     110.0822                      Mean           110.0339
                        Largest       Std. Dev.      15.00659
75%     120.2017       169.2426
90%     129.2925       169.6917       Variance       225.1978
95%     134.6674       169.6974       Skewness      -.0071516
99%     144.8845       175.9461       Kurtosis       2.968934

. summ bp_dias, detail

                  Diastolic blood pressure
-------------------------------------------------------------
      Percentiles      Smallest
 1%     45.00805       14.61039
 5%     55.27003       15.76301
10%     60.76169       16.01794       Obs             141,510
25%     69.80256       19.57638       Sum of Wgt.     141,510

50%     80.00836                      Mean           79.95429
                        Largest       Std. Dev.      15.00934
75%     90.05379       142.9181
90%     99.15333       143.8417       Variance       225.2803
95%     104.7023       146.3899       Skewness       .0005633
99%     114.7344       147.2473       Kurtosis       3.004489

. 
. * Adjustment variables 
. tab imd 

   Index of |
   Multiple |
Deprivation |
      (IMD) |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     22,624       16.43       16.43
          2 |     29,406       21.36       37.79
          3 |     28,910       21.00       58.79
          4 |     28,122       20.43       79.21
          5 |     28,621       20.79      100.00
------------+-----------------------------------
      Total |    137,683      100.00

. *tab ethnicity
. tab ethnicity, m

   Ethnicity |      Freq.     Percent        Cum.
-------------+-----------------------------------
       White |     42,138       29.78       29.78
       Black |     19,809       14.00       43.78
       Asian |      7,963        5.63       49.40
       Mixed |      7,108        5.02       54.43
       Other |      6,453        4.56       58.99
Unknown (.u) |     58,039       41.01      100.00
-------------+-----------------------------------
       Total |    141,510      100.00

. *tab urban
. 
. 
. * Outcomes
. tab died

 Death from |
   Covid-19 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    127,448       90.06       90.06
          1 |     14,062        9.94      100.00
------------+-----------------------------------
      Total |    141,510      100.00

. tab itu

Admitted to |
    ITU for |
   Covid-19 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    134,531       95.07       95.07
          1 |      6,979        4.93      100.00
------------+-----------------------------------
      Total |    141,510      100.00

. tab hosp

Hospitalise |
      d for |
   Covid-19 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    113,505       80.21       80.21
          1 |     28,005       19.79      100.00
------------+-----------------------------------
      Total |    141,510      100.00

. * tab compoutcome
. 
. 
. 
. **********************************
. *  Number (%) with each outcome  *
. **********************************
. 
. foreach outvar of varlist died hosp itu {
  2. 
. *** Repeat for each outcome
. 
.         * Demographics
.         tab agegroup                                                    `outv
> ar', row
  3.         tab male                                                          
>       `outvar', row
  4.         tab bmicat                                                        
>       `outvar', row m 
  5.         tab smoke                                                         
>       `outvar', row m
  6. 
.         * Comorbidities
.         tab chronic_respiratory_disease                 `outvar', row
  7.         tab asthma                                                        
>       `outvar', row
  8.         tab chronic_cardiac_disease                     `outvar', row
  9.         tab diabetes                                                    `o
> utvar', row
 10.         tab lung_cancer                                                 `o
> utvar', row
 11.         tab haem_cancer                                                 `o
> utvar', row
 12.         tab other_cancer                                                `o
> utvar', row
 13.         tab cancer                                                        
>       `outvar', row
 14.         tab chronic_liver_disease                               `outvar', 
> row
 15.         tab neurological_condition                              `outvar', 
> row
 16.         tab chronic_kidney_disease                              `outvar', 
> row
 17.         tab organ_transplant                                    `outvar', 
> row
 18.         tab spleen                                                        
>       `outvar', row
 19.         tab immunosuppressed                                    `outvar', 
> row
 20.         tab ra_sle_psoriasis                                    `outvar', 
> row
 21.         
.         * Adjustment variables 
.         tab imd                                                              
>    `outvar', row
 22.         *tab ethnicity                                                  `o
> utvar', row m
.         *tab urban                                                           
>    `outvar', row
. }

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped |  Death from Covid-19
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<40 |    32,169      3,496 |    35,665 
           |     90.20       9.80 |    100.00 
-----------+----------------------+----------
    40-<50 |    24,728      2,692 |    27,420 
           |     90.18       9.82 |    100.00 
-----------+----------------------+----------
    50-<60 |    26,747      3,030 |    29,777 
           |     89.82      10.18 |    100.00 
-----------+----------------------+----------
    60-<70 |    13,007      1,457 |    14,464 
           |     89.93      10.07 |    100.00 
-----------+----------------------+----------
    70-<80 |    10,569      1,194 |    11,763 
           |     89.85      10.15 |    100.00 
-----------+----------------------+----------
       80+ |    20,228      2,193 |    22,421 
           |     90.22       9.78 |    100.00 
-----------+----------------------+----------
     Total |   127,448     14,062 |   141,510 
           |     90.06       9.94 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Death from Covid-19
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |    70,035      7,662 |    77,697 
           |     90.14       9.86 |    100.00 
-----------+----------------------+----------
         1 |    57,413      6,400 |    63,813 
           |     89.97      10.03 |    100.00 
-----------+----------------------+----------
     Total |   127,448     14,062 |   141,510 
           |     90.06       9.94 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                     |  Death from Covid-19
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |     8,091        864 |     8,955 
                     |     90.35       9.65 |    100.00 
---------------------+----------------------+----------
  Normal (18.5-24.9) |    18,950      2,109 |    21,059 
                     |     89.99      10.01 |    100.00 
---------------------+----------------------+----------
Overweight (25-29.9) |    16,604      1,881 |    18,485 
                     |     89.82      10.18 |    100.00 
---------------------+----------------------+----------
   Obese I (30-34.9) |    16,462      1,788 |    18,250 
                     |     90.20       9.80 |    100.00 
---------------------+----------------------+----------
  Obese II (35-39.9) |    14,866      1,664 |    16,530 
                     |     89.93      10.07 |    100.00 
---------------------+----------------------+----------
     Obese III (40+) |    20,392      2,208 |    22,600 
                     |     90.23       9.77 |    100.00 
---------------------+----------------------+----------
        Unknown (.u) |    32,083      3,548 |    35,631 
                     |     90.04       9.96 |    100.00 
---------------------+----------------------+----------
               Total |   127,448     14,062 |   141,510 
                     |     90.06       9.94 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Smoking |  Death from Covid-19
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |    38,345      4,304 |    42,649 
             |     89.91      10.09 |    100.00 
-------------+----------------------+----------
      Former |    53,537      5,882 |    59,419 
             |     90.10       9.90 |    100.00 
-------------+----------------------+----------
     Current |    21,371      2,312 |    23,683 
             |     90.24       9.76 |    100.00 
-------------+----------------------+----------
Unknown (.u) |    14,195      1,564 |    15,759 
             |     90.08       9.92 |    100.00 
-------------+----------------------+----------
       Total |   127,448     14,062 |   141,510 
             |     90.06       9.94 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

Respirator |
 y disease |
    (excl. |  Death from Covid-19
   asthma) |         0          1 |     Total
-----------+----------------------+----------
         0 |   126,623     13,968 |   140,591 
           |     90.06       9.94 |    100.00 
-----------+----------------------+----------
         1 |       825         94 |       919 
           |     89.77      10.23 |    100.00 
-----------+----------------------+----------
     Total |   127,448     14,062 |   141,510 
           |     90.06       9.94 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Death from Covid-19
    Asthma |         0          1 |     Total
-----------+----------------------+----------
         0 |   127,355     14,049 |   141,404 
           |     90.06       9.94 |    100.00 
-----------+----------------------+----------
         1 |        93         13 |       106 
           |     87.74      12.26 |    100.00 
-----------+----------------------+----------
     Total |   127,448     14,062 |   141,510 
           |     90.06       9.94 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Heart |  Death from Covid-19
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |   106,811     11,820 |   118,631 
           |     90.04       9.96 |    100.00 
-----------+----------------------+----------
         1 |    20,637      2,242 |    22,879 
           |     90.20       9.80 |    100.00 
-----------+----------------------+----------
     Total |   127,448     14,062 |   141,510 
           |     90.06       9.94 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Death from Covid-19
  Diabetes |         0          1 |     Total
-----------+----------------------+----------
         0 |    89,609      9,872 |    99,481 
           |     90.08       9.92 |    100.00 
-----------+----------------------+----------
         1 |    37,839      4,190 |    42,029 
           |     90.03       9.97 |    100.00 
-----------+----------------------+----------
     Total |   127,448     14,062 |   141,510 
           |     90.06       9.94 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

      Lung |  Death from Covid-19
    cancer |         0          1 |     Total
-----------+----------------------+----------
         0 |   127,419     14,057 |   141,476 
           |     90.06       9.94 |    100.00 
-----------+----------------------+----------
         1 |        29          5 |        34 
           |     85.29      14.71 |    100.00 
-----------+----------------------+----------
     Total |   127,448     14,062 |   141,510 
           |     90.06       9.94 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Haem. |  Death from Covid-19
    cancer |         0          1 |     Total
-----------+----------------------+----------
         0 |   118,265     13,091 |   131,356 
           |     90.03       9.97 |    100.00 
-----------+----------------------+----------
         1 |     9,183        971 |    10,154 
           |     90.44       9.56 |    100.00 
-----------+----------------------+----------
     Total |   127,448     14,062 |   141,510 
           |     90.06       9.94 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Death from Covid-19
Any cancer |         0          1 |     Total
-----------+----------------------+----------
         0 |   126,766     13,987 |   140,753 
           |     90.06       9.94 |    100.00 
-----------+----------------------+----------
         1 |       682         75 |       757 
           |     90.09       9.91 |    100.00 
-----------+----------------------+----------
     Total |   127,448     14,062 |   141,510 
           |     90.06       9.94 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Death from Covid-19
    Cancer |         0          1 |     Total
-----------+----------------------+----------
         0 |   117,567     13,012 |   130,579 
           |     90.04       9.96 |    100.00 
-----------+----------------------+----------
         1 |     9,881      1,050 |    10,931 
           |     90.39       9.61 |    100.00 
-----------+----------------------+----------
     Total |   127,448     14,062 |   141,510 
           |     90.06       9.94 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Death from Covid-19
     Liver |         0          1 |     Total
-----------+----------------------+----------
         0 |   118,335     13,102 |   131,437 
           |     90.03       9.97 |    100.00 
-----------+----------------------+----------
         1 |     9,113        960 |    10,073 
           |     90.47       9.53 |    100.00 
-----------+----------------------+----------
     Total |   127,448     14,062 |   141,510 
           |     90.06       9.94 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

Neurologic |  Death from Covid-19
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 |   126,623     13,968 |   140,591 
           |     90.06       9.94 |    100.00 
-----------+----------------------+----------
         1 |       825         94 |       919 
           |     89.77      10.23 |    100.00 
-----------+----------------------+----------
     Total |   127,448     14,062 |   141,510 
           |     90.06       9.94 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

    Kidney |  Death from Covid-19
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |   127,448     14,062 |   141,510 
           |     90.06       9.94 |    100.00 
-----------+----------------------+----------
     Total |   127,448     14,062 |   141,510 
           |     90.06       9.94 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Organ |
transplant |  Death from Covid-19
 recipient |         0          1 |     Total
-----------+----------------------+----------
         0 |   127,429     14,060 |   141,489 
           |     90.06       9.94 |    100.00 
-----------+----------------------+----------
         1 |        19          2 |        21 
           |     90.48       9.52 |    100.00 
-----------+----------------------+----------
     Total |   127,448     14,062 |   141,510 
           |     90.06       9.94 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

    Spleen |
  problems |
(dysplenia |
  , sickle |  Death from Covid-19
     cell) |         0          1 |     Total
-----------+----------------------+----------
         0 |   118,407     13,056 |   131,463 
           |     90.07       9.93 |    100.00 
-----------+----------------------+----------
         1 |     9,041      1,006 |    10,047 
           |     89.99      10.01 |    100.00 
-----------+----------------------+----------
     Total |   127,448     14,062 |   141,510 
           |     90.06       9.94 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

Immunosupp |
    ressed |
(combinati |
        on |  Death from Covid-19
algorithm) |         0          1 |     Total
-----------+----------------------+----------
         0 |   117,582     12,963 |   130,545 
           |     90.07       9.93 |    100.00 
-----------+----------------------+----------
         1 |     9,866      1,099 |    10,965 
           |     89.98      10.02 |    100.00 
-----------+----------------------+----------
     Total |   127,448     14,062 |   141,510 
           |     90.06       9.94 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

  RA, SLE, |
 Psoriasis |
(autoimmun |  Death from Covid-19
e disease) |         0          1 |     Total
-----------+----------------------+----------
         0 |   126,651     13,983 |   140,634 
           |     90.06       9.94 |    100.00 
-----------+----------------------+----------
         1 |       797         79 |       876 
           |     90.98       9.02 |    100.00 
-----------+----------------------+----------
     Total |   127,448     14,062 |   141,510 
           |     90.06       9.94 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

  Index of |
  Multiple |
Deprivatio |  Death from Covid-19
   n (IMD) |         0          1 |     Total
-----------+----------------------+----------
         1 |    20,325      2,299 |    22,624 
           |     89.84      10.16 |    100.00 
-----------+----------------------+----------
         2 |    26,474      2,932 |    29,406 
           |     90.03       9.97 |    100.00 
-----------+----------------------+----------
         3 |    26,075      2,835 |    28,910 
           |     90.19       9.81 |    100.00 
-----------+----------------------+----------
         4 |    25,332      2,790 |    28,122 
           |     90.08       9.92 |    100.00 
-----------+----------------------+----------
         5 |    25,784      2,837 |    28,621 
           |     90.09       9.91 |    100.00 
-----------+----------------------+----------
     Total |   123,990     13,693 |   137,683 
           |     90.05       9.95 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Hospitalised for
   Grouped |       Covid-19
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<40 |    28,579      7,086 |    35,665 
           |     80.13      19.87 |    100.00 
-----------+----------------------+----------
    40-<50 |    21,930      5,490 |    27,420 
           |     79.98      20.02 |    100.00 
-----------+----------------------+----------
    50-<60 |    23,925      5,852 |    29,777 
           |     80.35      19.65 |    100.00 
-----------+----------------------+----------
    60-<70 |    11,568      2,896 |    14,464 
           |     79.98      20.02 |    100.00 
-----------+----------------------+----------
    70-<80 |     9,520      2,243 |    11,763 
           |     80.93      19.07 |    100.00 
-----------+----------------------+----------
       80+ |    17,983      4,438 |    22,421 
           |     80.21      19.79 |    100.00 
-----------+----------------------+----------
     Total |   113,505     28,005 |   141,510 
           |     80.21      19.79 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Hospitalised for
           |       Covid-19
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |    62,295     15,402 |    77,697 
           |     80.18      19.82 |    100.00 
-----------+----------------------+----------
         1 |    51,210     12,603 |    63,813 
           |     80.25      19.75 |    100.00 
-----------+----------------------+----------
     Total |   113,505     28,005 |   141,510 
           |     80.21      19.79 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                     |   Hospitalised for
                     |       Covid-19
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |     7,112      1,843 |     8,955 
                     |     79.42      20.58 |    100.00 
---------------------+----------------------+----------
  Normal (18.5-24.9) |    16,894      4,165 |    21,059 
                     |     80.22      19.78 |    100.00 
---------------------+----------------------+----------
Overweight (25-29.9) |    14,898      3,587 |    18,485 
                     |     80.60      19.40 |    100.00 
---------------------+----------------------+----------
   Obese I (30-34.9) |    14,631      3,619 |    18,250 
                     |     80.17      19.83 |    100.00 
---------------------+----------------------+----------
  Obese II (35-39.9) |    13,185      3,345 |    16,530 
                     |     79.76      20.24 |    100.00 
---------------------+----------------------+----------
     Obese III (40+) |    18,108      4,492 |    22,600 
                     |     80.12      19.88 |    100.00 
---------------------+----------------------+----------
        Unknown (.u) |    28,677      6,954 |    35,631 
                     |     80.48      19.52 |    100.00 
---------------------+----------------------+----------
               Total |   113,505     28,005 |   141,510 
                     |     80.21      19.79 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |   Hospitalised for
     Smoking |       Covid-19
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |    34,207      8,442 |    42,649 
             |     80.21      19.79 |    100.00 
-------------+----------------------+----------
      Former |    47,596     11,823 |    59,419 
             |     80.10      19.90 |    100.00 
-------------+----------------------+----------
     Current |    19,013      4,670 |    23,683 
             |     80.28      19.72 |    100.00 
-------------+----------------------+----------
Unknown (.u) |    12,689      3,070 |    15,759 
             |     80.52      19.48 |    100.00 
-------------+----------------------+----------
       Total |   113,505     28,005 |   141,510 
             |     80.21      19.79 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

Respirator |
 y disease |   Hospitalised for
    (excl. |       Covid-19
   asthma) |         0          1 |     Total
-----------+----------------------+----------
         0 |   112,752     27,839 |   140,591 
           |     80.20      19.80 |    100.00 
-----------+----------------------+----------
         1 |       753        166 |       919 
           |     81.94      18.06 |    100.00 
-----------+----------------------+----------
     Total |   113,505     28,005 |   141,510 
           |     80.21      19.79 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Hospitalised for
           |       Covid-19
    Asthma |         0          1 |     Total
-----------+----------------------+----------
         0 |   113,413     27,991 |   141,404 
           |     80.20      19.80 |    100.00 
-----------+----------------------+----------
         1 |        92         14 |       106 
           |     86.79      13.21 |    100.00 
-----------+----------------------+----------
     Total |   113,505     28,005 |   141,510 
           |     80.21      19.79 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Hospitalised for
     Heart |       Covid-19
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    95,100     23,531 |   118,631 
           |     80.16      19.84 |    100.00 
-----------+----------------------+----------
         1 |    18,405      4,474 |    22,879 
           |     80.44      19.56 |    100.00 
-----------+----------------------+----------
     Total |   113,505     28,005 |   141,510 
           |     80.21      19.79 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Hospitalised for
           |       Covid-19
  Diabetes |         0          1 |     Total
-----------+----------------------+----------
         0 |    79,801     19,680 |    99,481 
           |     80.22      19.78 |    100.00 
-----------+----------------------+----------
         1 |    33,704      8,325 |    42,029 
           |     80.19      19.81 |    100.00 
-----------+----------------------+----------
     Total |   113,505     28,005 |   141,510 
           |     80.21      19.79 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Hospitalised for
      Lung |       Covid-19
    cancer |         0          1 |     Total
-----------+----------------------+----------
         0 |   113,474     28,002 |   141,476 
           |     80.21      19.79 |    100.00 
-----------+----------------------+----------
         1 |        31          3 |        34 
           |     91.18       8.82 |    100.00 
-----------+----------------------+----------
     Total |   113,505     28,005 |   141,510 
           |     80.21      19.79 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Hospitalised for
     Haem. |       Covid-19
    cancer |         0          1 |     Total
-----------+----------------------+----------
         0 |   105,378     25,978 |   131,356 
           |     80.22      19.78 |    100.00 
-----------+----------------------+----------
         1 |     8,127      2,027 |    10,154 
           |     80.04      19.96 |    100.00 
-----------+----------------------+----------
     Total |   113,505     28,005 |   141,510 
           |     80.21      19.79 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Hospitalised for
           |       Covid-19
Any cancer |         0          1 |     Total
-----------+----------------------+----------
         0 |   112,870     27,883 |   140,753 
           |     80.19      19.81 |    100.00 
-----------+----------------------+----------
         1 |       635        122 |       757 
           |     83.88      16.12 |    100.00 
-----------+----------------------+----------
     Total |   113,505     28,005 |   141,510 
           |     80.21      19.79 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Hospitalised for
           |       Covid-19
    Cancer |         0          1 |     Total
-----------+----------------------+----------
         0 |   104,724     25,855 |   130,579 
           |     80.20      19.80 |    100.00 
-----------+----------------------+----------
         1 |     8,781      2,150 |    10,931 
           |     80.33      19.67 |    100.00 
-----------+----------------------+----------
     Total |   113,505     28,005 |   141,510 
           |     80.21      19.79 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Hospitalised for
           |       Covid-19
     Liver |         0          1 |     Total
-----------+----------------------+----------
         0 |   105,436     26,001 |   131,437 
           |     80.22      19.78 |    100.00 
-----------+----------------------+----------
         1 |     8,069      2,004 |    10,073 
           |     80.11      19.89 |    100.00 
-----------+----------------------+----------
     Total |   113,505     28,005 |   141,510 
           |     80.21      19.79 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Hospitalised for
Neurologic |       Covid-19
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 |   112,752     27,839 |   140,591 
           |     80.20      19.80 |    100.00 
-----------+----------------------+----------
         1 |       753        166 |       919 
           |     81.94      18.06 |    100.00 
-----------+----------------------+----------
     Total |   113,505     28,005 |   141,510 
           |     80.21      19.79 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Hospitalised for
    Kidney |       Covid-19
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |   113,505     28,005 |   141,510 
           |     80.21      19.79 |    100.00 
-----------+----------------------+----------
     Total |   113,505     28,005 |   141,510 
           |     80.21      19.79 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Organ |   Hospitalised for
transplant |       Covid-19
 recipient |         0          1 |     Total
-----------+----------------------+----------
         0 |   113,491     27,998 |   141,489 
           |     80.21      19.79 |    100.00 
-----------+----------------------+----------
         1 |        14          7 |        21 
           |     66.67      33.33 |    100.00 
-----------+----------------------+----------
     Total |   113,505     28,005 |   141,510 
           |     80.21      19.79 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

    Spleen |
  problems |
(dysplenia |   Hospitalised for
  , sickle |       Covid-19
     cell) |         0          1 |     Total
-----------+----------------------+----------
         0 |   105,410     26,053 |   131,463 
           |     80.18      19.82 |    100.00 
-----------+----------------------+----------
         1 |     8,095      1,952 |    10,047 
           |     80.57      19.43 |    100.00 
-----------+----------------------+----------
     Total |   113,505     28,005 |   141,510 
           |     80.21      19.79 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

Immunosupp |
    ressed |
(combinati |   Hospitalised for
        on |       Covid-19
algorithm) |         0          1 |     Total
-----------+----------------------+----------
         0 |   104,659     25,886 |   130,545 
           |     80.17      19.83 |    100.00 
-----------+----------------------+----------
         1 |     8,846      2,119 |    10,965 
           |     80.67      19.33 |    100.00 
-----------+----------------------+----------
     Total |   113,505     28,005 |   141,510 
           |     80.21      19.79 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

  RA, SLE, |
 Psoriasis |   Hospitalised for
(autoimmun |       Covid-19
e disease) |         0          1 |     Total
-----------+----------------------+----------
         0 |   112,793     27,841 |   140,634 
           |     80.20      19.80 |    100.00 
-----------+----------------------+----------
         1 |       712        164 |       876 
           |     81.28      18.72 |    100.00 
-----------+----------------------+----------
     Total |   113,505     28,005 |   141,510 
           |     80.21      19.79 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

  Index of |
  Multiple |   Hospitalised for
Deprivatio |       Covid-19
   n (IMD) |         0          1 |     Total
-----------+----------------------+----------
         1 |    18,211      4,413 |    22,624 
           |     80.49      19.51 |    100.00 
-----------+----------------------+----------
         2 |    23,565      5,841 |    29,406 
           |     80.14      19.86 |    100.00 
-----------+----------------------+----------
         3 |    23,129      5,781 |    28,910 
           |     80.00      20.00 |    100.00 
-----------+----------------------+----------
         4 |    22,556      5,566 |    28,122 
           |     80.21      19.79 |    100.00 
-----------+----------------------+----------
         5 |    22,954      5,667 |    28,621 
           |     80.20      19.80 |    100.00 
-----------+----------------------+----------
     Total |   110,415     27,268 |   137,683 
           |     80.20      19.80 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Admitted to ITU for
   Grouped |       Covid-19
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<40 |    33,929      1,736 |    35,665 
           |     95.13       4.87 |    100.00 
-----------+----------------------+----------
    40-<50 |    26,059      1,361 |    27,420 
           |     95.04       4.96 |    100.00 
-----------+----------------------+----------
    50-<60 |    28,298      1,479 |    29,777 
           |     95.03       4.97 |    100.00 
-----------+----------------------+----------
    60-<70 |    13,766        698 |    14,464 
           |     95.17       4.83 |    100.00 
-----------+----------------------+----------
    70-<80 |    11,170        593 |    11,763 
           |     94.96       5.04 |    100.00 
-----------+----------------------+----------
       80+ |    21,309      1,112 |    22,421 
           |     95.04       4.96 |    100.00 
-----------+----------------------+----------
     Total |   134,531      6,979 |   141,510 
           |     95.07       4.93 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Admitted to ITU for
           |       Covid-19
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |    73,892      3,805 |    77,697 
           |     95.10       4.90 |    100.00 
-----------+----------------------+----------
         1 |    60,639      3,174 |    63,813 
           |     95.03       4.97 |    100.00 
-----------+----------------------+----------
     Total |   134,531      6,979 |   141,510 
           |     95.07       4.93 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                     |  Admitted to ITU for
                     |       Covid-19
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |     8,504        451 |     8,955 
                     |     94.96       5.04 |    100.00 
---------------------+----------------------+----------
  Normal (18.5-24.9) |    20,020      1,039 |    21,059 
                     |     95.07       4.93 |    100.00 
---------------------+----------------------+----------
Overweight (25-29.9) |    17,589        896 |    18,485 
                     |     95.15       4.85 |    100.00 
---------------------+----------------------+----------
   Obese I (30-34.9) |    17,324        926 |    18,250 
                     |     94.93       5.07 |    100.00 
---------------------+----------------------+----------
  Obese II (35-39.9) |    15,724        806 |    16,530 
                     |     95.12       4.88 |    100.00 
---------------------+----------------------+----------
     Obese III (40+) |    21,503      1,097 |    22,600 
                     |     95.15       4.85 |    100.00 
---------------------+----------------------+----------
        Unknown (.u) |    33,867      1,764 |    35,631 
                     |     95.05       4.95 |    100.00 
---------------------+----------------------+----------
               Total |   134,531      6,979 |   141,510 
                     |     95.07       4.93 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |  Admitted to ITU for
     Smoking |       Covid-19
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |    40,556      2,093 |    42,649 
             |     95.09       4.91 |    100.00 
-------------+----------------------+----------
      Former |    56,478      2,941 |    59,419 
             |     95.05       4.95 |    100.00 
-------------+----------------------+----------
     Current |    22,550      1,133 |    23,683 
             |     95.22       4.78 |    100.00 
-------------+----------------------+----------
Unknown (.u) |    14,947        812 |    15,759 
             |     94.85       5.15 |    100.00 
-------------+----------------------+----------
       Total |   134,531      6,979 |   141,510 
             |     95.07       4.93 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

Respirator |
 y disease |  Admitted to ITU for
    (excl. |       Covid-19
   asthma) |         0          1 |     Total
-----------+----------------------+----------
         0 |   133,660      6,931 |   140,591 
           |     95.07       4.93 |    100.00 
-----------+----------------------+----------
         1 |       871         48 |       919 
           |     94.78       5.22 |    100.00 
-----------+----------------------+----------
     Total |   134,531      6,979 |   141,510 
           |     95.07       4.93 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Admitted to ITU for
           |       Covid-19
    Asthma |         0          1 |     Total
-----------+----------------------+----------
         0 |   134,432      6,972 |   141,404 
           |     95.07       4.93 |    100.00 
-----------+----------------------+----------
         1 |        99          7 |       106 
           |     93.40       6.60 |    100.00 
-----------+----------------------+----------
     Total |   134,531      6,979 |   141,510 
           |     95.07       4.93 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Admitted to ITU for
     Heart |       Covid-19
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |   112,795      5,836 |   118,631 
           |     95.08       4.92 |    100.00 
-----------+----------------------+----------
         1 |    21,736      1,143 |    22,879 
           |     95.00       5.00 |    100.00 
-----------+----------------------+----------
     Total |   134,531      6,979 |   141,510 
           |     95.07       4.93 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Admitted to ITU for
           |       Covid-19
  Diabetes |         0          1 |     Total
-----------+----------------------+----------
         0 |    94,639      4,842 |    99,481 
           |     95.13       4.87 |    100.00 
-----------+----------------------+----------
         1 |    39,892      2,137 |    42,029 
           |     94.92       5.08 |    100.00 
-----------+----------------------+----------
     Total |   134,531      6,979 |   141,510 
           |     95.07       4.93 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Admitted to ITU for
      Lung |       Covid-19
    cancer |         0          1 |     Total
-----------+----------------------+----------
         0 |   134,499      6,977 |   141,476 
           |     95.07       4.93 |    100.00 
-----------+----------------------+----------
         1 |        32          2 |        34 
           |     94.12       5.88 |    100.00 
-----------+----------------------+----------
     Total |   134,531      6,979 |   141,510 
           |     95.07       4.93 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Admitted to ITU for
     Haem. |       Covid-19
    cancer |         0          1 |     Total
-----------+----------------------+----------
         0 |   124,870      6,486 |   131,356 
           |     95.06       4.94 |    100.00 
-----------+----------------------+----------
         1 |     9,661        493 |    10,154 
           |     95.14       4.86 |    100.00 
-----------+----------------------+----------
     Total |   134,531      6,979 |   141,510 
           |     95.07       4.93 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Admitted to ITU for
           |       Covid-19
Any cancer |         0          1 |     Total
-----------+----------------------+----------
         0 |   133,808      6,945 |   140,753 
           |     95.07       4.93 |    100.00 
-----------+----------------------+----------
         1 |       723         34 |       757 
           |     95.51       4.49 |    100.00 
-----------+----------------------+----------
     Total |   134,531      6,979 |   141,510 
           |     95.07       4.93 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Admitted to ITU for
           |       Covid-19
    Cancer |         0          1 |     Total
-----------+----------------------+----------
         0 |   124,128      6,451 |   130,579 
           |     95.06       4.94 |    100.00 
-----------+----------------------+----------
         1 |    10,403        528 |    10,931 
           |     95.17       4.83 |    100.00 
-----------+----------------------+----------
     Total |   134,531      6,979 |   141,510 
           |     95.07       4.93 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Admitted to ITU for
           |       Covid-19
     Liver |         0          1 |     Total
-----------+----------------------+----------
         0 |   124,947      6,490 |   131,437 
           |     95.06       4.94 |    100.00 
-----------+----------------------+----------
         1 |     9,584        489 |    10,073 
           |     95.15       4.85 |    100.00 
-----------+----------------------+----------
     Total |   134,531      6,979 |   141,510 
           |     95.07       4.93 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Admitted to ITU for
Neurologic |       Covid-19
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 |   133,660      6,931 |   140,591 
           |     95.07       4.93 |    100.00 
-----------+----------------------+----------
         1 |       871         48 |       919 
           |     94.78       5.22 |    100.00 
-----------+----------------------+----------
     Total |   134,531      6,979 |   141,510 
           |     95.07       4.93 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Admitted to ITU for
    Kidney |       Covid-19
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |   134,531      6,979 |   141,510 
           |     95.07       4.93 |    100.00 
-----------+----------------------+----------
     Total |   134,531      6,979 |   141,510 
           |     95.07       4.93 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Organ |  Admitted to ITU for
transplant |       Covid-19
 recipient |         0          1 |     Total
-----------+----------------------+----------
         0 |   134,511      6,978 |   141,489 
           |     95.07       4.93 |    100.00 
-----------+----------------------+----------
         1 |        20          1 |        21 
           |     95.24       4.76 |    100.00 
-----------+----------------------+----------
     Total |   134,531      6,979 |   141,510 
           |     95.07       4.93 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

    Spleen |
  problems |
(dysplenia |  Admitted to ITU for
  , sickle |       Covid-19
     cell) |         0          1 |     Total
-----------+----------------------+----------
         0 |   125,008      6,455 |   131,463 
           |     95.09       4.91 |    100.00 
-----------+----------------------+----------
         1 |     9,523        524 |    10,047 
           |     94.78       5.22 |    100.00 
-----------+----------------------+----------
     Total |   134,531      6,979 |   141,510 
           |     95.07       4.93 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

Immunosupp |
    ressed |
(combinati |  Admitted to ITU for
        on |       Covid-19
algorithm) |         0          1 |     Total
-----------+----------------------+----------
         0 |   124,138      6,407 |   130,545 
           |     95.09       4.91 |    100.00 
-----------+----------------------+----------
         1 |    10,393        572 |    10,965 
           |     94.78       5.22 |    100.00 
-----------+----------------------+----------
     Total |   134,531      6,979 |   141,510 
           |     95.07       4.93 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

  RA, SLE, |
 Psoriasis |  Admitted to ITU for
(autoimmun |       Covid-19
e disease) |         0          1 |     Total
-----------+----------------------+----------
         0 |   133,698      6,936 |   140,634 
           |     95.07       4.93 |    100.00 
-----------+----------------------+----------
         1 |       833         43 |       876 
           |     95.09       4.91 |    100.00 
-----------+----------------------+----------
     Total |   134,531      6,979 |   141,510 
           |     95.07       4.93 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

  Index of |
  Multiple |  Admitted to ITU for
Deprivatio |       Covid-19
   n (IMD) |         0          1 |     Total
-----------+----------------------+----------
         1 |    21,497      1,127 |    22,624 
           |     95.02       4.98 |    100.00 
-----------+----------------------+----------
         2 |    27,958      1,448 |    29,406 
           |     95.08       4.92 |    100.00 
-----------+----------------------+----------
         3 |    27,544      1,366 |    28,910 
           |     95.27       4.73 |    100.00 
-----------+----------------------+----------
         4 |    26,715      1,407 |    28,122 
           |     95.00       5.00 |    100.00 
-----------+----------------------+----------
         5 |    27,162      1,459 |    28,621 
           |     94.90       5.10 |    100.00 
-----------+----------------------+----------
     Total |   130,876      6,807 |   137,683 
           |     95.06       4.94 |    100.00 

. 
. 
. 
. * Close the log file
. log close
      name:  <unnamed>
       log:  /home/app/notebook/analysis/output/an_descriptive_tables.log
  log type:  text
 closed on:  19 Apr 2020, 17:32:59
-------------------------------------------------------------------------------
