---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Github\opencorona-risk-factors-research\analysis\output/an_descriptive_tables.log
  log type:  text
 opened on:  23 Apr 2020, 13:04:21

. 
. use egdata, clear
(Poor factors dummy analysis dataset)

. 
. 
. **********************************
. *  Distribution in whole cohort  *
. **********************************
. 
. 
. * Demographics
. summ age

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |    100,570    55.50364    23.01542         18        105

. tab agegroup

Grouped age |      Freq.     Percent        Cum.
------------+-----------------------------------
     18-<40 |     27,739       27.58       27.58
     40-<50 |     12,100       12.03       39.61
     50-<60 |     22,146       22.02       61.63
     60-<70 |      9,454        9.40       71.03
     70-<80 |      8,345        8.30       79.33
        80+ |     20,786       20.67      100.00
------------+-----------------------------------
      Total |    100,570      100.00

. tab male

       Male |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     55,242       54.93       54.93
          1 |     45,328       45.07      100.00
------------+-----------------------------------
      Total |    100,570      100.00

. tab bmicat

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |        154        1.48        1.48
  Normal (18.5-24.9) |      4,287       41.29       42.78
Overweight (25-29.9) |      3,968       38.22       81.00
   Obese I (30-34.9) |      1,497       14.42       95.42
  Obese II (35-39.9) |        401        3.86       99.28
     Obese III (40+) |         75        0.72      100.00
---------------------+-----------------------------------
               Total |     10,382      100.00

. tab bmicat, m

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |        154        0.15        0.15
  Normal (18.5-24.9) |      4,287        4.26        4.42
Overweight (25-29.9) |      3,968        3.95        8.36
   Obese I (30-34.9) |      1,497        1.49        9.85
  Obese II (35-39.9) |        401        0.40       10.25
     Obese III (40+) |         75        0.07       10.32
        Unknown (.u) |     90,188       89.68      100.00
---------------------+-----------------------------------
               Total |    100,570      100.00

. tab smoke

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
      Former |     12,879       30.65       30.65
     Current |     29,138       69.35      100.00
-------------+-----------------------------------
       Total |     42,017      100.00

. tab smoke, m

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
      Former |     12,879       12.81       12.81
     Current |     29,138       28.97       41.78
Unknown (.u) |     58,553       58.22      100.00
-------------+-----------------------------------
       Total |    100,570      100.00

. 
. * Comorbidities
. tab chronic_respiratory_disease

Respiratory |
    disease |
     (excl. |
    asthma) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     99,913       99.35       99.35
          1 |        657        0.65      100.00
------------+-----------------------------------
      Total |    100,570      100.00

. tab asthma

     Asthma |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    100,521       99.95       99.95
          1 |         49        0.05      100.00
------------+-----------------------------------
      Total |    100,570      100.00

. tab chronic_cardiac_disease

      Heart |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     78,299       77.86       77.86
          1 |     22,271       22.14      100.00
------------+-----------------------------------
      Total |    100,570      100.00

. tab diabetes

   Diabetes |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     72,692       72.28       72.28
          1 |     27,878       27.72      100.00
------------+-----------------------------------
      Total |    100,570      100.00

. tab cancer_exhaem_lastyr

     Cancer |
 other than |
haematologi |
cal in last |
       year |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    100,566      100.00      100.00
          1 |          4        0.00      100.00
------------+-----------------------------------
      Total |    100,570      100.00

. tab haemmalig_aanaem_bmtrans_lastyr

   Haematol |
malignancy, |
   aplastic |
 anaemia or |
bone marrow |
 transplant |
    in last |
       year |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    100,567      100.00      100.00
          1 |          3        0.00      100.00
------------+-----------------------------------
      Total |    100,570      100.00

. tab chronic_liver_disease

    Chronic |
      liver |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     90,509       90.00       90.00
          1 |     10,061       10.00      100.00
------------+-----------------------------------
      Total |    100,570      100.00

. tab other_neuro

      Neuro |
  condition |
 other than |
stroke/deme |
       ntia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    100,291       99.72       99.72
          1 |        279        0.28      100.00
------------+-----------------------------------
      Total |    100,570      100.00

. tab chronic_kidney_disease

     Kidney |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     95,556       95.01       95.01
          1 |      5,014        4.99      100.00
------------+-----------------------------------
      Total |    100,570      100.00

. tab organ_transplant

      Organ |
 transplant |
  recipient |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    100,551       99.98       99.98
          1 |         19        0.02      100.00
------------+-----------------------------------
      Total |    100,570      100.00

. tab chronic_kidney_disease

     Kidney |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     95,556       95.01       95.01
          1 |      5,014        4.99      100.00
------------+-----------------------------------
      Total |    100,570      100.00

. tab organ_transplant

      Organ |
 transplant |
  recipient |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    100,551       99.98       99.98
          1 |         19        0.02      100.00
------------+-----------------------------------
      Total |    100,570      100.00

. tab spleen

     Spleen |
   problems |
(dysplenia, |
     sickle |
      cell) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     90,530       90.02       90.02
          1 |     10,040        9.98      100.00
------------+-----------------------------------
      Total |    100,570      100.00

. tab ra_sle_psoriasis

   RA, SLE, |
  Psoriasis |
(autoimmune |
   disease) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     99,919       99.35       99.35
          1 |        651        0.65      100.00
------------+-----------------------------------
      Total |    100,570      100.00

. tab dementia

   dementia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    100,563       99.99       99.99
          1 |          7        0.01      100.00
------------+-----------------------------------
      Total |    100,570      100.00

. tab stroke

     stroke |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     90,149       89.64       89.64
          1 |     10,421       10.36      100.00
------------+-----------------------------------
      Total |    100,570      100.00

. tab stroke_dementia

  Stroke or |
   dementia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     90,143       89.63       89.63
          1 |     10,427       10.37      100.00
------------+-----------------------------------
      Total |    100,570      100.00

. * tab immunosuppressed
.                                                     
. tab bpcat

 Grouped blood |
      pressure |      Freq.     Percent        Cum.
---------------+-----------------------------------
        Normal |     51,906       51.61       51.61
      Elevated |      5,242        5.21       56.82
 High, stage I |     19,217       19.11       75.93
High, stage II |     24,205       24.07      100.00
---------------+-----------------------------------
         Total |    100,570      100.00

. 
. *summ bp_sys,  detail
. *summ bp_dias, detail
. 
. tab imd 

   Index of |
   Multiple |
Deprivation |
      (IMD) |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     18,628       18.79       18.79
          2 |     19,364       19.53       38.32
          3 |     13,599       13.72       52.04
          4 |     26,850       27.08       79.13
          5 |     20,694       20.87      100.00
------------+-----------------------------------
      Total |     99,135      100.00

. tab imd, m

   Index of |
   Multiple |
Deprivation |
      (IMD) |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     18,628       18.52       18.52
          2 |     19,364       19.25       37.78
          3 |     13,599       13.52       51.30
          4 |     26,850       26.70       78.00
          5 |     20,694       20.58       98.57
    Unknown |      1,435        1.43      100.00
------------+-----------------------------------
      Total |    100,570      100.00

. tab ethnicity

  Ethnicity |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |     10,272       49.90       49.90
South Asian |        164        0.80       50.70
      Black |        100        0.49       51.18
      Other |         24        0.12       51.30
      Mixed |     10,025       48.70      100.00
------------+-----------------------------------
      Total |     20,585      100.00

. tab ethnicity, m

  Ethnicity |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |     10,272       10.21       10.21
South Asian |        164        0.16       10.38
      Black |        100        0.10       10.48
      Other |         24        0.02       10.50
      Mixed |     10,025        9.97       20.47
          . |     79,985       79.53      100.00
------------+-----------------------------------
      Total |    100,570      100.00

. *tab urban
. 
. 
. * Outcomes
. tab onscoviddeath

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
  ONS covid |
      death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    100,569      100.00      100.00
          1 |          1        0.00      100.00
------------+-----------------------------------
      Total |    100,570      100.00

. tab cpnsdeath

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
 CPNS covid |
      death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    100,566      100.00      100.00
          1 |          4        0.00      100.00
------------+-----------------------------------
      Total |    100,570      100.00

. tab ituadmission

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
        ITU |
  admission |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    100,565      100.00      100.00
          1 |          5        0.00      100.00
------------+-----------------------------------
      Total |    100,570      100.00

. * tab ecds
. 
. 
. 
. 
. **********************************
. *  Number (%) with each outcome  *
. **********************************
. 
. foreach outvar of varlist onscoviddeath cpnsdeath ituadmission {
  2. 
. *** Repeat for each outcome
. 
.         * Demographics
.         tab agegroup                                                    `outvar', col
  3.         tab male                                                                `outvar', col
  4.         tab bmicat                                                              `outvar', col m 
  5.         tab smoke                                                               `outvar', col m
  6.         tab obese                                                               `outvar', col m 
  7.         tab current                                                             `outvar', col m
  8. 
.         * Comorbidities
.         tab chronic_respiratory_disease                 `outvar', col
  9.         tab asthma                                                              `outvar', col
 10.         tab chronic_cardiac_disease                     `outvar', col
 11.         tab diabetes                                                    `outvar', col
 12.         tab cancer_exhaem_lastyr                                `outvar', col
 13. 
.         tab haemmalig_aanaem_bmtrans_lastyr     `outvar', col
 14.         tab chronic_liver_disease                               `outvar', col
 15.         tab other_neuro                                                 `outvar', col
 16.         tab chronic_kidney_disease                              `outvar', col
 17.         tab organ_transplant                                    `outvar', col
 18.         tab spleen                                                              `outvar', col
 19.         tab ra_sle_psoriasis                                    `outvar', col
 20.         
.         tab imd                                                                 `outvar', col
 21.         tab ethnicity                                                   `outvar', col m
 22.         *tab urban                                                              `outvar', col
. }

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: ONS covid
   Grouped |         death
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<40 |    27,739          0 |    27,739 
           |     27.58       0.00 |     27.58 
-----------+----------------------+----------
    40-<50 |    12,100          0 |    12,100 
           |     12.03       0.00 |     12.03 
-----------+----------------------+----------
    50-<60 |    22,146          0 |    22,146 
           |     22.02       0.00 |     22.02 
-----------+----------------------+----------
    60-<70 |     9,454          0 |     9,454 
           |      9.40       0.00 |      9.40 
-----------+----------------------+----------
    70-<80 |     8,345          0 |     8,345 
           |      8.30       0.00 |      8.30 
-----------+----------------------+----------
       80+ |    20,785          1 |    20,786 
           |     20.67     100.00 |     20.67 
-----------+----------------------+----------
     Total |   100,569          1 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: ONS covid
           |         death
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |    55,241          1 |    55,242 
           |     54.93     100.00 |     54.93 
-----------+----------------------+----------
         1 |    45,328          0 |    45,328 
           |     45.07       0.00 |     45.07 
-----------+----------------------+----------
     Total |   100,569          1 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |  outcome: ONS covid
                     |         death
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |       154          0 |       154 
                     |      0.15       0.00 |      0.15 
---------------------+----------------------+----------
  Normal (18.5-24.9) |     4,287          0 |     4,287 
                     |      4.26       0.00 |      4.26 
---------------------+----------------------+----------
Overweight (25-29.9) |     3,968          0 |     3,968 
                     |      3.95       0.00 |      3.95 
---------------------+----------------------+----------
   Obese I (30-34.9) |     1,497          0 |     1,497 
                     |      1.49       0.00 |      1.49 
---------------------+----------------------+----------
  Obese II (35-39.9) |       401          0 |       401 
                     |      0.40       0.00 |      0.40 
---------------------+----------------------+----------
     Obese III (40+) |        75          0 |        75 
                     |      0.07       0.00 |      0.07 
---------------------+----------------------+----------
        Unknown (.u) |    90,187          1 |    90,188 
                     |     89.68     100.00 |     89.68 
---------------------+----------------------+----------
               Total |   100,569          1 |   100,570 
                     |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   Failure/censoring
             |     indicator for
             |  outcome: ONS covid
     Smoking |         death
      status |         0          1 |     Total
-------------+----------------------+----------
      Former |    12,879          0 |    12,879 
             |     12.81       0.00 |     12.81 
-------------+----------------------+----------
     Current |    29,138          0 |    29,138 
             |     28.97       0.00 |     28.97 
-------------+----------------------+----------
Unknown (.u) |    58,552          1 |    58,553 
             |     58.22     100.00 |     58.22 
-------------+----------------------+----------
       Total |   100,569          1 |   100,570 
             |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
  Severely |  outcome: ONS covid
obese (cat |         death
        3) |         0          1 |     Total
-----------+----------------------+----------
         0 |   100,494          1 |   100,495 
           |     99.93     100.00 |     99.93 
-----------+----------------------+----------
         1 |        75          0 |        75 
           |      0.07       0.00 |      0.07 
-----------+----------------------+----------
     Total |   100,569          1 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: ONS covid
   Current |         death
    smoker |         0          1 |     Total
-----------+----------------------+----------
         0 |    71,431          1 |    71,432 
           |     71.03     100.00 |     71.03 
-----------+----------------------+----------
         1 |    29,138          0 |    29,138 
           |     28.97       0.00 |     28.97 
-----------+----------------------+----------
     Total |   100,569          1 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
Respirator |     indicator for
 y disease |  outcome: ONS covid
    (excl. |         death
   asthma) |         0          1 |     Total
-----------+----------------------+----------
         0 |    99,912          1 |    99,913 
           |     99.35     100.00 |     99.35 
-----------+----------------------+----------
         1 |       657          0 |       657 
           |      0.65       0.00 |      0.65 
-----------+----------------------+----------
     Total |   100,569          1 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: ONS covid
           |         death
    Asthma |         0          1 |     Total
-----------+----------------------+----------
         0 |   100,520          1 |   100,521 
           |     99.95     100.00 |     99.95 
-----------+----------------------+----------
         1 |        49          0 |        49 
           |      0.05       0.00 |      0.05 
-----------+----------------------+----------
     Total |   100,569          1 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: ONS covid
     Heart |         death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    78,298          1 |    78,299 
           |     77.86     100.00 |     77.86 
-----------+----------------------+----------
         1 |    22,271          0 |    22,271 
           |     22.14       0.00 |     22.14 
-----------+----------------------+----------
     Total |   100,569          1 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: ONS covid
           |         death
  Diabetes |         0          1 |     Total
-----------+----------------------+----------
         0 |    72,691          1 |    72,692 
           |     72.28     100.00 |     72.28 
-----------+----------------------+----------
         1 |    27,878          0 |    27,878 
           |     27.72       0.00 |     27.72 
-----------+----------------------+----------
     Total |   100,569          1 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

    Cancer |   Failure/censoring
other than |     indicator for
haematolog |  outcome: ONS covid
   ical in |         death
 last year |         0          1 |     Total
-----------+----------------------+----------
         0 |   100,565          1 |   100,566 
           |    100.00     100.00 |    100.00 
-----------+----------------------+----------
         1 |         4          0 |         4 
           |      0.00       0.00 |      0.00 
-----------+----------------------+----------
     Total |   100,569          1 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  Haematol |
malignancy |
, aplastic |
anaemia or |
      bone |   Failure/censoring
    marrow |     indicator for
transplant |  outcome: ONS covid
   in last |         death
      year |         0          1 |     Total
-----------+----------------------+----------
         0 |   100,566          1 |   100,567 
           |    100.00     100.00 |    100.00 
-----------+----------------------+----------
         1 |         3          0 |         3 
           |      0.00       0.00 |      0.00 
-----------+----------------------+----------
     Total |   100,569          1 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: ONS covid
     liver |         death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    90,508          1 |    90,509 
           |     90.00     100.00 |     90.00 
-----------+----------------------+----------
         1 |    10,061          0 |    10,061 
           |     10.00       0.00 |     10.00 
-----------+----------------------+----------
     Total |   100,569          1 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

     Neuro |   Failure/censoring
 condition |     indicator for
other than |  outcome: ONS covid
stroke/dem |         death
     entia |         0          1 |     Total
-----------+----------------------+----------
         0 |   100,290          1 |   100,291 
           |     99.72     100.00 |     99.72 
-----------+----------------------+----------
         1 |       279          0 |       279 
           |      0.28       0.00 |      0.28 
-----------+----------------------+----------
     Total |   100,569          1 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: ONS covid
    Kidney |         death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    95,555          1 |    95,556 
           |     95.01     100.00 |     95.01 
-----------+----------------------+----------
         1 |     5,014          0 |     5,014 
           |      4.99       0.00 |      4.99 
-----------+----------------------+----------
     Total |   100,569          1 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
     Organ |  outcome: ONS covid
transplant |         death
 recipient |         0          1 |     Total
-----------+----------------------+----------
         0 |   100,550          1 |   100,551 
           |     99.98     100.00 |     99.98 
-----------+----------------------+----------
         1 |        19          0 |        19 
           |      0.02       0.00 |      0.02 
-----------+----------------------+----------
     Total |   100,569          1 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

    Spleen |   Failure/censoring
  problems |     indicator for
(dysplenia |  outcome: ONS covid
  , sickle |         death
     cell) |         0          1 |     Total
-----------+----------------------+----------
         0 |    90,529          1 |    90,530 
           |     90.02     100.00 |     90.02 
-----------+----------------------+----------
         1 |    10,040          0 |    10,040 
           |      9.98       0.00 |      9.98 
-----------+----------------------+----------
     Total |   100,569          1 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
  RA, SLE, |     indicator for
 Psoriasis |  outcome: ONS covid
(autoimmun |         death
e disease) |         0          1 |     Total
-----------+----------------------+----------
         0 |    99,918          1 |    99,919 
           |     99.35     100.00 |     99.35 
-----------+----------------------+----------
         1 |       651          0 |       651 
           |      0.65       0.00 |      0.65 
-----------+----------------------+----------
     Total |   100,569          1 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
  Index of |     indicator for
  Multiple |  outcome: ONS covid
Deprivatio |         death
   n (IMD) |         0          1 |     Total
-----------+----------------------+----------
         1 |    18,628          0 |    18,628 
           |     18.79       0.00 |     18.79 
-----------+----------------------+----------
         2 |    19,363          1 |    19,364 
           |     19.53     100.00 |     19.53 
-----------+----------------------+----------
         3 |    13,599          0 |    13,599 
           |     13.72       0.00 |     13.72 
-----------+----------------------+----------
         4 |    26,850          0 |    26,850 
           |     27.08       0.00 |     27.08 
-----------+----------------------+----------
         5 |    20,694          0 |    20,694 
           |     20.87       0.00 |     20.87 
-----------+----------------------+----------
     Total |    99,134          1 |    99,135 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

            |   Failure/censoring
            |     indicator for
            |  outcome: ONS covid
            |         death
  Ethnicity |         0          1 |     Total
------------+----------------------+----------
      White |    10,272          0 |    10,272 
            |     10.21       0.00 |     10.21 
------------+----------------------+----------
South Asian |       164          0 |       164 
            |      0.16       0.00 |      0.16 
------------+----------------------+----------
      Black |       100          0 |       100 
            |      0.10       0.00 |      0.10 
------------+----------------------+----------
      Other |        24          0 |        24 
            |      0.02       0.00 |      0.02 
------------+----------------------+----------
      Mixed |    10,025          0 |    10,025 
            |      9.97       0.00 |      9.97 
------------+----------------------+----------
          . |    79,984          1 |    79,985 
            |     79.53     100.00 |     79.53 
------------+----------------------+----------
      Total |   100,569          1 |   100,570 
            |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: CPNS covid
   Grouped |         death
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<40 |    27,737          2 |    27,739 
           |     27.58      50.00 |     27.58 
-----------+----------------------+----------
    40-<50 |    12,099          1 |    12,100 
           |     12.03      25.00 |     12.03 
-----------+----------------------+----------
    50-<60 |    22,145          1 |    22,146 
           |     22.02      25.00 |     22.02 
-----------+----------------------+----------
    60-<70 |     9,454          0 |     9,454 
           |      9.40       0.00 |      9.40 
-----------+----------------------+----------
    70-<80 |     8,345          0 |     8,345 
           |      8.30       0.00 |      8.30 
-----------+----------------------+----------
       80+ |    20,786          0 |    20,786 
           |     20.67       0.00 |     20.67 
-----------+----------------------+----------
     Total |   100,566          4 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: CPNS covid
           |         death
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |    55,238          4 |    55,242 
           |     54.93     100.00 |     54.93 
-----------+----------------------+----------
         1 |    45,328          0 |    45,328 
           |     45.07       0.00 |     45.07 
-----------+----------------------+----------
     Total |   100,566          4 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |  outcome: CPNS covid
                     |         death
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |       154          0 |       154 
                     |      0.15       0.00 |      0.15 
---------------------+----------------------+----------
  Normal (18.5-24.9) |     4,287          0 |     4,287 
                     |      4.26       0.00 |      4.26 
---------------------+----------------------+----------
Overweight (25-29.9) |     3,968          0 |     3,968 
                     |      3.95       0.00 |      3.95 
---------------------+----------------------+----------
   Obese I (30-34.9) |     1,497          0 |     1,497 
                     |      1.49       0.00 |      1.49 
---------------------+----------------------+----------
  Obese II (35-39.9) |       401          0 |       401 
                     |      0.40       0.00 |      0.40 
---------------------+----------------------+----------
     Obese III (40+) |        75          0 |        75 
                     |      0.07       0.00 |      0.07 
---------------------+----------------------+----------
        Unknown (.u) |    90,184          4 |    90,188 
                     |     89.68     100.00 |     89.68 
---------------------+----------------------+----------
               Total |   100,566          4 |   100,570 
                     |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   Failure/censoring
             |     indicator for
             |  outcome: CPNS covid
     Smoking |         death
      status |         0          1 |     Total
-------------+----------------------+----------
      Former |    12,879          0 |    12,879 
             |     12.81       0.00 |     12.81 
-------------+----------------------+----------
     Current |    29,138          0 |    29,138 
             |     28.97       0.00 |     28.97 
-------------+----------------------+----------
Unknown (.u) |    58,549          4 |    58,553 
             |     58.22     100.00 |     58.22 
-------------+----------------------+----------
       Total |   100,566          4 |   100,570 
             |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
  Severely |  outcome: CPNS covid
obese (cat |         death
        3) |         0          1 |     Total
-----------+----------------------+----------
         0 |   100,491          4 |   100,495 
           |     99.93     100.00 |     99.93 
-----------+----------------------+----------
         1 |        75          0 |        75 
           |      0.07       0.00 |      0.07 
-----------+----------------------+----------
     Total |   100,566          4 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: CPNS covid
   Current |         death
    smoker |         0          1 |     Total
-----------+----------------------+----------
         0 |    71,428          4 |    71,432 
           |     71.03     100.00 |     71.03 
-----------+----------------------+----------
         1 |    29,138          0 |    29,138 
           |     28.97       0.00 |     28.97 
-----------+----------------------+----------
     Total |   100,566          4 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
Respirator |     indicator for
 y disease |  outcome: CPNS covid
    (excl. |         death
   asthma) |         0          1 |     Total
-----------+----------------------+----------
         0 |    99,909          4 |    99,913 
           |     99.35     100.00 |     99.35 
-----------+----------------------+----------
         1 |       657          0 |       657 
           |      0.65       0.00 |      0.65 
-----------+----------------------+----------
     Total |   100,566          4 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: CPNS covid
           |         death
    Asthma |         0          1 |     Total
-----------+----------------------+----------
         0 |   100,517          4 |   100,521 
           |     99.95     100.00 |     99.95 
-----------+----------------------+----------
         1 |        49          0 |        49 
           |      0.05       0.00 |      0.05 
-----------+----------------------+----------
     Total |   100,566          4 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: CPNS covid
     Heart |         death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    78,295          4 |    78,299 
           |     77.85     100.00 |     77.86 
-----------+----------------------+----------
         1 |    22,271          0 |    22,271 
           |     22.15       0.00 |     22.14 
-----------+----------------------+----------
     Total |   100,566          4 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: CPNS covid
           |         death
  Diabetes |         0          1 |     Total
-----------+----------------------+----------
         0 |    72,688          4 |    72,692 
           |     72.28     100.00 |     72.28 
-----------+----------------------+----------
         1 |    27,878          0 |    27,878 
           |     27.72       0.00 |     27.72 
-----------+----------------------+----------
     Total |   100,566          4 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

    Cancer |   Failure/censoring
other than |     indicator for
haematolog |  outcome: CPNS covid
   ical in |         death
 last year |         0          1 |     Total
-----------+----------------------+----------
         0 |   100,562          4 |   100,566 
           |    100.00     100.00 |    100.00 
-----------+----------------------+----------
         1 |         4          0 |         4 
           |      0.00       0.00 |      0.00 
-----------+----------------------+----------
     Total |   100,566          4 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  Haematol |
malignancy |
, aplastic |
anaemia or |
      bone |   Failure/censoring
    marrow |     indicator for
transplant |  outcome: CPNS covid
   in last |         death
      year |         0          1 |     Total
-----------+----------------------+----------
         0 |   100,563          4 |   100,567 
           |    100.00     100.00 |    100.00 
-----------+----------------------+----------
         1 |         3          0 |         3 
           |      0.00       0.00 |      0.00 
-----------+----------------------+----------
     Total |   100,566          4 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: CPNS covid
     liver |         death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    90,505          4 |    90,509 
           |     90.00     100.00 |     90.00 
-----------+----------------------+----------
         1 |    10,061          0 |    10,061 
           |     10.00       0.00 |     10.00 
-----------+----------------------+----------
     Total |   100,566          4 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

     Neuro |   Failure/censoring
 condition |     indicator for
other than |  outcome: CPNS covid
stroke/dem |         death
     entia |         0          1 |     Total
-----------+----------------------+----------
         0 |   100,287          4 |   100,291 
           |     99.72     100.00 |     99.72 
-----------+----------------------+----------
         1 |       279          0 |       279 
           |      0.28       0.00 |      0.28 
-----------+----------------------+----------
     Total |   100,566          4 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: CPNS covid
    Kidney |         death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    95,552          4 |    95,556 
           |     95.01     100.00 |     95.01 
-----------+----------------------+----------
         1 |     5,014          0 |     5,014 
           |      4.99       0.00 |      4.99 
-----------+----------------------+----------
     Total |   100,566          4 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
     Organ |  outcome: CPNS covid
transplant |         death
 recipient |         0          1 |     Total
-----------+----------------------+----------
         0 |   100,547          4 |   100,551 
           |     99.98     100.00 |     99.98 
-----------+----------------------+----------
         1 |        19          0 |        19 
           |      0.02       0.00 |      0.02 
-----------+----------------------+----------
     Total |   100,566          4 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

    Spleen |   Failure/censoring
  problems |     indicator for
(dysplenia |  outcome: CPNS covid
  , sickle |         death
     cell) |         0          1 |     Total
-----------+----------------------+----------
         0 |    90,526          4 |    90,530 
           |     90.02     100.00 |     90.02 
-----------+----------------------+----------
         1 |    10,040          0 |    10,040 
           |      9.98       0.00 |      9.98 
-----------+----------------------+----------
     Total |   100,566          4 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
  RA, SLE, |     indicator for
 Psoriasis |  outcome: CPNS covid
(autoimmun |         death
e disease) |         0          1 |     Total
-----------+----------------------+----------
         0 |    99,915          4 |    99,919 
           |     99.35     100.00 |     99.35 
-----------+----------------------+----------
         1 |       651          0 |       651 
           |      0.65       0.00 |      0.65 
-----------+----------------------+----------
     Total |   100,566          4 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
  Index of |     indicator for
  Multiple |  outcome: CPNS covid
Deprivatio |         death
   n (IMD) |         0          1 |     Total
-----------+----------------------+----------
         1 |    18,628          0 |    18,628 
           |     18.79       0.00 |     18.79 
-----------+----------------------+----------
         2 |    19,361          3 |    19,364 
           |     19.53      75.00 |     19.53 
-----------+----------------------+----------
         3 |    13,598          1 |    13,599 
           |     13.72      25.00 |     13.72 
-----------+----------------------+----------
         4 |    26,850          0 |    26,850 
           |     27.09       0.00 |     27.08 
-----------+----------------------+----------
         5 |    20,694          0 |    20,694 
           |     20.88       0.00 |     20.87 
-----------+----------------------+----------
     Total |    99,131          4 |    99,135 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

            |   Failure/censoring
            |     indicator for
            |  outcome: CPNS covid
            |         death
  Ethnicity |         0          1 |     Total
------------+----------------------+----------
      White |    10,272          0 |    10,272 
            |     10.21       0.00 |     10.21 
------------+----------------------+----------
South Asian |       164          0 |       164 
            |      0.16       0.00 |      0.16 
------------+----------------------+----------
      Black |       100          0 |       100 
            |      0.10       0.00 |      0.10 
------------+----------------------+----------
      Other |        24          0 |        24 
            |      0.02       0.00 |      0.02 
------------+----------------------+----------
      Mixed |    10,025          0 |    10,025 
            |      9.97       0.00 |      9.97 
------------+----------------------+----------
          . |    79,981          4 |    79,985 
            |     79.53     100.00 |     79.53 
------------+----------------------+----------
      Total |   100,566          4 |   100,570 
            |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |     outcome: ITU
   Grouped |       admission
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<40 |    27,736          3 |    27,739 
           |     27.58      60.00 |     27.58 
-----------+----------------------+----------
    40-<50 |    12,099          1 |    12,100 
           |     12.03      20.00 |     12.03 
-----------+----------------------+----------
    50-<60 |    22,146          0 |    22,146 
           |     22.02       0.00 |     22.02 
-----------+----------------------+----------
    60-<70 |     9,454          0 |     9,454 
           |      9.40       0.00 |      9.40 
-----------+----------------------+----------
    70-<80 |     8,345          0 |     8,345 
           |      8.30       0.00 |      8.30 
-----------+----------------------+----------
       80+ |    20,785          1 |    20,786 
           |     20.67      20.00 |     20.67 
-----------+----------------------+----------
     Total |   100,565          5 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |     outcome: ITU
           |       admission
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |    55,241          1 |    55,242 
           |     54.93      20.00 |     54.93 
-----------+----------------------+----------
         1 |    45,324          4 |    45,328 
           |     45.07      80.00 |     45.07 
-----------+----------------------+----------
     Total |   100,565          5 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |     outcome: ITU
                     |       admission
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |       154          0 |       154 
                     |      0.15       0.00 |      0.15 
---------------------+----------------------+----------
  Normal (18.5-24.9) |     4,287          0 |     4,287 
                     |      4.26       0.00 |      4.26 
---------------------+----------------------+----------
Overweight (25-29.9) |     3,967          1 |     3,968 
                     |      3.94      20.00 |      3.95 
---------------------+----------------------+----------
   Obese I (30-34.9) |     1,497          0 |     1,497 
                     |      1.49       0.00 |      1.49 
---------------------+----------------------+----------
  Obese II (35-39.9) |       401          0 |       401 
                     |      0.40       0.00 |      0.40 
---------------------+----------------------+----------
     Obese III (40+) |        75          0 |        75 
                     |      0.07       0.00 |      0.07 
---------------------+----------------------+----------
        Unknown (.u) |    90,184          4 |    90,188 
                     |     89.68      80.00 |     89.68 
---------------------+----------------------+----------
               Total |   100,565          5 |   100,570 
                     |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   Failure/censoring
             |     indicator for
             |     outcome: ITU
     Smoking |       admission
      status |         0          1 |     Total
-------------+----------------------+----------
      Former |    12,879          0 |    12,879 
             |     12.81       0.00 |     12.81 
-------------+----------------------+----------
     Current |    29,136          2 |    29,138 
             |     28.97      40.00 |     28.97 
-------------+----------------------+----------
Unknown (.u) |    58,550          3 |    58,553 
             |     58.22      60.00 |     58.22 
-------------+----------------------+----------
       Total |   100,565          5 |   100,570 
             |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
  Severely |     outcome: ITU
obese (cat |       admission
        3) |         0          1 |     Total
-----------+----------------------+----------
         0 |   100,490          5 |   100,495 
           |     99.93     100.00 |     99.93 
-----------+----------------------+----------
         1 |        75          0 |        75 
           |      0.07       0.00 |      0.07 
-----------+----------------------+----------
     Total |   100,565          5 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |     outcome: ITU
   Current |       admission
    smoker |         0          1 |     Total
-----------+----------------------+----------
         0 |    71,429          3 |    71,432 
           |     71.03      60.00 |     71.03 
-----------+----------------------+----------
         1 |    29,136          2 |    29,138 
           |     28.97      40.00 |     28.97 
-----------+----------------------+----------
     Total |   100,565          5 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
Respirator |     indicator for
 y disease |     outcome: ITU
    (excl. |       admission
   asthma) |         0          1 |     Total
-----------+----------------------+----------
         0 |    99,908          5 |    99,913 
           |     99.35     100.00 |     99.35 
-----------+----------------------+----------
         1 |       657          0 |       657 
           |      0.65       0.00 |      0.65 
-----------+----------------------+----------
     Total |   100,565          5 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |     outcome: ITU
           |       admission
    Asthma |         0          1 |     Total
-----------+----------------------+----------
         0 |   100,516          5 |   100,521 
           |     99.95     100.00 |     99.95 
-----------+----------------------+----------
         1 |        49          0 |        49 
           |      0.05       0.00 |      0.05 
-----------+----------------------+----------
     Total |   100,565          5 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |     outcome: ITU
     Heart |       admission
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    78,296          3 |    78,299 
           |     77.86      60.00 |     77.86 
-----------+----------------------+----------
         1 |    22,269          2 |    22,271 
           |     22.14      40.00 |     22.14 
-----------+----------------------+----------
     Total |   100,565          5 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |     outcome: ITU
           |       admission
  Diabetes |         0          1 |     Total
-----------+----------------------+----------
         0 |    72,688          4 |    72,692 
           |     72.28      80.00 |     72.28 
-----------+----------------------+----------
         1 |    27,877          1 |    27,878 
           |     27.72      20.00 |     27.72 
-----------+----------------------+----------
     Total |   100,565          5 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

    Cancer |   Failure/censoring
other than |     indicator for
haematolog |     outcome: ITU
   ical in |       admission
 last year |         0          1 |     Total
-----------+----------------------+----------
         0 |   100,561          5 |   100,566 
           |    100.00     100.00 |    100.00 
-----------+----------------------+----------
         1 |         4          0 |         4 
           |      0.00       0.00 |      0.00 
-----------+----------------------+----------
     Total |   100,565          5 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  Haematol |
malignancy |
, aplastic |
anaemia or |
      bone |   Failure/censoring
    marrow |     indicator for
transplant |     outcome: ITU
   in last |       admission
      year |         0          1 |     Total
-----------+----------------------+----------
         0 |   100,562          5 |   100,567 
           |    100.00     100.00 |    100.00 
-----------+----------------------+----------
         1 |         3          0 |         3 
           |      0.00       0.00 |      0.00 
-----------+----------------------+----------
     Total |   100,565          5 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |     outcome: ITU
     liver |       admission
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    90,504          5 |    90,509 
           |     90.00     100.00 |     90.00 
-----------+----------------------+----------
         1 |    10,061          0 |    10,061 
           |     10.00       0.00 |     10.00 
-----------+----------------------+----------
     Total |   100,565          5 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

     Neuro |   Failure/censoring
 condition |     indicator for
other than |     outcome: ITU
stroke/dem |       admission
     entia |         0          1 |     Total
-----------+----------------------+----------
         0 |   100,286          5 |   100,291 
           |     99.72     100.00 |     99.72 
-----------+----------------------+----------
         1 |       279          0 |       279 
           |      0.28       0.00 |      0.28 
-----------+----------------------+----------
     Total |   100,565          5 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |     outcome: ITU
    Kidney |       admission
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    95,551          5 |    95,556 
           |     95.01     100.00 |     95.01 
-----------+----------------------+----------
         1 |     5,014          0 |     5,014 
           |      4.99       0.00 |      4.99 
-----------+----------------------+----------
     Total |   100,565          5 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
     Organ |     outcome: ITU
transplant |       admission
 recipient |         0          1 |     Total
-----------+----------------------+----------
         0 |   100,546          5 |   100,551 
           |     99.98     100.00 |     99.98 
-----------+----------------------+----------
         1 |        19          0 |        19 
           |      0.02       0.00 |      0.02 
-----------+----------------------+----------
     Total |   100,565          5 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

    Spleen |   Failure/censoring
  problems |     indicator for
(dysplenia |     outcome: ITU
  , sickle |       admission
     cell) |         0          1 |     Total
-----------+----------------------+----------
         0 |    90,525          5 |    90,530 
           |     90.02     100.00 |     90.02 
-----------+----------------------+----------
         1 |    10,040          0 |    10,040 
           |      9.98       0.00 |      9.98 
-----------+----------------------+----------
     Total |   100,565          5 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
  RA, SLE, |     indicator for
 Psoriasis |     outcome: ITU
(autoimmun |       admission
e disease) |         0          1 |     Total
-----------+----------------------+----------
         0 |    99,914          5 |    99,919 
           |     99.35     100.00 |     99.35 
-----------+----------------------+----------
         1 |       651          0 |       651 
           |      0.65       0.00 |      0.65 
-----------+----------------------+----------
     Total |   100,565          5 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
  Index of |     indicator for
  Multiple |     outcome: ITU
Deprivatio |       admission
   n (IMD) |         0          1 |     Total
-----------+----------------------+----------
         1 |    18,628          0 |    18,628 
           |     18.79       0.00 |     18.79 
-----------+----------------------+----------
         2 |    19,364          0 |    19,364 
           |     19.53       0.00 |     19.53 
-----------+----------------------+----------
         3 |    13,599          0 |    13,599 
           |     13.72       0.00 |     13.72 
-----------+----------------------+----------
         4 |    26,847          3 |    26,850 
           |     27.08      60.00 |     27.08 
-----------+----------------------+----------
         5 |    20,692          2 |    20,694 
           |     20.87      40.00 |     20.87 
-----------+----------------------+----------
     Total |    99,130          5 |    99,135 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

            |   Failure/censoring
            |     indicator for
            |     outcome: ITU
            |       admission
  Ethnicity |         0          1 |     Total
------------+----------------------+----------
      White |    10,272          0 |    10,272 
            |     10.21       0.00 |     10.21 
------------+----------------------+----------
South Asian |       164          0 |       164 
            |      0.16       0.00 |      0.16 
------------+----------------------+----------
      Black |       100          0 |       100 
            |      0.10       0.00 |      0.10 
------------+----------------------+----------
      Other |        24          0 |        24 
            |      0.02       0.00 |      0.02 
------------+----------------------+----------
      Mixed |    10,025          0 |    10,025 
            |      9.97       0.00 |      9.97 
------------+----------------------+----------
          . |    79,980          5 |    79,985 
            |     79.53     100.00 |     79.53 
------------+----------------------+----------
      Total |   100,565          5 |   100,570 
            |    100.00     100.00 |    100.00 

. 
. 
. 
. * Close the log file
. log close
      name:  <unnamed>
       log:  C:\Github\opencorona-risk-factors-research\analysis\output/an_descriptive_tables.log
  log type:  text
 closed on:  23 Apr 2020, 13:04:22
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
