---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Github\opencorona-risk-factors-research\analysis\output/an_descriptive_tables.log
  log type:  text
 opened on:  23 Apr 2020, 12:23:40

. 
. use egdata, clear
(Poor factors dummy analysis dataset)

. 
. 
. **********************************
. *  Distribution in whole cohort  *
. **********************************
. 
. 
. * Demographics
. summ age

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |    100,570    55.50364    23.01542         18        105

. tab agegroup

Grouped age |      Freq.     Percent        Cum.
------------+-----------------------------------
     18-<40 |     27,739       27.58       27.58
     40-<50 |     12,100       12.03       39.61
     50-<60 |     22,146       22.02       61.63
     60-<70 |      9,454        9.40       71.03
     70-<80 |      8,345        8.30       79.33
        80+ |     20,786       20.67      100.00
------------+-----------------------------------
      Total |    100,570      100.00

. tab male

       Male |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     55,242       54.93       54.93
          1 |     45,328       45.07      100.00
------------+-----------------------------------
      Total |    100,570      100.00

. tab bmicat

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |     15,066       14.98       14.98
  Normal (18.5-24.9) |     19,228       19.12       34.10
Overweight (25-29.9) |     19,002       18.89       52.99
   Obese I (30-34.9) |     16,730       16.64       69.63
  Obese II (35-39.9) |     15,407       15.32       84.95
     Obese III (40+) |     15,137       15.05      100.00
---------------------+-----------------------------------
               Total |    100,570      100.00

. tab bmicat, m

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |     15,066       14.98       14.98
  Normal (18.5-24.9) |     19,228       19.12       34.10
Overweight (25-29.9) |     19,002       18.89       52.99
   Obese I (30-34.9) |     16,730       16.64       69.63
  Obese II (35-39.9) |     15,407       15.32       84.95
     Obese III (40+) |     15,137       15.05      100.00
---------------------+-----------------------------------
               Total |    100,570      100.00

. tab smoke

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |     29,262       41.05       41.05
      Former |     12,879       18.07       59.12
     Current |     29,138       40.88      100.00
-------------+-----------------------------------
       Total |     71,279      100.00

. tab smoke, m

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |     29,262       29.10       29.10
      Former |     12,879       12.81       41.90
     Current |     29,138       28.97       70.88
Unknown (.u) |     29,291       29.12      100.00
-------------+-----------------------------------
       Total |    100,570      100.00

. 
. * Comorbidities
. tab chronic_respiratory_disease

Respiratory |
    disease |
     (excl. |
    asthma) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     99,913       99.35       99.35
          1 |        657        0.65      100.00
------------+-----------------------------------
      Total |    100,570      100.00

. tab asthma

     Asthma |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    100,521       99.95       99.95
          1 |         49        0.05      100.00
------------+-----------------------------------
      Total |    100,570      100.00

. tab chronic_cardiac_disease

      Heart |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     78,299       77.86       77.86
          1 |     22,271       22.14      100.00
------------+-----------------------------------
      Total |    100,570      100.00

. tab diabetes

   Diabetes |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     72,692       72.28       72.28
          1 |     27,878       27.72      100.00
------------+-----------------------------------
      Total |    100,570      100.00

. tab cancer_exhaem_lastyr

     Cancer |
 other than |
haematologi |
cal in last |
       year |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     80,296       79.84       79.84
          1 |     20,274       20.16      100.00
------------+-----------------------------------
      Total |    100,570      100.00

. tab haemmalig_aanaem_bmtrans_lastyr

   Haematol |
malignancy, |
   aplastic |
 anaemia or |
bone marrow |
 transplant |
    in last |
       year |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     80,537       80.08       80.08
          1 |     20,033       19.92      100.00
------------+-----------------------------------
      Total |    100,570      100.00

. tab chronic_liver_disease

    Chronic |
      liver |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     90,509       90.00       90.00
          1 |     10,061       10.00      100.00
------------+-----------------------------------
      Total |    100,570      100.00

. tab other_neuro

      Neuro |
  condition |
 other than |
stroke/deme |
       ntia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    100,291       99.72       99.72
          1 |        279        0.28      100.00
------------+-----------------------------------
      Total |    100,570      100.00

. tab chronic_kidney_disease

     Kidney |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     95,556       95.01       95.01
          1 |      5,014        4.99      100.00
------------+-----------------------------------
      Total |    100,570      100.00

. tab organ_transplant

      Organ |
 transplant |
  recipient |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     95,524       94.98       94.98
          1 |      5,046        5.02      100.00
------------+-----------------------------------
      Total |    100,570      100.00

. tab chronic_kidney_disease

     Kidney |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     95,556       95.01       95.01
          1 |      5,014        4.99      100.00
------------+-----------------------------------
      Total |    100,570      100.00

. tab organ_transplant

      Organ |
 transplant |
  recipient |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     95,524       94.98       94.98
          1 |      5,046        5.02      100.00
------------+-----------------------------------
      Total |    100,570      100.00

. tab spleen

     Spleen |
   problems |
(dysplenia, |
     sickle |
      cell) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     90,530       90.02       90.02
          1 |     10,040        9.98      100.00
------------+-----------------------------------
      Total |    100,570      100.00

. tab ra_sle_psoriasis

   RA, SLE, |
  Psoriasis |
(autoimmune |
   disease) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     99,919       99.35       99.35
          1 |        651        0.65      100.00
------------+-----------------------------------
      Total |    100,570      100.00

. tab dementia

   dementia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    100,563       99.99       99.99
          1 |          7        0.01      100.00
------------+-----------------------------------
      Total |    100,570      100.00

. tab stroke

     stroke |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     90,149       89.64       89.64
          1 |     10,421       10.36      100.00
------------+-----------------------------------
      Total |    100,570      100.00

. tab stroke_dementia

  Stroke or |
   dementia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     90,143       89.63       89.63
          1 |     10,427       10.37      100.00
------------+-----------------------------------
      Total |    100,570      100.00

. * tab immunosuppressed
.                                                     
. tab bpcat

 Grouped blood |
      pressure |      Freq.     Percent        Cum.
---------------+-----------------------------------
        Normal |     51,906       51.61       51.61
      Elevated |      5,242        5.21       56.82
 High, stage I |     19,217       19.11       75.93
High, stage II |     24,205       24.07      100.00
---------------+-----------------------------------
         Total |    100,570      100.00

. 
. *summ bp_sys,  detail
. *summ bp_dias, detail
. 
. tab imd 

   Index of |
   Multiple |
Deprivation |
      (IMD) |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     18,628       18.79       18.79
          2 |     19,364       19.53       38.32
          3 |     13,599       13.72       52.04
          4 |     26,850       27.08       79.13
          5 |     20,694       20.87      100.00
------------+-----------------------------------
      Total |     99,135      100.00

. tab imd, m

   Index of |
   Multiple |
Deprivation |
      (IMD) |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     18,628       18.52       18.52
          2 |     19,364       19.25       37.78
          3 |     13,599       13.52       51.30
          4 |     26,850       26.70       78.00
          5 |     20,694       20.58       98.57
    Unknown |      1,435        1.43      100.00
------------+-----------------------------------
      Total |    100,570      100.00

. tab ethnicity

  Ethnicity |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |     10,272       49.90       49.90
South Asian |        164        0.80       50.70
      Black |        100        0.49       51.18
      Other |         24        0.12       51.30
      Mixed |     10,025       48.70      100.00
------------+-----------------------------------
      Total |     20,585      100.00

. tab ethnicity, m

  Ethnicity |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |     10,272       10.21       10.21
South Asian |        164        0.16       10.38
      Black |        100        0.10       10.48
      Other |         24        0.02       10.50
      Mixed |     10,025        9.97       20.47
          . |     79,985       79.53      100.00
------------+-----------------------------------
      Total |    100,570      100.00

. *tab urban
. 
. 
. * Outcomes
. tab onscoviddeath

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
  ONS covid |
      death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     80,529       80.07       80.07
          1 |     20,041       19.93      100.00
------------+-----------------------------------
      Total |    100,570      100.00

. tab cpnsdeath

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
 CPNS covid |
      death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     80,304       79.85       79.85
          1 |     20,266       20.15      100.00
------------+-----------------------------------
      Total |    100,570      100.00

. tab ituadmission

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
        ITU |
  admission |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     80,368       79.91       79.91
          1 |     20,202       20.09      100.00
------------+-----------------------------------
      Total |    100,570      100.00

. * tab ecds
. 
. 
. 
. 
. **********************************
. *  Number (%) with each outcome  *
. **********************************
. 
. foreach outvar of varlist onscoviddeath cpnsdeath ituadmission {
  2. 
. *** Repeat for each outcome
. 
.         * Demographics
.         tab agegroup                                                    `outvar', col
  3.         tab male                                                                `outvar', col
  4.         tab bmicat                                                              `outvar', col m 
  5.         tab smoke                                                               `outvar', col m
  6.         tab obese                                                               `outvar', col m 
  7.         tab current                                                             `outvar', col m
  8. 
.         * Comorbidities
.         tab chronic_respiratory_disease                 `outvar', col
  9.         tab asthma                                                              `outvar', col
 10.         tab chronic_cardiac_disease                     `outvar', col
 11.         tab diabetes                                                    `outvar', col
 12.         tab cancer_exhaem_lastyr                                `outvar', col
 13. 
.         tab haemmalig_aanaem_bmtrans_lastyr     `outvar', col
 14.         tab chronic_liver_disease                               `outvar', col
 15.         tab other_neuro                                                 `outvar', col
 16.         tab chronic_kidney_disease                              `outvar', col
 17.         tab organ_transplant                                    `outvar', col
 18.         tab spleen                                                              `outvar', col
 19.         tab ra_sle_psoriasis                                    `outvar', col
 20.         
.         tab imd                                                                 `outvar', col
 21.         tab ethnicity                                                   `outvar', col m
 22.         *tab urban                                                              `outvar', col
. }

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: ONS covid
   Grouped |         death
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<40 |    22,247      5,492 |    27,739 
           |     27.63      27.40 |     27.58 
-----------+----------------------+----------
    40-<50 |     9,682      2,418 |    12,100 
           |     12.02      12.07 |     12.03 
-----------+----------------------+----------
    50-<60 |    17,751      4,395 |    22,146 
           |     22.04      21.93 |     22.02 
-----------+----------------------+----------
    60-<70 |     7,468      1,986 |     9,454 
           |      9.27       9.91 |      9.40 
-----------+----------------------+----------
    70-<80 |     6,680      1,665 |     8,345 
           |      8.30       8.31 |      8.30 
-----------+----------------------+----------
       80+ |    16,701      4,085 |    20,786 
           |     20.74      20.38 |     20.67 
-----------+----------------------+----------
     Total |    80,529     20,041 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: ONS covid
           |         death
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |    44,202     11,040 |    55,242 
           |     54.89      55.09 |     54.93 
-----------+----------------------+----------
         1 |    36,327      9,001 |    45,328 
           |     45.11      44.91 |     45.07 
-----------+----------------------+----------
     Total |    80,529     20,041 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |  outcome: ONS covid
                     |         death
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |    12,127      2,939 |    15,066 
                     |     15.06      14.66 |     14.98 
---------------------+----------------------+----------
  Normal (18.5-24.9) |    15,415      3,813 |    19,228 
                     |     19.14      19.03 |     19.12 
---------------------+----------------------+----------
Overweight (25-29.9) |    15,227      3,775 |    19,002 
                     |     18.91      18.84 |     18.89 
---------------------+----------------------+----------
   Obese I (30-34.9) |    13,340      3,390 |    16,730 
                     |     16.57      16.92 |     16.64 
---------------------+----------------------+----------
  Obese II (35-39.9) |    12,335      3,072 |    15,407 
                     |     15.32      15.33 |     15.32 
---------------------+----------------------+----------
     Obese III (40+) |    12,085      3,052 |    15,137 
                     |     15.01      15.23 |     15.05 
---------------------+----------------------+----------
               Total |    80,529     20,041 |   100,570 
                     |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   Failure/censoring
             |     indicator for
             |  outcome: ONS covid
     Smoking |         death
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |    23,420      5,842 |    29,262 
             |     29.08      29.15 |     29.10 
-------------+----------------------+----------
      Former |    10,314      2,565 |    12,879 
             |     12.81      12.80 |     12.81 
-------------+----------------------+----------
     Current |    23,382      5,756 |    29,138 
             |     29.04      28.72 |     28.97 
-------------+----------------------+----------
Unknown (.u) |    23,413      5,878 |    29,291 
             |     29.07      29.33 |     29.12 
-------------+----------------------+----------
       Total |    80,529     20,041 |   100,570 
             |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
  Severely |  outcome: ONS covid
obese (cat |         death
        3) |         0          1 |     Total
-----------+----------------------+----------
         0 |    80,466     20,029 |   100,495 
           |     99.92      99.94 |     99.93 
-----------+----------------------+----------
         1 |        63         12 |        75 
           |      0.08       0.06 |      0.07 
-----------+----------------------+----------
     Total |    80,529     20,041 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
 RECODE of |     indicator for
     smoke |  outcome: ONS covid
  (Smoking |         death
   status) |         0          1 |     Total
-----------+----------------------+----------
         0 |    57,147     14,285 |    71,432 
           |     70.96      71.28 |     71.03 
-----------+----------------------+----------
         1 |    23,382      5,756 |    29,138 
           |     29.04      28.72 |     28.97 
-----------+----------------------+----------
     Total |    80,529     20,041 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
Respirator |     indicator for
 y disease |  outcome: ONS covid
    (excl. |         death
   asthma) |         0          1 |     Total
-----------+----------------------+----------
         0 |    79,997     19,916 |    99,913 
           |     99.34      99.38 |     99.35 
-----------+----------------------+----------
         1 |       532        125 |       657 
           |      0.66       0.62 |      0.65 
-----------+----------------------+----------
     Total |    80,529     20,041 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: ONS covid
           |         death
    Asthma |         0          1 |     Total
-----------+----------------------+----------
         0 |    80,484     20,037 |   100,521 
           |     99.94      99.98 |     99.95 
-----------+----------------------+----------
         1 |        45          4 |        49 
           |      0.06       0.02 |      0.05 
-----------+----------------------+----------
     Total |    80,529     20,041 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: ONS covid
     Heart |         death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    62,758     15,541 |    78,299 
           |     77.93      77.55 |     77.86 
-----------+----------------------+----------
         1 |    17,771      4,500 |    22,271 
           |     22.07      22.45 |     22.14 
-----------+----------------------+----------
     Total |    80,529     20,041 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: ONS covid
           |         death
  Diabetes |         0          1 |     Total
-----------+----------------------+----------
         0 |    58,235     14,457 |    72,692 
           |     72.32      72.14 |     72.28 
-----------+----------------------+----------
         1 |    22,294      5,584 |    27,878 
           |     27.68      27.86 |     27.72 
-----------+----------------------+----------
     Total |    80,529     20,041 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

    Cancer |   Failure/censoring
other than |     indicator for
haematolog |  outcome: ONS covid
   ical in |         death
 last year |         0          1 |     Total
-----------+----------------------+----------
         0 |    64,298     15,998 |    80,296 
           |     79.84      79.83 |     79.84 
-----------+----------------------+----------
         1 |    16,231      4,043 |    20,274 
           |     20.16      20.17 |     20.16 
-----------+----------------------+----------
     Total |    80,529     20,041 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  Haematol |
malignancy |
, aplastic |
anaemia or |
      bone |   Failure/censoring
    marrow |     indicator for
transplant |  outcome: ONS covid
   in last |         death
      year |         0          1 |     Total
-----------+----------------------+----------
         0 |    64,473     16,064 |    80,537 
           |     80.06      80.16 |     80.08 
-----------+----------------------+----------
         1 |    16,056      3,977 |    20,033 
           |     19.94      19.84 |     19.92 
-----------+----------------------+----------
     Total |    80,529     20,041 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: ONS covid
     liver |         death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    72,518     17,991 |    90,509 
           |     90.05      89.77 |     90.00 
-----------+----------------------+----------
         1 |     8,011      2,050 |    10,061 
           |      9.95      10.23 |     10.00 
-----------+----------------------+----------
     Total |    80,529     20,041 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

     Neuro |   Failure/censoring
 condition |     indicator for
other than |  outcome: ONS covid
stroke/dem |         death
     entia |         0          1 |     Total
-----------+----------------------+----------
         0 |    80,309     19,982 |   100,291 
           |     99.73      99.71 |     99.72 
-----------+----------------------+----------
         1 |       220         59 |       279 
           |      0.27       0.29 |      0.28 
-----------+----------------------+----------
     Total |    80,529     20,041 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: ONS covid
    Kidney |         death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    76,491     19,065 |    95,556 
           |     94.99      95.13 |     95.01 
-----------+----------------------+----------
         1 |     4,038        976 |     5,014 
           |      5.01       4.87 |      4.99 
-----------+----------------------+----------
     Total |    80,529     20,041 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
     Organ |  outcome: ONS covid
transplant |         death
 recipient |         0          1 |     Total
-----------+----------------------+----------
         0 |    76,459     19,065 |    95,524 
           |     94.95      95.13 |     94.98 
-----------+----------------------+----------
         1 |     4,070        976 |     5,046 
           |      5.05       4.87 |      5.02 
-----------+----------------------+----------
     Total |    80,529     20,041 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

    Spleen |   Failure/censoring
  problems |     indicator for
(dysplenia |  outcome: ONS covid
  , sickle |         death
     cell) |         0          1 |     Total
-----------+----------------------+----------
         0 |    72,507     18,023 |    90,530 
           |     90.04      89.93 |     90.02 
-----------+----------------------+----------
         1 |     8,022      2,018 |    10,040 
           |      9.96      10.07 |      9.98 
-----------+----------------------+----------
     Total |    80,529     20,041 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
  RA, SLE, |     indicator for
 Psoriasis |  outcome: ONS covid
(autoimmun |         death
e disease) |         0          1 |     Total
-----------+----------------------+----------
         0 |    80,011     19,908 |    99,919 
           |     99.36      99.34 |     99.35 
-----------+----------------------+----------
         1 |       518        133 |       651 
           |      0.64       0.66 |      0.65 
-----------+----------------------+----------
     Total |    80,529     20,041 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
  Index of |     indicator for
  Multiple |  outcome: ONS covid
Deprivatio |         death
   n (IMD) |         0          1 |     Total
-----------+----------------------+----------
         1 |    14,881      3,747 |    18,628 
           |     18.75      18.96 |     18.79 
-----------+----------------------+----------
         2 |    15,482      3,882 |    19,364 
           |     19.51      19.64 |     19.53 
-----------+----------------------+----------
         3 |    10,903      2,696 |    13,599 
           |     13.74      13.64 |     13.72 
-----------+----------------------+----------
         4 |    21,536      5,314 |    26,850 
           |     27.13      26.89 |     27.08 
-----------+----------------------+----------
         5 |    16,569      4,125 |    20,694 
           |     20.88      20.87 |     20.87 
-----------+----------------------+----------
     Total |    79,371     19,764 |    99,135 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

            |   Failure/censoring
            |     indicator for
            |  outcome: ONS covid
            |         death
  Ethnicity |         0          1 |     Total
------------+----------------------+----------
      White |     8,228      2,044 |    10,272 
            |     10.22      10.20 |     10.21 
------------+----------------------+----------
South Asian |       132         32 |       164 
            |      0.16       0.16 |      0.16 
------------+----------------------+----------
      Black |        78         22 |       100 
            |      0.10       0.11 |      0.10 
------------+----------------------+----------
      Other |        18          6 |        24 
            |      0.02       0.03 |      0.02 
------------+----------------------+----------
      Mixed |     7,986      2,039 |    10,025 
            |      9.92      10.17 |      9.97 
------------+----------------------+----------
          . |    64,087     15,898 |    79,985 
            |     79.58      79.33 |     79.53 
------------+----------------------+----------
      Total |    80,529     20,041 |   100,570 
            |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: CPNS covid
   Grouped |         death
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<40 |    22,293      5,446 |    27,739 
           |     27.76      26.87 |     27.58 
-----------+----------------------+----------
    40-<50 |     9,617      2,483 |    12,100 
           |     11.98      12.25 |     12.03 
-----------+----------------------+----------
    50-<60 |    17,608      4,538 |    22,146 
           |     21.93      22.39 |     22.02 
-----------+----------------------+----------
    60-<70 |     7,625      1,829 |     9,454 
           |      9.50       9.02 |      9.40 
-----------+----------------------+----------
    70-<80 |     6,666      1,679 |     8,345 
           |      8.30       8.28 |      8.30 
-----------+----------------------+----------
       80+ |    16,495      4,291 |    20,786 
           |     20.54      21.17 |     20.67 
-----------+----------------------+----------
     Total |    80,304     20,266 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: CPNS covid
           |         death
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |    44,149     11,093 |    55,242 
           |     54.98      54.74 |     54.93 
-----------+----------------------+----------
         1 |    36,155      9,173 |    45,328 
           |     45.02      45.26 |     45.07 
-----------+----------------------+----------
     Total |    80,304     20,266 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |  outcome: CPNS covid
                     |         death
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |    12,061      3,005 |    15,066 
                     |     15.02      14.83 |     14.98 
---------------------+----------------------+----------
  Normal (18.5-24.9) |    15,354      3,874 |    19,228 
                     |     19.12      19.12 |     19.12 
---------------------+----------------------+----------
Overweight (25-29.9) |    15,200      3,802 |    19,002 
                     |     18.93      18.76 |     18.89 
---------------------+----------------------+----------
   Obese I (30-34.9) |    13,394      3,336 |    16,730 
                     |     16.68      16.46 |     16.64 
---------------------+----------------------+----------
  Obese II (35-39.9) |    12,292      3,115 |    15,407 
                     |     15.31      15.37 |     15.32 
---------------------+----------------------+----------
     Obese III (40+) |    12,003      3,134 |    15,137 
                     |     14.95      15.46 |     15.05 
---------------------+----------------------+----------
               Total |    80,304     20,266 |   100,570 
                     |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   Failure/censoring
             |     indicator for
             |  outcome: CPNS covid
     Smoking |         death
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |    23,353      5,909 |    29,262 
             |     29.08      29.16 |     29.10 
-------------+----------------------+----------
      Former |    10,255      2,624 |    12,879 
             |     12.77      12.95 |     12.81 
-------------+----------------------+----------
     Current |    23,285      5,853 |    29,138 
             |     29.00      28.88 |     28.97 
-------------+----------------------+----------
Unknown (.u) |    23,411      5,880 |    29,291 
             |     29.15      29.01 |     29.12 
-------------+----------------------+----------
       Total |    80,304     20,266 |   100,570 
             |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
  Severely |  outcome: CPNS covid
obese (cat |         death
        3) |         0          1 |     Total
-----------+----------------------+----------
         0 |    80,251     20,244 |   100,495 
           |     99.93      99.89 |     99.93 
-----------+----------------------+----------
         1 |        53         22 |        75 
           |      0.07       0.11 |      0.07 
-----------+----------------------+----------
     Total |    80,304     20,266 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
 RECODE of |     indicator for
     smoke |  outcome: CPNS covid
  (Smoking |         death
   status) |         0          1 |     Total
-----------+----------------------+----------
         0 |    57,019     14,413 |    71,432 
           |     71.00      71.12 |     71.03 
-----------+----------------------+----------
         1 |    23,285      5,853 |    29,138 
           |     29.00      28.88 |     28.97 
-----------+----------------------+----------
     Total |    80,304     20,266 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
Respirator |     indicator for
 y disease |  outcome: CPNS covid
    (excl. |         death
   asthma) |         0          1 |     Total
-----------+----------------------+----------
         0 |    79,768     20,145 |    99,913 
           |     99.33      99.40 |     99.35 
-----------+----------------------+----------
         1 |       536        121 |       657 
           |      0.67       0.60 |      0.65 
-----------+----------------------+----------
     Total |    80,304     20,266 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: CPNS covid
           |         death
    Asthma |         0          1 |     Total
-----------+----------------------+----------
         0 |    80,265     20,256 |   100,521 
           |     99.95      99.95 |     99.95 
-----------+----------------------+----------
         1 |        39         10 |        49 
           |      0.05       0.05 |      0.05 
-----------+----------------------+----------
     Total |    80,304     20,266 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: CPNS covid
     Heart |         death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    62,471     15,828 |    78,299 
           |     77.79      78.10 |     77.86 
-----------+----------------------+----------
         1 |    17,833      4,438 |    22,271 
           |     22.21      21.90 |     22.14 
-----------+----------------------+----------
     Total |    80,304     20,266 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: CPNS covid
           |         death
  Diabetes |         0          1 |     Total
-----------+----------------------+----------
         0 |    58,050     14,642 |    72,692 
           |     72.29      72.25 |     72.28 
-----------+----------------------+----------
         1 |    22,254      5,624 |    27,878 
           |     27.71      27.75 |     27.72 
-----------+----------------------+----------
     Total |    80,304     20,266 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

    Cancer |   Failure/censoring
other than |     indicator for
haematolog |  outcome: CPNS covid
   ical in |         death
 last year |         0          1 |     Total
-----------+----------------------+----------
         0 |    63,990     16,306 |    80,296 
           |     79.68      80.46 |     79.84 
-----------+----------------------+----------
         1 |    16,314      3,960 |    20,274 
           |     20.32      19.54 |     20.16 
-----------+----------------------+----------
     Total |    80,304     20,266 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  Haematol |
malignancy |
, aplastic |
anaemia or |
      bone |   Failure/censoring
    marrow |     indicator for
transplant |  outcome: CPNS covid
   in last |         death
      year |         0          1 |     Total
-----------+----------------------+----------
         0 |    64,253     16,284 |    80,537 
           |     80.01      80.35 |     80.08 
-----------+----------------------+----------
         1 |    16,051      3,982 |    20,033 
           |     19.99      19.65 |     19.92 
-----------+----------------------+----------
     Total |    80,304     20,266 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |  outcome: CPNS covid
     liver |         death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    72,220     18,289 |    90,509 
           |     89.93      90.24 |     90.00 
-----------+----------------------+----------
         1 |     8,084      1,977 |    10,061 
           |     10.07       9.76 |     10.00 
-----------+----------------------+----------
     Total |    80,304     20,266 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

     Neuro |   Failure/censoring
 condition |     indicator for
other than |  outcome: CPNS covid
stroke/dem |         death
     entia |         0          1 |     Total
-----------+----------------------+----------
         0 |    80,075     20,216 |   100,291 
           |     99.71      99.75 |     99.72 
-----------+----------------------+----------
         1 |       229         50 |       279 
           |      0.29       0.25 |      0.28 
-----------+----------------------+----------
     Total |    80,304     20,266 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: CPNS covid
    Kidney |         death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    76,270     19,286 |    95,556 
           |     94.98      95.16 |     95.01 
-----------+----------------------+----------
         1 |     4,034        980 |     5,014 
           |      5.02       4.84 |      4.99 
-----------+----------------------+----------
     Total |    80,304     20,266 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
     Organ |  outcome: CPNS covid
transplant |         death
 recipient |         0          1 |     Total
-----------+----------------------+----------
         0 |    76,337     19,187 |    95,524 
           |     95.06      94.68 |     94.98 
-----------+----------------------+----------
         1 |     3,967      1,079 |     5,046 
           |      4.94       5.32 |      5.02 
-----------+----------------------+----------
     Total |    80,304     20,266 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

    Spleen |   Failure/censoring
  problems |     indicator for
(dysplenia |  outcome: CPNS covid
  , sickle |         death
     cell) |         0          1 |     Total
-----------+----------------------+----------
         0 |    72,297     18,233 |    90,530 
           |     90.03      89.97 |     90.02 
-----------+----------------------+----------
         1 |     8,007      2,033 |    10,040 
           |      9.97      10.03 |      9.98 
-----------+----------------------+----------
     Total |    80,304     20,266 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
  RA, SLE, |     indicator for
 Psoriasis |  outcome: CPNS covid
(autoimmun |         death
e disease) |         0          1 |     Total
-----------+----------------------+----------
         0 |    79,758     20,161 |    99,919 
           |     99.32      99.48 |     99.35 
-----------+----------------------+----------
         1 |       546        105 |       651 
           |      0.68       0.52 |      0.65 
-----------+----------------------+----------
     Total |    80,304     20,266 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
  Index of |     indicator for
  Multiple |  outcome: CPNS covid
Deprivatio |         death
   n (IMD) |         0          1 |     Total
-----------+----------------------+----------
         1 |    14,812      3,816 |    18,628 
           |     18.71      19.11 |     18.79 
-----------+----------------------+----------
         2 |    15,414      3,950 |    19,364 
           |     19.47      19.79 |     19.53 
-----------+----------------------+----------
         3 |    10,861      2,738 |    13,599 
           |     13.72      13.71 |     13.72 
-----------+----------------------+----------
         4 |    21,487      5,363 |    26,850 
           |     27.14      26.86 |     27.08 
-----------+----------------------+----------
         5 |    16,597      4,097 |    20,694 
           |     20.96      20.52 |     20.87 
-----------+----------------------+----------
     Total |    79,171     19,964 |    99,135 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

            |   Failure/censoring
            |     indicator for
            |  outcome: CPNS covid
            |         death
  Ethnicity |         0          1 |     Total
------------+----------------------+----------
      White |     8,159      2,113 |    10,272 
            |     10.16      10.43 |     10.21 
------------+----------------------+----------
South Asian |       123         41 |       164 
            |      0.15       0.20 |      0.16 
------------+----------------------+----------
      Black |        78         22 |       100 
            |      0.10       0.11 |      0.10 
------------+----------------------+----------
      Other |        21          3 |        24 
            |      0.03       0.01 |      0.02 
------------+----------------------+----------
      Mixed |     8,056      1,969 |    10,025 
            |     10.03       9.72 |      9.97 
------------+----------------------+----------
          . |    63,867     16,118 |    79,985 
            |     79.53      79.53 |     79.53 
------------+----------------------+----------
      Total |    80,304     20,266 |   100,570 
            |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |     outcome: ITU
   Grouped |       admission
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<40 |    22,087      5,652 |    27,739 
           |     27.48      27.98 |     27.58 
-----------+----------------------+----------
    40-<50 |     9,694      2,406 |    12,100 
           |     12.06      11.91 |     12.03 
-----------+----------------------+----------
    50-<60 |    17,748      4,398 |    22,146 
           |     22.08      21.77 |     22.02 
-----------+----------------------+----------
    60-<70 |     7,559      1,895 |     9,454 
           |      9.41       9.38 |      9.40 
-----------+----------------------+----------
    70-<80 |     6,659      1,686 |     8,345 
           |      8.29       8.35 |      8.30 
-----------+----------------------+----------
       80+ |    16,621      4,165 |    20,786 
           |     20.68      20.62 |     20.67 
-----------+----------------------+----------
     Total |    80,368     20,202 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |     outcome: ITU
           |       admission
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |    44,174     11,068 |    55,242 
           |     54.96      54.79 |     54.93 
-----------+----------------------+----------
         1 |    36,194      9,134 |    45,328 
           |     45.04      45.21 |     45.07 
-----------+----------------------+----------
     Total |    80,368     20,202 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |     outcome: ITU
                     |       admission
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |    12,044      3,022 |    15,066 
                     |     14.99      14.96 |     14.98 
---------------------+----------------------+----------
  Normal (18.5-24.9) |    15,387      3,841 |    19,228 
                     |     19.15      19.01 |     19.12 
---------------------+----------------------+----------
Overweight (25-29.9) |    15,162      3,840 |    19,002 
                     |     18.87      19.01 |     18.89 
---------------------+----------------------+----------
   Obese I (30-34.9) |    13,418      3,312 |    16,730 
                     |     16.70      16.39 |     16.64 
---------------------+----------------------+----------
  Obese II (35-39.9) |    12,289      3,118 |    15,407 
                     |     15.29      15.43 |     15.32 
---------------------+----------------------+----------
     Obese III (40+) |    12,068      3,069 |    15,137 
                     |     15.02      15.19 |     15.05 
---------------------+----------------------+----------
               Total |    80,368     20,202 |   100,570 
                     |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   Failure/censoring
             |     indicator for
             |     outcome: ITU
     Smoking |       admission
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |    23,456      5,806 |    29,262 
             |     29.19      28.74 |     29.10 
-------------+----------------------+----------
      Former |    10,263      2,616 |    12,879 
             |     12.77      12.95 |     12.81 
-------------+----------------------+----------
     Current |    23,304      5,834 |    29,138 
             |     29.00      28.88 |     28.97 
-------------+----------------------+----------
Unknown (.u) |    23,345      5,946 |    29,291 
             |     29.05      29.43 |     29.12 
-------------+----------------------+----------
       Total |    80,368     20,202 |   100,570 
             |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
  Severely |     outcome: ITU
obese (cat |       admission
        3) |         0          1 |     Total
-----------+----------------------+----------
         0 |    80,307     20,188 |   100,495 
           |     99.92      99.93 |     99.93 
-----------+----------------------+----------
         1 |        61         14 |        75 
           |      0.08       0.07 |      0.07 
-----------+----------------------+----------
     Total |    80,368     20,202 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
 RECODE of |     indicator for
     smoke |     outcome: ITU
  (Smoking |       admission
   status) |         0          1 |     Total
-----------+----------------------+----------
         0 |    57,064     14,368 |    71,432 
           |     71.00      71.12 |     71.03 
-----------+----------------------+----------
         1 |    23,304      5,834 |    29,138 
           |     29.00      28.88 |     28.97 
-----------+----------------------+----------
     Total |    80,368     20,202 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
Respirator |     indicator for
 y disease |     outcome: ITU
    (excl. |       admission
   asthma) |         0          1 |     Total
-----------+----------------------+----------
         0 |    79,836     20,077 |    99,913 
           |     99.34      99.38 |     99.35 
-----------+----------------------+----------
         1 |       532        125 |       657 
           |      0.66       0.62 |      0.65 
-----------+----------------------+----------
     Total |    80,368     20,202 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |     outcome: ITU
           |       admission
    Asthma |         0          1 |     Total
-----------+----------------------+----------
         0 |    80,327     20,194 |   100,521 
           |     99.95      99.96 |     99.95 
-----------+----------------------+----------
         1 |        41          8 |        49 
           |      0.05       0.04 |      0.05 
-----------+----------------------+----------
     Total |    80,368     20,202 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |     outcome: ITU
     Heart |       admission
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    62,583     15,716 |    78,299 
           |     77.87      77.79 |     77.86 
-----------+----------------------+----------
         1 |    17,785      4,486 |    22,271 
           |     22.13      22.21 |     22.14 
-----------+----------------------+----------
     Total |    80,368     20,202 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |     outcome: ITU
           |       admission
  Diabetes |         0          1 |     Total
-----------+----------------------+----------
         0 |    58,129     14,563 |    72,692 
           |     72.33      72.09 |     72.28 
-----------+----------------------+----------
         1 |    22,239      5,639 |    27,878 
           |     27.67      27.91 |     27.72 
-----------+----------------------+----------
     Total |    80,368     20,202 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

    Cancer |   Failure/censoring
other than |     indicator for
haematolog |     outcome: ITU
   ical in |       admission
 last year |         0          1 |     Total
-----------+----------------------+----------
         0 |    64,140     16,156 |    80,296 
           |     79.81      79.97 |     79.84 
-----------+----------------------+----------
         1 |    16,228      4,046 |    20,274 
           |     20.19      20.03 |     20.16 
-----------+----------------------+----------
     Total |    80,368     20,202 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  Haematol |
malignancy |
, aplastic |
anaemia or |
      bone |   Failure/censoring
    marrow |     indicator for
transplant |     outcome: ITU
   in last |       admission
      year |         0          1 |     Total
-----------+----------------------+----------
         0 |    64,418     16,119 |    80,537 
           |     80.15      79.79 |     80.08 
-----------+----------------------+----------
         1 |    15,950      4,083 |    20,033 
           |     19.85      20.21 |     19.92 
-----------+----------------------+----------
     Total |    80,368     20,202 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
   Chronic |     outcome: ITU
     liver |       admission
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    72,327     18,182 |    90,509 
           |     89.99      90.00 |     90.00 
-----------+----------------------+----------
         1 |     8,041      2,020 |    10,061 
           |     10.01      10.00 |     10.00 
-----------+----------------------+----------
     Total |    80,368     20,202 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

     Neuro |   Failure/censoring
 condition |     indicator for
other than |     outcome: ITU
stroke/dem |       admission
     entia |         0          1 |     Total
-----------+----------------------+----------
         0 |    80,144     20,147 |   100,291 
           |     99.72      99.73 |     99.72 
-----------+----------------------+----------
         1 |       224         55 |       279 
           |      0.28       0.27 |      0.28 
-----------+----------------------+----------
     Total |    80,368     20,202 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |     outcome: ITU
    Kidney |       admission
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    76,356     19,200 |    95,556 
           |     95.01      95.04 |     95.01 
-----------+----------------------+----------
         1 |     4,012      1,002 |     5,014 
           |      4.99       4.96 |      4.99 
-----------+----------------------+----------
     Total |    80,368     20,202 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
     Organ |     outcome: ITU
transplant |       admission
 recipient |         0          1 |     Total
-----------+----------------------+----------
         0 |    76,341     19,183 |    95,524 
           |     94.99      94.96 |     94.98 
-----------+----------------------+----------
         1 |     4,027      1,019 |     5,046 
           |      5.01       5.04 |      5.02 
-----------+----------------------+----------
     Total |    80,368     20,202 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

    Spleen |   Failure/censoring
  problems |     indicator for
(dysplenia |     outcome: ITU
  , sickle |       admission
     cell) |         0          1 |     Total
-----------+----------------------+----------
         0 |    72,350     18,180 |    90,530 
           |     90.02      89.99 |     90.02 
-----------+----------------------+----------
         1 |     8,018      2,022 |    10,040 
           |      9.98      10.01 |      9.98 
-----------+----------------------+----------
     Total |    80,368     20,202 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
  RA, SLE, |     indicator for
 Psoriasis |     outcome: ITU
(autoimmun |       admission
e disease) |         0          1 |     Total
-----------+----------------------+----------
         0 |    79,844     20,075 |    99,919 
           |     99.35      99.37 |     99.35 
-----------+----------------------+----------
         1 |       524        127 |       651 
           |      0.65       0.63 |      0.65 
-----------+----------------------+----------
     Total |    80,368     20,202 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
  Index of |     indicator for
  Multiple |     outcome: ITU
Deprivatio |       admission
   n (IMD) |         0          1 |     Total
-----------+----------------------+----------
         1 |    14,868      3,760 |    18,628 
           |     18.77      18.88 |     18.79 
-----------+----------------------+----------
         2 |    15,492      3,872 |    19,364 
           |     19.56      19.44 |     19.53 
-----------+----------------------+----------
         3 |    10,885      2,714 |    13,599 
           |     13.74      13.63 |     13.72 
-----------+----------------------+----------
         4 |    21,516      5,334 |    26,850 
           |     27.16      26.78 |     27.08 
-----------+----------------------+----------
         5 |    16,458      4,236 |    20,694 
           |     20.78      21.27 |     20.87 
-----------+----------------------+----------
     Total |    79,219     19,916 |    99,135 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

            |   Failure/censoring
            |     indicator for
            |     outcome: ITU
            |       admission
  Ethnicity |         0          1 |     Total
------------+----------------------+----------
      White |     8,194      2,078 |    10,272 
            |     10.20      10.29 |     10.21 
------------+----------------------+----------
South Asian |       133         31 |       164 
            |      0.17       0.15 |      0.16 
------------+----------------------+----------
      Black |        75         25 |       100 
            |      0.09       0.12 |      0.10 
------------+----------------------+----------
      Other |        17          7 |        24 
            |      0.02       0.03 |      0.02 
------------+----------------------+----------
      Mixed |     8,007      2,018 |    10,025 
            |      9.96       9.99 |      9.97 
------------+----------------------+----------
          . |    63,942     16,043 |    79,985 
            |     79.56      79.41 |     79.53 
------------+----------------------+----------
      Total |    80,368     20,202 |   100,570 
            |    100.00     100.00 |    100.00 

. 
. 
. 
. * Close the log file
. log close
      name:  <unnamed>
       log:  C:\Github\opencorona-risk-factors-research\analysis\output/an_descriptive_tables.log
  log type:  text
 closed on:  23 Apr 2020, 12:23:41
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
