---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Github\opencorona-risk-factors-research\analysis\output/an_descriptive_tables.log
  log type:  text
 opened on:  23 Apr 2020, 11:05:06

. 
. use egdata, clear
(Poor factors dummy analysis dataset)

. 
. 
. **********************************
. *  Distribution in whole cohort  *
. **********************************
. 
. 
. * Demographics
. summ age

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |    100,570    55.50364    23.01542         18        105

. tab agegroup

Grouped age |      Freq.     Percent        Cum.
------------+-----------------------------------
     18-<40 |     27,739       27.58       27.58
     40-<50 |     12,100       12.03       39.61
     50-<60 |     22,146       22.02       61.63
     60-<70 |      9,454        9.40       71.03
     70-<80 |      8,345        8.30       79.33
        80+ |     20,786       20.67      100.00
------------+-----------------------------------
      Total |    100,570      100.00

. tab male

       Male |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     55,242       54.93       54.93
          1 |     45,328       45.07      100.00
------------+-----------------------------------
      Total |    100,570      100.00

. tab bmicat

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |     15,221       15.13       15.13
  Normal (18.5-24.9) |     19,225       19.12       34.25
Overweight (25-29.9) |     18,970       18.86       53.11
   Obese I (30-34.9) |     16,478       16.38       69.50
  Obese II (35-39.9) |     15,456       15.37       84.87
     Obese III (40+) |     15,220       15.13      100.00
---------------------+-----------------------------------
               Total |    100,570      100.00

. tab bmicat, m

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |     15,221       15.13       15.13
  Normal (18.5-24.9) |     19,225       19.12       34.25
Overweight (25-29.9) |     18,970       18.86       53.11
   Obese I (30-34.9) |     16,478       16.38       69.50
  Obese II (35-39.9) |     15,456       15.37       84.87
     Obese III (40+) |     15,220       15.13      100.00
---------------------+-----------------------------------
               Total |    100,570      100.00

. tab smoke

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |     30,090      100.00      100.00
-------------+-----------------------------------
       Total |     30,090      100.00

. tab smoke, m

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |     30,090       29.92       29.92
           . |     70,480       70.08      100.00
-------------+-----------------------------------
       Total |    100,570      100.00

. 
. * Comorbidities
. tab chronic_respiratory_disease

Respiratory |
    disease |
     (excl. |
    asthma) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     99,913       99.35       99.35
          1 |        657        0.65      100.00
------------+-----------------------------------
      Total |    100,570      100.00

. tab asthma

     Asthma |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    100,521       99.95       99.95
          1 |         49        0.05      100.00
------------+-----------------------------------
      Total |    100,570      100.00

. tab chronic_cardiac_disease

      Heart |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     78,299       77.86       77.86
          1 |     22,271       22.14      100.00
------------+-----------------------------------
      Total |    100,570      100.00

. tab diabetes

   Diabetes |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     72,692       72.28       72.28
          1 |     27,878       27.72      100.00
------------+-----------------------------------
      Total |    100,570      100.00

. tab cancer_exhaem_lastyr

     Cancer |
 other than |
haematologi |
cal in last |
       year |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    100,566      100.00      100.00
          1 |          4        0.00      100.00
------------+-----------------------------------
      Total |    100,570      100.00

. tab haemmalig_aanaem_bmtrans_lastyr

   Haematol |
malignancy, |
   aplastic |
 anaemia or |
bone marrow |
 transplant |
    in last |
       year |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    100,567      100.00      100.00
          1 |          3        0.00      100.00
------------+-----------------------------------
      Total |    100,570      100.00

. tab chronic_liver_disease

      Liver |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     90,509       90.00       90.00
          1 |     10,061       10.00      100.00
------------+-----------------------------------
      Total |    100,570      100.00

. tab other_neuro

      Neuro |
  condition |
 other than |
stroke/deme |
       ntia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    100,291       99.72       99.72
          1 |        279        0.28      100.00
------------+-----------------------------------
      Total |    100,570      100.00

. tab chronic_kidney_disease

     Kidney |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     95,468       94.93       94.93
          1 |      5,102        5.07      100.00
------------+-----------------------------------
      Total |    100,570      100.00

. tab organ_transplant

      Organ |
 transplant |
  recipient |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    100,551       99.98       99.98
          1 |         19        0.02      100.00
------------+-----------------------------------
      Total |    100,570      100.00

. tab chronic_kidney_disease

     Kidney |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     95,468       94.93       94.93
          1 |      5,102        5.07      100.00
------------+-----------------------------------
      Total |    100,570      100.00

. tab organ_transplant

      Organ |
 transplant |
  recipient |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    100,551       99.98       99.98
          1 |         19        0.02      100.00
------------+-----------------------------------
      Total |    100,570      100.00

. tab spleen

     Spleen |
   problems |
(dysplenia, |
     sickle |
      cell) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     90,530       90.02       90.02
          1 |     10,040        9.98      100.00
------------+-----------------------------------
      Total |    100,570      100.00

. tab ra_sle_psoriasis

   RA, SLE, |
  Psoriasis |
(autoimmune |
   disease) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     99,919       99.35       99.35
          1 |        651        0.65      100.00
------------+-----------------------------------
      Total |    100,570      100.00

. tab dementia

   dementia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    100,563       99.99       99.99
          1 |          7        0.01      100.00
------------+-----------------------------------
      Total |    100,570      100.00

. tab stroke

     stroke |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     90,149       89.64       89.64
          1 |     10,421       10.36      100.00
------------+-----------------------------------
      Total |    100,570      100.00

. tab stroke_dementia

  Stroke or |
   dementia |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     10,427      100.00      100.00
------------+-----------------------------------
      Total |     10,427      100.00

. * tab immunosuppressed
.                                                     
. tab bpcat

 Grouped blood |
      pressure |      Freq.     Percent        Cum.
---------------+-----------------------------------
        Normal |     51,906       51.61       51.61
      Elevated |      5,242        5.21       56.82
 High, stage I |     19,217       19.11       75.93
High, stage II |     24,205       24.07      100.00
---------------+-----------------------------------
         Total |    100,570      100.00

. 
. *summ bp_sys,  detail
. *summ bp_dias, detail
. 
. tab imd 

   Index of |
   Multiple |
Deprivation |
      (IMD) |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     18,628       18.79       18.79
          2 |     19,364       19.53       38.32
          3 |     13,599       13.72       52.04
          4 |     26,850       27.08       79.13
          5 |     20,694       20.87      100.00
------------+-----------------------------------
      Total |     99,135      100.00

. tab imd, m

   Index of |
   Multiple |
Deprivation |
      (IMD) |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     18,628       18.52       18.52
          2 |     19,364       19.25       37.78
          3 |     13,599       13.52       51.30
          4 |     26,850       26.70       78.00
          5 |     20,694       20.58       98.57
    Unknown |      1,435        1.43      100.00
------------+-----------------------------------
      Total |    100,570      100.00

. tab ethnicity

  Ethnicity |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |     10,272       49.90       49.90
South Asian |        164        0.80       50.70
      Black |        100        0.49       51.18
      Other |         24        0.12       51.30
      Mixed |     10,025       48.70      100.00
------------+-----------------------------------
      Total |     20,585      100.00

. tab ethnicity, m

  Ethnicity |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |     10,272       10.21       10.21
South Asian |        164        0.16       10.38
      Black |        100        0.10       10.48
      Other |         24        0.02       10.50
      Mixed |     10,025        9.97       20.47
          . |     79,985       79.53      100.00
------------+-----------------------------------
      Total |    100,570      100.00

. *tab urban
. 
. 
. * Outcomes
. tab onscoviddeath

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
  ONS covid |
      death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     95,611       95.07       95.07
          1 |      4,959        4.93      100.00
------------+-----------------------------------
      Total |    100,570      100.00

. tab cpnsdeath

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
 CPNS covid |
      death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     95,561       95.02       95.02
          1 |      5,009        4.98      100.00
------------+-----------------------------------
      Total |    100,570      100.00

. tab ituadmission

Failure/cen |
     soring |
  indicator |
        for |
   outcome: |
        ITU |
  admission |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     95,556       95.01       95.01
          1 |      5,014        4.99      100.00
------------+-----------------------------------
      Total |    100,570      100.00

. * tab ecds
. 
. 
. 
. 
. **********************************
. *  Number (%) with each outcome  *
. **********************************
. 
. foreach outvar of varlist onscoviddeath cpnsdeath ituadmission {
  2. 
. *** Repeat for each outcome
. 
.         * Demographics
.         tab agegroup                                                    `outvar', col
  3.         tab male                                                                `outvar', col
  4.         tab bmicat                                                              `outvar', col m 
  5.         tab smoke                                                               `outvar', col m
  6.         tab obese                                                               `outvar', col m 
  7.         tab current                                                             `outvar', col m
  8. 
.         * Comorbidities
.         tab chronic_respiratory_disease                 `outvar', col
  9.         tab asthma                                                              `outvar', col
 10.         tab chronic_cardiac_disease                     `outvar', col
 11.         tab diabetes                                                    `outvar', col
 12.         tab cancer_exhaem_lastyr                                `outvar', col
 13. 
.         tab haemmalig_aanaem_bmtrans_lastyr     `outvar', col
 14.         tab chronic_liver_disease                               `outvar', col
 15.         tab other_neuro                                                 `outvar', col
 16.         tab chronic_kidney_disease                              `outvar', col
 17.         tab organ_transplant                                    `outvar', col
 18.         tab spleen                                                              `outvar', col
 19.         tab ra_sle_psoriasis                                    `outvar', col
 20.         
.         tab imd                                                                 `outvar', col
 21.         tab ethnicity                                                   `outvar', col m
 22.         *tab urban                                                              `outvar', col
. }

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: ONS covid
   Grouped |         death
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<40 |    26,344      1,395 |    27,739 
           |     27.55      28.13 |     27.58 
-----------+----------------------+----------
    40-<50 |    11,546        554 |    12,100 
           |     12.08      11.17 |     12.03 
-----------+----------------------+----------
    50-<60 |    21,024      1,122 |    22,146 
           |     21.99      22.63 |     22.02 
-----------+----------------------+----------
    60-<70 |     8,975        479 |     9,454 
           |      9.39       9.66 |      9.40 
-----------+----------------------+----------
    70-<80 |     7,903        442 |     8,345 
           |      8.27       8.91 |      8.30 
-----------+----------------------+----------
       80+ |    19,819        967 |    20,786 
           |     20.73      19.50 |     20.67 
-----------+----------------------+----------
     Total |    95,611      4,959 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: ONS covid
           |         death
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |    52,526      2,716 |    55,242 
           |     54.94      54.77 |     54.93 
-----------+----------------------+----------
         1 |    43,085      2,243 |    45,328 
           |     45.06      45.23 |     45.07 
-----------+----------------------+----------
     Total |    95,611      4,959 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |  outcome: ONS covid
                     |         death
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |    14,467        754 |    15,221 
                     |     15.13      15.20 |     15.13 
---------------------+----------------------+----------
  Normal (18.5-24.9) |    18,290        935 |    19,225 
                     |     19.13      18.85 |     19.12 
---------------------+----------------------+----------
Overweight (25-29.9) |    18,032        938 |    18,970 
                     |     18.86      18.92 |     18.86 
---------------------+----------------------+----------
   Obese I (30-34.9) |    15,675        803 |    16,478 
                     |     16.39      16.19 |     16.38 
---------------------+----------------------+----------
  Obese II (35-39.9) |    14,675        781 |    15,456 
                     |     15.35      15.75 |     15.37 
---------------------+----------------------+----------
     Obese III (40+) |    14,472        748 |    15,220 
                     |     15.14      15.08 |     15.13 
---------------------+----------------------+----------
               Total |    95,611      4,959 |   100,570 
                     |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   Failure/censoring
             |     indicator for
             |  outcome: ONS covid
     Smoking |         death
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |    28,620      1,470 |    30,090 
             |     29.93      29.64 |     29.92 
-------------+----------------------+----------
           . |    66,991      3,489 |    70,480 
             |     70.07      70.36 |     70.08 
-------------+----------------------+----------
       Total |    95,611      4,959 |   100,570 
             |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
  Severely |  outcome: ONS covid
obese (cat |         death
        3) |         0          1 |     Total
-----------+----------------------+----------
         0 |    95,538      4,957 |   100,495 
           |     99.92      99.96 |     99.93 
-----------+----------------------+----------
         1 |        73          2 |        75 
           |      0.08       0.04 |      0.07 
-----------+----------------------+----------
     Total |    95,611      4,959 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: ONS covid
   Current |         death
    smoker |         0          1 |     Total
-----------+----------------------+----------
         0 |    28,620      1,470 |    30,090 
           |     29.93      29.64 |     29.92 
-----------+----------------------+----------
         . |    66,991      3,489 |    70,480 
           |     70.07      70.36 |     70.08 
-----------+----------------------+----------
     Total |    95,611      4,959 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
Respirator |     indicator for
 y disease |  outcome: ONS covid
    (excl. |         death
   asthma) |         0          1 |     Total
-----------+----------------------+----------
         0 |    94,983      4,930 |    99,913 
           |     99.34      99.42 |     99.35 
-----------+----------------------+----------
         1 |       628         29 |       657 
           |      0.66       0.58 |      0.65 
-----------+----------------------+----------
     Total |    95,611      4,959 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: ONS covid
           |         death
    Asthma |         0          1 |     Total
-----------+----------------------+----------
         0 |    95,565      4,956 |   100,521 
           |     99.95      99.94 |     99.95 
-----------+----------------------+----------
         1 |        46          3 |        49 
           |      0.05       0.06 |      0.05 
-----------+----------------------+----------
     Total |    95,611      4,959 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: ONS covid
     Heart |         death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    74,445      3,854 |    78,299 
           |     77.86      77.72 |     77.86 
-----------+----------------------+----------
         1 |    21,166      1,105 |    22,271 
           |     22.14      22.28 |     22.14 
-----------+----------------------+----------
     Total |    95,611      4,959 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: ONS covid
           |         death
  Diabetes |         0          1 |     Total
-----------+----------------------+----------
         0 |    69,088      3,604 |    72,692 
           |     72.26      72.68 |     72.28 
-----------+----------------------+----------
         1 |    26,523      1,355 |    27,878 
           |     27.74      27.32 |     27.72 
-----------+----------------------+----------
     Total |    95,611      4,959 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

    Cancer |   Failure/censoring
other than |     indicator for
haematolog |  outcome: ONS covid
   ical in |         death
 last year |         0          1 |     Total
-----------+----------------------+----------
         0 |    95,607      4,959 |   100,566 
           |    100.00     100.00 |    100.00 
-----------+----------------------+----------
         1 |         4          0 |         4 
           |      0.00       0.00 |      0.00 
-----------+----------------------+----------
     Total |    95,611      4,959 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  Haematol |
malignancy |
, aplastic |
anaemia or |
      bone |   Failure/censoring
    marrow |     indicator for
transplant |  outcome: ONS covid
   in last |         death
      year |         0          1 |     Total
-----------+----------------------+----------
         0 |    95,608      4,959 |   100,567 
           |    100.00     100.00 |    100.00 
-----------+----------------------+----------
         1 |         3          0 |         3 
           |      0.00       0.00 |      0.00 
-----------+----------------------+----------
     Total |    95,611      4,959 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: ONS covid
           |         death
     Liver |         0          1 |     Total
-----------+----------------------+----------
         0 |    86,066      4,443 |    90,509 
           |     90.02      89.59 |     90.00 
-----------+----------------------+----------
         1 |     9,545        516 |    10,061 
           |      9.98      10.41 |     10.00 
-----------+----------------------+----------
     Total |    95,611      4,959 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

     Neuro |   Failure/censoring
 condition |     indicator for
other than |  outcome: ONS covid
stroke/dem |         death
     entia |         0          1 |     Total
-----------+----------------------+----------
         0 |    95,352      4,939 |   100,291 
           |     99.73      99.60 |     99.72 
-----------+----------------------+----------
         1 |       259         20 |       279 
           |      0.27       0.40 |      0.28 
-----------+----------------------+----------
     Total |    95,611      4,959 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: ONS covid
    Kidney |         death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    90,799      4,669 |    95,468 
           |     94.97      94.15 |     94.93 
-----------+----------------------+----------
         1 |     4,812        290 |     5,102 
           |      5.03       5.85 |      5.07 
-----------+----------------------+----------
     Total |    95,611      4,959 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
     Organ |  outcome: ONS covid
transplant |         death
 recipient |         0          1 |     Total
-----------+----------------------+----------
         0 |    95,593      4,958 |   100,551 
           |     99.98      99.98 |     99.98 
-----------+----------------------+----------
         1 |        18          1 |        19 
           |      0.02       0.02 |      0.02 
-----------+----------------------+----------
     Total |    95,611      4,959 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

    Spleen |   Failure/censoring
  problems |     indicator for
(dysplenia |  outcome: ONS covid
  , sickle |         death
     cell) |         0          1 |     Total
-----------+----------------------+----------
         0 |    86,048      4,482 |    90,530 
           |     90.00      90.38 |     90.02 
-----------+----------------------+----------
         1 |     9,563        477 |    10,040 
           |     10.00       9.62 |      9.98 
-----------+----------------------+----------
     Total |    95,611      4,959 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
  RA, SLE, |     indicator for
 Psoriasis |  outcome: ONS covid
(autoimmun |         death
e disease) |         0          1 |     Total
-----------+----------------------+----------
         0 |    94,994      4,925 |    99,919 
           |     99.35      99.31 |     99.35 
-----------+----------------------+----------
         1 |       617         34 |       651 
           |      0.65       0.69 |      0.65 
-----------+----------------------+----------
     Total |    95,611      4,959 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
  Index of |     indicator for
  Multiple |  outcome: ONS covid
Deprivatio |         death
   n (IMD) |         0          1 |     Total
-----------+----------------------+----------
         1 |    17,713        915 |    18,628 
           |     18.79      18.74 |     18.79 
-----------+----------------------+----------
         2 |    18,406        958 |    19,364 
           |     19.53      19.62 |     19.53 
-----------+----------------------+----------
         3 |    12,922        677 |    13,599 
           |     13.71      13.87 |     13.72 
-----------+----------------------+----------
         4 |    25,512      1,338 |    26,850 
           |     27.07      27.41 |     27.08 
-----------+----------------------+----------
         5 |    19,700        994 |    20,694 
           |     20.90      20.36 |     20.87 
-----------+----------------------+----------
     Total |    94,253      4,882 |    99,135 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

            |   Failure/censoring
            |     indicator for
            |  outcome: ONS covid
            |         death
  Ethnicity |         0          1 |     Total
------------+----------------------+----------
      White |     9,798        474 |    10,272 
            |     10.25       9.56 |     10.21 
------------+----------------------+----------
South Asian |       155          9 |       164 
            |      0.16       0.18 |      0.16 
------------+----------------------+----------
      Black |        93          7 |       100 
            |      0.10       0.14 |      0.10 
------------+----------------------+----------
      Other |        23          1 |        24 
            |      0.02       0.02 |      0.02 
------------+----------------------+----------
      Mixed |     9,513        512 |    10,025 
            |      9.95      10.32 |      9.97 
------------+----------------------+----------
          . |    76,029      3,956 |    79,985 
            |     79.52      79.77 |     79.53 
------------+----------------------+----------
      Total |    95,611      4,959 |   100,570 
            |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: CPNS covid
   Grouped |         death
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<40 |    26,340      1,399 |    27,739 
           |     27.56      27.93 |     27.58 
-----------+----------------------+----------
    40-<50 |    11,550        550 |    12,100 
           |     12.09      10.98 |     12.03 
-----------+----------------------+----------
    50-<60 |    21,002      1,144 |    22,146 
           |     21.98      22.84 |     22.02 
-----------+----------------------+----------
    60-<70 |     8,987        467 |     9,454 
           |      9.40       9.32 |      9.40 
-----------+----------------------+----------
    70-<80 |     7,943        402 |     8,345 
           |      8.31       8.03 |      8.30 
-----------+----------------------+----------
       80+ |    19,739      1,047 |    20,786 
           |     20.66      20.90 |     20.67 
-----------+----------------------+----------
     Total |    95,561      5,009 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: CPNS covid
           |         death
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |    52,490      2,752 |    55,242 
           |     54.93      54.94 |     54.93 
-----------+----------------------+----------
         1 |    43,071      2,257 |    45,328 
           |     45.07      45.06 |     45.07 
-----------+----------------------+----------
     Total |    95,561      5,009 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |  outcome: CPNS covid
                     |         death
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |    14,495        726 |    15,221 
                     |     15.17      14.49 |     15.13 
---------------------+----------------------+----------
  Normal (18.5-24.9) |    18,241        984 |    19,225 
                     |     19.09      19.64 |     19.12 
---------------------+----------------------+----------
Overweight (25-29.9) |    18,071        899 |    18,970 
                     |     18.91      17.95 |     18.86 
---------------------+----------------------+----------
   Obese I (30-34.9) |    15,632        846 |    16,478 
                     |     16.36      16.89 |     16.38 
---------------------+----------------------+----------
  Obese II (35-39.9) |    14,714        742 |    15,456 
                     |     15.40      14.81 |     15.37 
---------------------+----------------------+----------
     Obese III (40+) |    14,408        812 |    15,220 
                     |     15.08      16.21 |     15.13 
---------------------+----------------------+----------
               Total |    95,561      5,009 |   100,570 
                     |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   Failure/censoring
             |     indicator for
             |  outcome: CPNS covid
     Smoking |         death
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |    28,588      1,502 |    30,090 
             |     29.92      29.99 |     29.92 
-------------+----------------------+----------
           . |    66,973      3,507 |    70,480 
             |     70.08      70.01 |     70.08 
-------------+----------------------+----------
       Total |    95,561      5,009 |   100,570 
             |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
  Severely |  outcome: CPNS covid
obese (cat |         death
        3) |         0          1 |     Total
-----------+----------------------+----------
         0 |    95,489      5,006 |   100,495 
           |     99.92      99.94 |     99.93 
-----------+----------------------+----------
         1 |        72          3 |        75 
           |      0.08       0.06 |      0.07 
-----------+----------------------+----------
     Total |    95,561      5,009 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: CPNS covid
   Current |         death
    smoker |         0          1 |     Total
-----------+----------------------+----------
         0 |    28,588      1,502 |    30,090 
           |     29.92      29.99 |     29.92 
-----------+----------------------+----------
         . |    66,973      3,507 |    70,480 
           |     70.08      70.01 |     70.08 
-----------+----------------------+----------
     Total |    95,561      5,009 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
Respirator |     indicator for
 y disease |  outcome: CPNS covid
    (excl. |         death
   asthma) |         0          1 |     Total
-----------+----------------------+----------
         0 |    94,933      4,980 |    99,913 
           |     99.34      99.42 |     99.35 
-----------+----------------------+----------
         1 |       628         29 |       657 
           |      0.66       0.58 |      0.65 
-----------+----------------------+----------
     Total |    95,561      5,009 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: CPNS covid
           |         death
    Asthma |         0          1 |     Total
-----------+----------------------+----------
         0 |    95,513      5,008 |   100,521 
           |     99.95      99.98 |     99.95 
-----------+----------------------+----------
         1 |        48          1 |        49 
           |      0.05       0.02 |      0.05 
-----------+----------------------+----------
     Total |    95,561      5,009 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: CPNS covid
     Heart |         death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    74,408      3,891 |    78,299 
           |     77.86      77.68 |     77.86 
-----------+----------------------+----------
         1 |    21,153      1,118 |    22,271 
           |     22.14      22.32 |     22.14 
-----------+----------------------+----------
     Total |    95,561      5,009 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: CPNS covid
           |         death
  Diabetes |         0          1 |     Total
-----------+----------------------+----------
         0 |    69,078      3,614 |    72,692 
           |     72.29      72.15 |     72.28 
-----------+----------------------+----------
         1 |    26,483      1,395 |    27,878 
           |     27.71      27.85 |     27.72 
-----------+----------------------+----------
     Total |    95,561      5,009 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

    Cancer |   Failure/censoring
other than |     indicator for
haematolog |  outcome: CPNS covid
   ical in |         death
 last year |         0          1 |     Total
-----------+----------------------+----------
         0 |    95,557      5,009 |   100,566 
           |    100.00     100.00 |    100.00 
-----------+----------------------+----------
         1 |         4          0 |         4 
           |      0.00       0.00 |      0.00 
-----------+----------------------+----------
     Total |    95,561      5,009 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  Haematol |
malignancy |
, aplastic |
anaemia or |
      bone |   Failure/censoring
    marrow |     indicator for
transplant |  outcome: CPNS covid
   in last |         death
      year |         0          1 |     Total
-----------+----------------------+----------
         0 |    95,558      5,009 |   100,567 
           |    100.00     100.00 |    100.00 
-----------+----------------------+----------
         1 |         3          0 |         3 
           |      0.00       0.00 |      0.00 
-----------+----------------------+----------
     Total |    95,561      5,009 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: CPNS covid
           |         death
     Liver |         0          1 |     Total
-----------+----------------------+----------
         0 |    85,983      4,526 |    90,509 
           |     89.98      90.36 |     90.00 
-----------+----------------------+----------
         1 |     9,578        483 |    10,061 
           |     10.02       9.64 |     10.00 
-----------+----------------------+----------
     Total |    95,561      5,009 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

     Neuro |   Failure/censoring
 condition |     indicator for
other than |  outcome: CPNS covid
stroke/dem |         death
     entia |         0          1 |     Total
-----------+----------------------+----------
         0 |    95,297      4,994 |   100,291 
           |     99.72      99.70 |     99.72 
-----------+----------------------+----------
         1 |       264         15 |       279 
           |      0.28       0.30 |      0.28 
-----------+----------------------+----------
     Total |    95,561      5,009 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |  outcome: CPNS covid
    Kidney |         death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    90,698      4,770 |    95,468 
           |     94.91      95.23 |     94.93 
-----------+----------------------+----------
         1 |     4,863        239 |     5,102 
           |      5.09       4.77 |      5.07 
-----------+----------------------+----------
     Total |    95,561      5,009 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
     Organ |  outcome: CPNS covid
transplant |         death
 recipient |         0          1 |     Total
-----------+----------------------+----------
         0 |    95,543      5,008 |   100,551 
           |     99.98      99.98 |     99.98 
-----------+----------------------+----------
         1 |        18          1 |        19 
           |      0.02       0.02 |      0.02 
-----------+----------------------+----------
     Total |    95,561      5,009 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

    Spleen |   Failure/censoring
  problems |     indicator for
(dysplenia |  outcome: CPNS covid
  , sickle |         death
     cell) |         0          1 |     Total
-----------+----------------------+----------
         0 |    86,048      4,482 |    90,530 
           |     90.05      89.48 |     90.02 
-----------+----------------------+----------
         1 |     9,513        527 |    10,040 
           |      9.95      10.52 |      9.98 
-----------+----------------------+----------
     Total |    95,561      5,009 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
  RA, SLE, |     indicator for
 Psoriasis |  outcome: CPNS covid
(autoimmun |         death
e disease) |         0          1 |     Total
-----------+----------------------+----------
         0 |    94,942      4,977 |    99,919 
           |     99.35      99.36 |     99.35 
-----------+----------------------+----------
         1 |       619         32 |       651 
           |      0.65       0.64 |      0.65 
-----------+----------------------+----------
     Total |    95,561      5,009 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
  Index of |     indicator for
  Multiple |  outcome: CPNS covid
Deprivatio |         death
   n (IMD) |         0          1 |     Total
-----------+----------------------+----------
         1 |    17,675        953 |    18,628 
           |     18.76      19.33 |     18.79 
-----------+----------------------+----------
         2 |    18,427        937 |    19,364 
           |     19.56      19.01 |     19.53 
-----------+----------------------+----------
         3 |    12,915        684 |    13,599 
           |     13.71      13.88 |     13.72 
-----------+----------------------+----------
         4 |    25,536      1,314 |    26,850 
           |     27.11      26.66 |     27.08 
-----------+----------------------+----------
         5 |    19,653      1,041 |    20,694 
           |     20.86      21.12 |     20.87 
-----------+----------------------+----------
     Total |    94,206      4,929 |    99,135 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

            |   Failure/censoring
            |     indicator for
            |  outcome: CPNS covid
            |         death
  Ethnicity |         0          1 |     Total
------------+----------------------+----------
      White |     9,764        508 |    10,272 
            |     10.22      10.14 |     10.21 
------------+----------------------+----------
South Asian |       156          8 |       164 
            |      0.16       0.16 |      0.16 
------------+----------------------+----------
      Black |        93          7 |       100 
            |      0.10       0.14 |      0.10 
------------+----------------------+----------
      Other |        20          4 |        24 
            |      0.02       0.08 |      0.02 
------------+----------------------+----------
      Mixed |     9,544        481 |    10,025 
            |      9.99       9.60 |      9.97 
------------+----------------------+----------
          . |    75,984      4,001 |    79,985 
            |     79.51      79.88 |     79.53 
------------+----------------------+----------
      Total |    95,561      5,009 |   100,570 
            |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |     outcome: ITU
   Grouped |       admission
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<40 |    26,332      1,407 |    27,739 
           |     27.56      28.06 |     27.58 
-----------+----------------------+----------
    40-<50 |    11,476        624 |    12,100 
           |     12.01      12.45 |     12.03 
-----------+----------------------+----------
    50-<60 |    21,034      1,112 |    22,146 
           |     22.01      22.18 |     22.02 
-----------+----------------------+----------
    60-<70 |     9,018        436 |     9,454 
           |      9.44       8.70 |      9.40 
-----------+----------------------+----------
    70-<80 |     7,947        398 |     8,345 
           |      8.32       7.94 |      8.30 
-----------+----------------------+----------
       80+ |    19,749      1,037 |    20,786 
           |     20.67      20.68 |     20.67 
-----------+----------------------+----------
     Total |    95,556      5,014 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |     outcome: ITU
           |       admission
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |    52,502      2,740 |    55,242 
           |     54.94      54.65 |     54.93 
-----------+----------------------+----------
         1 |    43,054      2,274 |    45,328 
           |     45.06      45.35 |     45.07 
-----------+----------------------+----------
     Total |    95,556      5,014 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   Failure/censoring
                     |     indicator for
                     |     outcome: ITU
                     |       admission
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |    14,502        719 |    15,221 
                     |     15.18      14.34 |     15.13 
---------------------+----------------------+----------
  Normal (18.5-24.9) |    18,288        937 |    19,225 
                     |     19.14      18.69 |     19.12 
---------------------+----------------------+----------
Overweight (25-29.9) |    18,052        918 |    18,970 
                     |     18.89      18.31 |     18.86 
---------------------+----------------------+----------
   Obese I (30-34.9) |    15,610        868 |    16,478 
                     |     16.34      17.31 |     16.38 
---------------------+----------------------+----------
  Obese II (35-39.9) |    14,657        799 |    15,456 
                     |     15.34      15.94 |     15.37 
---------------------+----------------------+----------
     Obese III (40+) |    14,447        773 |    15,220 
                     |     15.12      15.42 |     15.13 
---------------------+----------------------+----------
               Total |    95,556      5,014 |   100,570 
                     |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   Failure/censoring
             |     indicator for
             |     outcome: ITU
     Smoking |       admission
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |    28,589      1,501 |    30,090 
             |     29.92      29.94 |     29.92 
-------------+----------------------+----------
           . |    66,967      3,513 |    70,480 
             |     70.08      70.06 |     70.08 
-------------+----------------------+----------
       Total |    95,556      5,014 |   100,570 
             |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
  Severely |     outcome: ITU
obese (cat |       admission
        3) |         0          1 |     Total
-----------+----------------------+----------
         0 |    95,481      5,014 |   100,495 
           |     99.92     100.00 |     99.93 
-----------+----------------------+----------
         1 |        75          0 |        75 
           |      0.08       0.00 |      0.07 
-----------+----------------------+----------
     Total |    95,556      5,014 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |     outcome: ITU
   Current |       admission
    smoker |         0          1 |     Total
-----------+----------------------+----------
         0 |    28,589      1,501 |    30,090 
           |     29.92      29.94 |     29.92 
-----------+----------------------+----------
         . |    66,967      3,513 |    70,480 
           |     70.08      70.06 |     70.08 
-----------+----------------------+----------
     Total |    95,556      5,014 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
Respirator |     indicator for
 y disease |     outcome: ITU
    (excl. |       admission
   asthma) |         0          1 |     Total
-----------+----------------------+----------
         0 |    94,936      4,977 |    99,913 
           |     99.35      99.26 |     99.35 
-----------+----------------------+----------
         1 |       620         37 |       657 
           |      0.65       0.74 |      0.65 
-----------+----------------------+----------
     Total |    95,556      5,014 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |     outcome: ITU
           |       admission
    Asthma |         0          1 |     Total
-----------+----------------------+----------
         0 |    95,509      5,012 |   100,521 
           |     99.95      99.96 |     99.95 
-----------+----------------------+----------
         1 |        47          2 |        49 
           |      0.05       0.04 |      0.05 
-----------+----------------------+----------
     Total |    95,556      5,014 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |     outcome: ITU
     Heart |       admission
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    74,450      3,849 |    78,299 
           |     77.91      76.77 |     77.86 
-----------+----------------------+----------
         1 |    21,106      1,165 |    22,271 
           |     22.09      23.23 |     22.14 
-----------+----------------------+----------
     Total |    95,556      5,014 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |     outcome: ITU
           |       admission
  Diabetes |         0          1 |     Total
-----------+----------------------+----------
         0 |    69,110      3,582 |    72,692 
           |     72.32      71.44 |     72.28 
-----------+----------------------+----------
         1 |    26,446      1,432 |    27,878 
           |     27.68      28.56 |     27.72 
-----------+----------------------+----------
     Total |    95,556      5,014 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

    Cancer |   Failure/censoring
other than |     indicator for
haematolog |     outcome: ITU
   ical in |       admission
 last year |         0          1 |     Total
-----------+----------------------+----------
         0 |    95,553      5,013 |   100,566 
           |    100.00      99.98 |    100.00 
-----------+----------------------+----------
         1 |         3          1 |         4 
           |      0.00       0.02 |      0.00 
-----------+----------------------+----------
     Total |    95,556      5,014 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  Haematol |
malignancy |
, aplastic |
anaemia or |
      bone |   Failure/censoring
    marrow |     indicator for
transplant |     outcome: ITU
   in last |       admission
      year |         0          1 |     Total
-----------+----------------------+----------
         0 |    95,554      5,013 |   100,567 
           |    100.00      99.98 |    100.00 
-----------+----------------------+----------
         1 |         2          1 |         3 
           |      0.00       0.02 |      0.00 
-----------+----------------------+----------
     Total |    95,556      5,014 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |     outcome: ITU
           |       admission
     Liver |         0          1 |     Total
-----------+----------------------+----------
         0 |    86,044      4,465 |    90,509 
           |     90.05      89.05 |     90.00 
-----------+----------------------+----------
         1 |     9,512        549 |    10,061 
           |      9.95      10.95 |     10.00 
-----------+----------------------+----------
     Total |    95,556      5,014 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

     Neuro |   Failure/censoring
 condition |     indicator for
other than |     outcome: ITU
stroke/dem |       admission
     entia |         0          1 |     Total
-----------+----------------------+----------
         0 |    95,299      4,992 |   100,291 
           |     99.73      99.56 |     99.72 
-----------+----------------------+----------
         1 |       257         22 |       279 
           |      0.27       0.44 |      0.28 
-----------+----------------------+----------
     Total |    95,556      5,014 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
           |     outcome: ITU
    Kidney |       admission
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    90,723      4,745 |    95,468 
           |     94.94      94.64 |     94.93 
-----------+----------------------+----------
         1 |     4,833        269 |     5,102 
           |      5.06       5.36 |      5.07 
-----------+----------------------+----------
     Total |    95,556      5,014 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
           |     indicator for
     Organ |     outcome: ITU
transplant |       admission
 recipient |         0          1 |     Total
-----------+----------------------+----------
         0 |    95,539      5,012 |   100,551 
           |     99.98      99.96 |     99.98 
-----------+----------------------+----------
         1 |        17          2 |        19 
           |      0.02       0.04 |      0.02 
-----------+----------------------+----------
     Total |    95,556      5,014 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

    Spleen |   Failure/censoring
  problems |     indicator for
(dysplenia |     outcome: ITU
  , sickle |       admission
     cell) |         0          1 |     Total
-----------+----------------------+----------
         0 |    86,032      4,498 |    90,530 
           |     90.03      89.71 |     90.02 
-----------+----------------------+----------
         1 |     9,524        516 |    10,040 
           |      9.97      10.29 |      9.98 
-----------+----------------------+----------
     Total |    95,556      5,014 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
  RA, SLE, |     indicator for
 Psoriasis |     outcome: ITU
(autoimmun |       admission
e disease) |         0          1 |     Total
-----------+----------------------+----------
         0 |    94,938      4,981 |    99,919 
           |     99.35      99.34 |     99.35 
-----------+----------------------+----------
         1 |       618         33 |       651 
           |      0.65       0.66 |      0.65 
-----------+----------------------+----------
     Total |    95,556      5,014 |   100,570 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   Failure/censoring
  Index of |     indicator for
  Multiple |     outcome: ITU
Deprivatio |       admission
   n (IMD) |         0          1 |     Total
-----------+----------------------+----------
         1 |    17,724        904 |    18,628 
           |     18.82      18.26 |     18.79 
-----------+----------------------+----------
         2 |    18,381        983 |    19,364 
           |     19.52      19.85 |     19.53 
-----------+----------------------+----------
         3 |    12,929        670 |    13,599 
           |     13.73      13.53 |     13.72 
-----------+----------------------+----------
         4 |    25,442      1,408 |    26,850 
           |     27.01      28.43 |     27.08 
-----------+----------------------+----------
         5 |    19,707        987 |    20,694 
           |     20.92      19.93 |     20.87 
-----------+----------------------+----------
     Total |    94,183      4,952 |    99,135 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

            |   Failure/censoring
            |     indicator for
            |     outcome: ITU
            |       admission
  Ethnicity |         0          1 |     Total
------------+----------------------+----------
      White |     9,774        498 |    10,272 
            |     10.23       9.93 |     10.21 
------------+----------------------+----------
South Asian |       153         11 |       164 
            |      0.16       0.22 |      0.16 
------------+----------------------+----------
      Black |        94          6 |       100 
            |      0.10       0.12 |      0.10 
------------+----------------------+----------
      Other |        24          0 |        24 
            |      0.03       0.00 |      0.02 
------------+----------------------+----------
      Mixed |     9,478        547 |    10,025 
            |      9.92      10.91 |      9.97 
------------+----------------------+----------
          . |    76,033      3,952 |    79,985 
            |     79.57      78.82 |     79.53 
------------+----------------------+----------
      Total |    95,556      5,014 |   100,570 
            |    100.00     100.00 |    100.00 

. 
. 
. 
. * Close the log file
. log close
      name:  <unnamed>
       log:  C:\Github\opencorona-risk-factors-research\analysis\output/an_descriptive_tables.log
  log type:  text
 closed on:  23 Apr 2020, 11:05:08
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
