--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\emsuewil\Documents\Work\Covid\Risk profile\Git\opencorona-risk-factors-research\analysis\output/an_descriptive_tables.log
  log type:  text
 opened on:  17 Apr 2020, 11:07:04

. 
. 
. 
. **********************************
. *  Distribution in whole cohort  *
. **********************************
. 
. 
. * Demographics
. summ age

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |    141,510    54.14491    21.16692         18        105

. tab agegroup

Grouped age |      Freq.     Percent        Cum.
------------+-----------------------------------
     18-<40 |     35,665       25.20       25.20
     40-<50 |     27,420       19.38       44.58
     50-<60 |     29,777       21.04       65.62
     60-<70 |     14,464       10.22       75.84
     70-<80 |     11,763        8.31       84.16
        80+ |     22,421       15.84      100.00
------------+-----------------------------------
      Total |    141,510      100.00

. tab male

       Male |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     77,697       54.91       54.91
          1 |     63,813       45.09      100.00
------------+-----------------------------------
      Total |    141,510      100.00

. tab bmicat

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
   Underweight (<18) |      8,960        7.54        7.54
  Normal (15.4-24.9) |     21,060       17.71       25.25
Overweight (25-29.9) |     18,482       15.54       40.79
   Obese I (30-34.9) |     18,231       15.33       56.13
  Obese II (35-39.9) |     16,528       13.90       70.03
     Obese III (40+) |     35,639       29.97      100.00
---------------------+-----------------------------------
               Total |    118,900      100.00

. tab bmicat, m

         Grouped BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
   Underweight (<18) |      8,960        6.33        6.33
  Normal (15.4-24.9) |     21,060       14.88       21.21
Overweight (25-29.9) |     18,482       13.06       34.27
   Obese I (30-34.9) |     18,231       12.88       47.16
  Obese II (35-39.9) |     16,528       11.68       58.84
     Obese III (40+) |     35,639       25.18       84.02
        Unknown (.u) |     22,610       15.98      100.00
---------------------+-----------------------------------
               Total |    141,510      100.00

. tab smoke

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |     42,615       33.89       33.89
      Former |     59,392       47.24       81.13
     Current |     23,729       18.87      100.00
-------------+-----------------------------------
       Total |    125,736      100.00

. tab smoke, m

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |     42,615       30.11       30.11
      Former |     59,392       41.97       72.08
     Current |     23,729       16.77       88.85
Unknown (.u) |     15,774       11.15      100.00
-------------+-----------------------------------
       Total |    141,510      100.00

. 
. * Comorbidities
. tab chronic_respiratory_disease

Respiratory |
    disease |
     (excl. |
    asthma) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    140,591       99.35       99.35
          1 |        919        0.65      100.00
------------+-----------------------------------
      Total |    141,510      100.00

. tab asthma

     Asthma |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    141,510      100.00      100.00
------------+-----------------------------------
      Total |    141,510      100.00

. tab chronic_cardiac_disease

      Heart |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    118,631       83.83       83.83
          1 |     22,879       16.17      100.00
------------+-----------------------------------
      Total |    141,510      100.00

. tab diabetes

   Diabetes |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     99,481       70.30       70.30
          1 |     42,029       29.70      100.00
------------+-----------------------------------
      Total |    141,510      100.00

. tab lung_cancer

Lung cancer |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    141,476       99.98       99.98
          1 |         34        0.02      100.00
------------+-----------------------------------
      Total |    141,510      100.00

. tab haem_cancer

      Haem. |
     cancer |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    131,356       92.82       92.82
          1 |     10,154        7.18      100.00
------------+-----------------------------------
      Total |    141,510      100.00

. tab other_cancer

 Any cancer |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    140,753       99.47       99.47
          1 |        757        0.53      100.00
------------+-----------------------------------
      Total |    141,510      100.00

. tab cancer

     Cancer |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    130,579       92.28       92.28
          1 |     10,931        7.72      100.00
------------+-----------------------------------
      Total |    141,510      100.00

. tab chronic_liver_disease

      Liver |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    131,437       92.88       92.88
          1 |     10,073        7.12      100.00
------------+-----------------------------------
      Total |    141,510      100.00

. tab neurological_condition

Neurologica |
  l disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    140,591       99.35       99.35
          1 |        919        0.65      100.00
------------+-----------------------------------
      Total |    141,510      100.00

. tab chronic_kidney_disease

     Kidney |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    141,510      100.00      100.00
------------+-----------------------------------
      Total |    141,510      100.00

. tab organ_transplant

      Organ |
 transplant |
  recipient |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    141,489       99.99       99.99
          1 |         21        0.01      100.00
------------+-----------------------------------
      Total |    141,510      100.00

. tab dysplenia

  Dysplenia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    131,464       92.90       92.90
          1 |     10,046        7.10      100.00
------------+-----------------------------------
      Total |    141,510      100.00

. tab sickle_cell

Sickle cell |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    141,509      100.00      100.00
          1 |          1        0.00      100.00
------------+-----------------------------------
      Total |    141,510      100.00

. tab spleen

     Spleen |
   problems |
(dysplenia, |
     sickle |
      cell) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    131,463       92.90       92.90
          1 |     10,047        7.10      100.00
------------+-----------------------------------
      Total |    141,510      100.00

. tab ra_sle_psoriasis

   RA, SLE, |
  Psoriasis |
(autoimmune |
   disease) |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    140,634       99.38       99.38
          1 |        876        0.62      100.00
------------+-----------------------------------
      Total |    141,510      100.00

. tab immuno_condition

        Any |
immunocondi |
       tion |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    140,591       99.35       99.35
          1 |        919        0.65      100.00
------------+-----------------------------------
      Total |    141,510      100.00

. 
. summ bp_sys,  detail

                   Systolic blood pressure
-------------------------------------------------------------
      Percentiles      Smallest
 1%     75.24442       47.21651
 5%     85.35513       47.31984
10%     90.77205       49.14478       Obs             141,510
25%     99.90198         52.278       Sum of Wgt.     141,510

50%     110.0796                      Mean           110.0393
                        Largest       Std. Dev.      15.00561
75%     120.2135       169.2426
90%     129.3083       169.6917       Variance       225.1683
95%      134.682       169.6974       Skewness       -.005095
99%     144.9184       175.9461       Kurtosis        2.97025

. summ bp_dias, detail

                  Diastolic blood pressure
-------------------------------------------------------------
      Percentiles      Smallest
 1%     44.99781       14.61039
 5%     55.27443       15.76301
10%     60.75107       16.01794       Obs             141,510
25%      69.7943       19.57638       Sum of Wgt.     141,510

50%     80.02042                      Mean           79.95815
                        Largest       Std. Dev.      15.01944
75%     90.05645       142.9181
90%     99.16095       143.8417       Variance       225.5835
95%     104.6892       146.3899       Skewness       .0013335
99%     114.7521       147.2473       Kurtosis       3.008478

. 
. * Adjustment variables 
. tab imd 

   Index of |
   Multiple |
Deprivation |
      (IMD) |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     26,451       18.69       18.69
          2 |     29,406       20.78       39.47
          3 |     28,910       20.43       59.90
          4 |     28,122       19.87       79.77
          5 |     28,621       20.23      100.00
------------+-----------------------------------
      Total |    141,510      100.00

. *tab ethnicity
. tab ethnicity, m

   Ethnicity |      Freq.     Percent        Cum.
-------------+-----------------------------------
       White |     42,180       29.81       29.81
       Black |     19,847       14.03       43.83
       Asian |      7,958        5.62       49.46
       Mixed |      7,142        5.05       54.50
       Other |      6,456        4.56       59.07
Unknown (.u) |     57,927       40.93      100.00
-------------+-----------------------------------
       Total |    141,510      100.00

. *tab urban
. 
. 
. * Outcomes
. tab died

 Death from |
   Covid-19 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    127,422       90.04       90.04
          1 |     14,088        9.96      100.00
------------+-----------------------------------
      Total |    141,510      100.00

. tab itu

Admitted to |
    ITU for |
   Covid-19 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    134,535       95.07       95.07
          1 |      6,975        4.93      100.00
------------+-----------------------------------
      Total |    141,510      100.00

. tab hosp

Hospitalise |
      d for |
   Covid-19 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    113,513       80.22       80.22
          1 |     27,997       19.78      100.00
------------+-----------------------------------
      Total |    141,510      100.00

. * tab compoutcome
. 
. 
. 
. **********************************
. *  Number (%) with each outcome  *
. **********************************
. 
. foreach outvar of varlist died hosp itu {
  2. 
. *** Repeat for each outcome
. 
.         * Demographics
.         tab agegroup                                                    `outvar', row
  3.         tab male                                                                `outvar', row
  4.         tab bmicat                                                              `outvar', row m 
  5.         tab smoke                                                               `outvar', row m
  6. 
.         * Comorbidities
.         tab chronic_respiratory_disease                 `outvar', row
  7.         tab asthma                                                              `outvar', row
  8.         tab chronic_cardiac_disease                     `outvar', row
  9.         tab diabetes                                                    `outvar', row
 10.         tab lung_cancer                                                 `outvar', row
 11.         tab haem_cancer                                                 `outvar', row
 12.         tab other_cancer                                                `outvar', row
 13.         tab cancer                                                              `outvar', row
 14.         tab chronic_liver_disease                               `outvar', row
 15.         tab neurological_condition                              `outvar', row
 16.         tab chronic_kidney_disease                              `outvar', row
 17.         tab organ_transplant                                    `outvar', row
 18.         tab dysplenia                                                   `outvar', row
 19.         tab sickle_cell                                                 `outvar', row
 20.         tab spleen                                                              `outvar', row
 21.         tab immuno_condition                                    `outvar', row
 22.         tab ra_sle_psoriasis                                    `outvar', row
 23.         
.         * Adjustment variables 
.         tab imd                                                                 `outvar', row
 24.         *tab ethnicity                                                  `outvar', row m
.         *tab urban                                                              `outvar', row
. }

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Grouped |  Death from Covid-19
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<40 |    32,095      3,570 |    35,665 
           |     89.99      10.01 |    100.00 
-----------+----------------------+----------
    40-<50 |    24,722      2,698 |    27,420 
           |     90.16       9.84 |    100.00 
-----------+----------------------+----------
    50-<60 |    26,816      2,961 |    29,777 
           |     90.06       9.94 |    100.00 
-----------+----------------------+----------
    60-<70 |    13,011      1,453 |    14,464 
           |     89.95      10.05 |    100.00 
-----------+----------------------+----------
    70-<80 |    10,574      1,189 |    11,763 
           |     89.89      10.11 |    100.00 
-----------+----------------------+----------
       80+ |    20,204      2,217 |    22,421 
           |     90.11       9.89 |    100.00 
-----------+----------------------+----------
     Total |   127,422     14,088 |   141,510 
           |     90.04       9.96 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Death from Covid-19
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |    70,005      7,692 |    77,697 
           |     90.10       9.90 |    100.00 
-----------+----------------------+----------
         1 |    57,417      6,396 |    63,813 
           |     89.98      10.02 |    100.00 
-----------+----------------------+----------
     Total |   127,422     14,088 |   141,510 
           |     90.04       9.96 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                     |  Death from Covid-19
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
   Underweight (<18) |     8,099        861 |     8,960 
                     |     90.39       9.61 |    100.00 
---------------------+----------------------+----------
  Normal (15.4-24.9) |    18,939      2,121 |    21,060 
                     |     89.93      10.07 |    100.00 
---------------------+----------------------+----------
Overweight (25-29.9) |    16,587      1,895 |    18,482 
                     |     89.75      10.25 |    100.00 
---------------------+----------------------+----------
   Obese I (30-34.9) |    16,436      1,795 |    18,231 
                     |     90.15       9.85 |    100.00 
---------------------+----------------------+----------
  Obese II (35-39.9) |    14,854      1,674 |    16,528 
                     |     89.87      10.13 |    100.00 
---------------------+----------------------+----------
     Obese III (40+) |    32,104      3,535 |    35,639 
                     |     90.08       9.92 |    100.00 
---------------------+----------------------+----------
        Unknown (.u) |    20,403      2,207 |    22,610 
                     |     90.24       9.76 |    100.00 
---------------------+----------------------+----------
               Total |   127,422     14,088 |   141,510 
                     |     90.04       9.96 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Smoking |  Death from Covid-19
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |    38,287      4,328 |    42,615 
             |     89.84      10.16 |    100.00 
-------------+----------------------+----------
      Former |    53,496      5,896 |    59,392 
             |     90.07       9.93 |    100.00 
-------------+----------------------+----------
     Current |    21,411      2,318 |    23,729 
             |     90.23       9.77 |    100.00 
-------------+----------------------+----------
Unknown (.u) |    14,228      1,546 |    15,774 
             |     90.20       9.80 |    100.00 
-------------+----------------------+----------
       Total |   127,422     14,088 |   141,510 
             |     90.04       9.96 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

Respirator |
 y disease |
    (excl. |  Death from Covid-19
   asthma) |         0          1 |     Total
-----------+----------------------+----------
         0 |   126,580     14,011 |   140,591 
           |     90.03       9.97 |    100.00 
-----------+----------------------+----------
         1 |       842         77 |       919 
           |     91.62       8.38 |    100.00 
-----------+----------------------+----------
     Total |   127,422     14,088 |   141,510 
           |     90.04       9.96 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Death from Covid-19
    Asthma |         0          1 |     Total
-----------+----------------------+----------
         0 |   127,422     14,088 |   141,510 
           |     90.04       9.96 |    100.00 
-----------+----------------------+----------
     Total |   127,422     14,088 |   141,510 
           |     90.04       9.96 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Heart |  Death from Covid-19
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |   106,783     11,848 |   118,631 
           |     90.01       9.99 |    100.00 
-----------+----------------------+----------
         1 |    20,639      2,240 |    22,879 
           |     90.21       9.79 |    100.00 
-----------+----------------------+----------
     Total |   127,422     14,088 |   141,510 
           |     90.04       9.96 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Death from Covid-19
  Diabetes |         0          1 |     Total
-----------+----------------------+----------
         0 |    89,539      9,942 |    99,481 
           |     90.01       9.99 |    100.00 
-----------+----------------------+----------
         1 |    37,883      4,146 |    42,029 
           |     90.14       9.86 |    100.00 
-----------+----------------------+----------
     Total |   127,422     14,088 |   141,510 
           |     90.04       9.96 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

      Lung |  Death from Covid-19
    cancer |         0          1 |     Total
-----------+----------------------+----------
         0 |   127,389     14,087 |   141,476 
           |     90.04       9.96 |    100.00 
-----------+----------------------+----------
         1 |        33          1 |        34 
           |     97.06       2.94 |    100.00 
-----------+----------------------+----------
     Total |   127,422     14,088 |   141,510 
           |     90.04       9.96 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Haem. |  Death from Covid-19
    cancer |         0          1 |     Total
-----------+----------------------+----------
         0 |   118,239     13,117 |   131,356 
           |     90.01       9.99 |    100.00 
-----------+----------------------+----------
         1 |     9,183        971 |    10,154 
           |     90.44       9.56 |    100.00 
-----------+----------------------+----------
     Total |   127,422     14,088 |   141,510 
           |     90.04       9.96 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Death from Covid-19
Any cancer |         0          1 |     Total
-----------+----------------------+----------
         0 |   126,734     14,019 |   140,753 
           |     90.04       9.96 |    100.00 
-----------+----------------------+----------
         1 |       688         69 |       757 
           |     90.89       9.11 |    100.00 
-----------+----------------------+----------
     Total |   127,422     14,088 |   141,510 
           |     90.04       9.96 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Death from Covid-19
    Cancer |         0          1 |     Total
-----------+----------------------+----------
         0 |   117,532     13,047 |   130,579 
           |     90.01       9.99 |    100.00 
-----------+----------------------+----------
         1 |     9,890      1,041 |    10,931 
           |     90.48       9.52 |    100.00 
-----------+----------------------+----------
     Total |   127,422     14,088 |   141,510 
           |     90.04       9.96 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Death from Covid-19
     Liver |         0          1 |     Total
-----------+----------------------+----------
         0 |   118,310     13,127 |   131,437 
           |     90.01       9.99 |    100.00 
-----------+----------------------+----------
         1 |     9,112        961 |    10,073 
           |     90.46       9.54 |    100.00 
-----------+----------------------+----------
     Total |   127,422     14,088 |   141,510 
           |     90.04       9.96 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

Neurologic |  Death from Covid-19
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 |   126,580     14,011 |   140,591 
           |     90.03       9.97 |    100.00 
-----------+----------------------+----------
         1 |       842         77 |       919 
           |     91.62       8.38 |    100.00 
-----------+----------------------+----------
     Total |   127,422     14,088 |   141,510 
           |     90.04       9.96 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

    Kidney |  Death from Covid-19
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |   127,422     14,088 |   141,510 
           |     90.04       9.96 |    100.00 
-----------+----------------------+----------
     Total |   127,422     14,088 |   141,510 
           |     90.04       9.96 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Organ |
transplant |  Death from Covid-19
 recipient |         0          1 |     Total
-----------+----------------------+----------
         0 |   127,405     14,084 |   141,489 
           |     90.05       9.95 |    100.00 
-----------+----------------------+----------
         1 |        17          4 |        21 
           |     80.95      19.05 |    100.00 
-----------+----------------------+----------
     Total |   127,422     14,088 |   141,510 
           |     90.04       9.96 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Death from Covid-19
 Dysplenia |         0          1 |     Total
-----------+----------------------+----------
         0 |   118,367     13,097 |   131,464 
           |     90.04       9.96 |    100.00 
-----------+----------------------+----------
         1 |     9,055        991 |    10,046 
           |     90.14       9.86 |    100.00 
-----------+----------------------+----------
     Total |   127,422     14,088 |   141,510 
           |     90.04       9.96 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

    Sickle |  Death from Covid-19
      cell |         0          1 |     Total
-----------+----------------------+----------
         0 |   127,421     14,088 |   141,509 
           |     90.04       9.96 |    100.00 
-----------+----------------------+----------
         1 |         1          0 |         1 
           |    100.00       0.00 |    100.00 
-----------+----------------------+----------
     Total |   127,422     14,088 |   141,510 
           |     90.04       9.96 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

    Spleen |
  problems |
(dysplenia |
  , sickle |  Death from Covid-19
     cell) |         0          1 |     Total
-----------+----------------------+----------
         0 |   118,366     13,097 |   131,463 
           |     90.04       9.96 |    100.00 
-----------+----------------------+----------
         1 |     9,056        991 |    10,047 
           |     90.14       9.86 |    100.00 
-----------+----------------------+----------
     Total |   127,422     14,088 |   141,510 
           |     90.04       9.96 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

       Any |
immunocond |  Death from Covid-19
     ition |         0          1 |     Total
-----------+----------------------+----------
         0 |   126,580     14,011 |   140,591 
           |     90.03       9.97 |    100.00 
-----------+----------------------+----------
         1 |       842         77 |       919 
           |     91.62       8.38 |    100.00 
-----------+----------------------+----------
     Total |   127,422     14,088 |   141,510 
           |     90.04       9.96 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

  RA, SLE, |
 Psoriasis |
(autoimmun |  Death from Covid-19
e disease) |         0          1 |     Total
-----------+----------------------+----------
         0 |   126,622     14,012 |   140,634 
           |     90.04       9.96 |    100.00 
-----------+----------------------+----------
         1 |       800         76 |       876 
           |     91.32       8.68 |    100.00 
-----------+----------------------+----------
     Total |   127,422     14,088 |   141,510 
           |     90.04       9.96 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

  Index of |
  Multiple |
Deprivatio |  Death from Covid-19
   n (IMD) |         0          1 |     Total
-----------+----------------------+----------
         1 |    23,834      2,617 |    26,451 
           |     90.11       9.89 |    100.00 
-----------+----------------------+----------
         2 |    26,462      2,944 |    29,406 
           |     89.99      10.01 |    100.00 
-----------+----------------------+----------
         3 |    25,999      2,911 |    28,910 
           |     89.93      10.07 |    100.00 
-----------+----------------------+----------
         4 |    25,315      2,807 |    28,122 
           |     90.02       9.98 |    100.00 
-----------+----------------------+----------
         5 |    25,812      2,809 |    28,621 
           |     90.19       9.81 |    100.00 
-----------+----------------------+----------
     Total |   127,422     14,088 |   141,510 
           |     90.04       9.96 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Hospitalised for
   Grouped |       Covid-19
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<40 |    28,601      7,064 |    35,665 
           |     80.19      19.81 |    100.00 
-----------+----------------------+----------
    40-<50 |    22,077      5,343 |    27,420 
           |     80.51      19.49 |    100.00 
-----------+----------------------+----------
    50-<60 |    23,836      5,941 |    29,777 
           |     80.05      19.95 |    100.00 
-----------+----------------------+----------
    60-<70 |    11,599      2,865 |    14,464 
           |     80.19      19.81 |    100.00 
-----------+----------------------+----------
    70-<80 |     9,386      2,377 |    11,763 
           |     79.79      20.21 |    100.00 
-----------+----------------------+----------
       80+ |    18,014      4,407 |    22,421 
           |     80.34      19.66 |    100.00 
-----------+----------------------+----------
     Total |   113,513     27,997 |   141,510 
           |     80.22      19.78 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Hospitalised for
           |       Covid-19
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |    62,377     15,320 |    77,697 
           |     80.28      19.72 |    100.00 
-----------+----------------------+----------
         1 |    51,136     12,677 |    63,813 
           |     80.13      19.87 |    100.00 
-----------+----------------------+----------
     Total |   113,513     27,997 |   141,510 
           |     80.22      19.78 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                     |   Hospitalised for
                     |       Covid-19
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
   Underweight (<18) |     7,098      1,862 |     8,960 
                     |     79.22      20.78 |    100.00 
---------------------+----------------------+----------
  Normal (15.4-24.9) |    16,902      4,158 |    21,060 
                     |     80.26      19.74 |    100.00 
---------------------+----------------------+----------
Overweight (25-29.9) |    14,888      3,594 |    18,482 
                     |     80.55      19.45 |    100.00 
---------------------+----------------------+----------
   Obese I (30-34.9) |    14,632      3,599 |    18,231 
                     |     80.26      19.74 |    100.00 
---------------------+----------------------+----------
  Obese II (35-39.9) |    13,187      3,341 |    16,528 
                     |     79.79      20.21 |    100.00 
---------------------+----------------------+----------
     Obese III (40+) |    28,611      7,028 |    35,639 
                     |     80.28      19.72 |    100.00 
---------------------+----------------------+----------
        Unknown (.u) |    18,195      4,415 |    22,610 
                     |     80.47      19.53 |    100.00 
---------------------+----------------------+----------
               Total |   113,513     27,997 |   141,510 
                     |     80.22      19.78 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |   Hospitalised for
     Smoking |       Covid-19
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |    34,190      8,425 |    42,615 
             |     80.23      19.77 |    100.00 
-------------+----------------------+----------
      Former |    47,557     11,835 |    59,392 
             |     80.07      19.93 |    100.00 
-------------+----------------------+----------
     Current |    19,059      4,670 |    23,729 
             |     80.32      19.68 |    100.00 
-------------+----------------------+----------
Unknown (.u) |    12,707      3,067 |    15,774 
             |     80.56      19.44 |    100.00 
-------------+----------------------+----------
       Total |   113,513     27,997 |   141,510 
             |     80.22      19.78 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

Respirator |
 y disease |   Hospitalised for
    (excl. |       Covid-19
   asthma) |         0          1 |     Total
-----------+----------------------+----------
         0 |   112,756     27,835 |   140,591 
           |     80.20      19.80 |    100.00 
-----------+----------------------+----------
         1 |       757        162 |       919 
           |     82.37      17.63 |    100.00 
-----------+----------------------+----------
     Total |   113,513     27,997 |   141,510 
           |     80.22      19.78 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Hospitalised for
           |       Covid-19
    Asthma |         0          1 |     Total
-----------+----------------------+----------
         0 |   113,513     27,997 |   141,510 
           |     80.22      19.78 |    100.00 
-----------+----------------------+----------
     Total |   113,513     27,997 |   141,510 
           |     80.22      19.78 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Hospitalised for
     Heart |       Covid-19
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    95,228     23,403 |   118,631 
           |     80.27      19.73 |    100.00 
-----------+----------------------+----------
         1 |    18,285      4,594 |    22,879 
           |     79.92      20.08 |    100.00 
-----------+----------------------+----------
     Total |   113,513     27,997 |   141,510 
           |     80.22      19.78 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Hospitalised for
           |       Covid-19
  Diabetes |         0          1 |     Total
-----------+----------------------+----------
         0 |    79,889     19,592 |    99,481 
           |     80.31      19.69 |    100.00 
-----------+----------------------+----------
         1 |    33,624      8,405 |    42,029 
           |     80.00      20.00 |    100.00 
-----------+----------------------+----------
     Total |   113,513     27,997 |   141,510 
           |     80.22      19.78 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Hospitalised for
      Lung |       Covid-19
    cancer |         0          1 |     Total
-----------+----------------------+----------
         0 |   113,483     27,993 |   141,476 
           |     80.21      19.79 |    100.00 
-----------+----------------------+----------
         1 |        30          4 |        34 
           |     88.24      11.76 |    100.00 
-----------+----------------------+----------
     Total |   113,513     27,997 |   141,510 
           |     80.22      19.78 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Hospitalised for
     Haem. |       Covid-19
    cancer |         0          1 |     Total
-----------+----------------------+----------
         0 |   105,382     25,974 |   131,356 
           |     80.23      19.77 |    100.00 
-----------+----------------------+----------
         1 |     8,131      2,023 |    10,154 
           |     80.08      19.92 |    100.00 
-----------+----------------------+----------
     Total |   113,513     27,997 |   141,510 
           |     80.22      19.78 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Hospitalised for
           |       Covid-19
Any cancer |         0          1 |     Total
-----------+----------------------+----------
         0 |   112,908     27,845 |   140,753 
           |     80.22      19.78 |    100.00 
-----------+----------------------+----------
         1 |       605        152 |       757 
           |     79.92      20.08 |    100.00 
-----------+----------------------+----------
     Total |   113,513     27,997 |   141,510 
           |     80.22      19.78 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Hospitalised for
           |       Covid-19
    Cancer |         0          1 |     Total
-----------+----------------------+----------
         0 |   104,760     25,819 |   130,579 
           |     80.23      19.77 |    100.00 
-----------+----------------------+----------
         1 |     8,753      2,178 |    10,931 
           |     80.08      19.92 |    100.00 
-----------+----------------------+----------
     Total |   113,513     27,997 |   141,510 
           |     80.22      19.78 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Hospitalised for
           |       Covid-19
     Liver |         0          1 |     Total
-----------+----------------------+----------
         0 |   105,452     25,985 |   131,437 
           |     80.23      19.77 |    100.00 
-----------+----------------------+----------
         1 |     8,061      2,012 |    10,073 
           |     80.03      19.97 |    100.00 
-----------+----------------------+----------
     Total |   113,513     27,997 |   141,510 
           |     80.22      19.78 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Hospitalised for
Neurologic |       Covid-19
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 |   112,756     27,835 |   140,591 
           |     80.20      19.80 |    100.00 
-----------+----------------------+----------
         1 |       757        162 |       919 
           |     82.37      17.63 |    100.00 
-----------+----------------------+----------
     Total |   113,513     27,997 |   141,510 
           |     80.22      19.78 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Hospitalised for
    Kidney |       Covid-19
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |   113,513     27,997 |   141,510 
           |     80.22      19.78 |    100.00 
-----------+----------------------+----------
     Total |   113,513     27,997 |   141,510 
           |     80.22      19.78 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Organ |   Hospitalised for
transplant |       Covid-19
 recipient |         0          1 |     Total
-----------+----------------------+----------
         0 |   113,496     27,993 |   141,489 
           |     80.22      19.78 |    100.00 
-----------+----------------------+----------
         1 |        17          4 |        21 
           |     80.95      19.05 |    100.00 
-----------+----------------------+----------
     Total |   113,513     27,997 |   141,510 
           |     80.22      19.78 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Hospitalised for
           |       Covid-19
 Dysplenia |         0          1 |     Total
-----------+----------------------+----------
         0 |   105,506     25,958 |   131,464 
           |     80.25      19.75 |    100.00 
-----------+----------------------+----------
         1 |     8,007      2,039 |    10,046 
           |     79.70      20.30 |    100.00 
-----------+----------------------+----------
     Total |   113,513     27,997 |   141,510 
           |     80.22      19.78 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |   Hospitalised for
    Sickle |       Covid-19
      cell |         0          1 |     Total
-----------+----------------------+----------
         0 |   113,513     27,996 |   141,509 
           |     80.22      19.78 |    100.00 
-----------+----------------------+----------
         1 |         0          1 |         1 
           |      0.00     100.00 |    100.00 
-----------+----------------------+----------
     Total |   113,513     27,997 |   141,510 
           |     80.22      19.78 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

    Spleen |
  problems |
(dysplenia |   Hospitalised for
  , sickle |       Covid-19
     cell) |         0          1 |     Total
-----------+----------------------+----------
         0 |   105,506     25,957 |   131,463 
           |     80.26      19.74 |    100.00 
-----------+----------------------+----------
         1 |     8,007      2,040 |    10,047 
           |     79.70      20.30 |    100.00 
-----------+----------------------+----------
     Total |   113,513     27,997 |   141,510 
           |     80.22      19.78 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

       Any |   Hospitalised for
immunocond |       Covid-19
     ition |         0          1 |     Total
-----------+----------------------+----------
         0 |   112,756     27,835 |   140,591 
           |     80.20      19.80 |    100.00 
-----------+----------------------+----------
         1 |       757        162 |       919 
           |     82.37      17.63 |    100.00 
-----------+----------------------+----------
     Total |   113,513     27,997 |   141,510 
           |     80.22      19.78 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

  RA, SLE, |
 Psoriasis |   Hospitalised for
(autoimmun |       Covid-19
e disease) |         0          1 |     Total
-----------+----------------------+----------
         0 |   112,827     27,807 |   140,634 
           |     80.23      19.77 |    100.00 
-----------+----------------------+----------
         1 |       686        190 |       876 
           |     78.31      21.69 |    100.00 
-----------+----------------------+----------
     Total |   113,513     27,997 |   141,510 
           |     80.22      19.78 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

  Index of |
  Multiple |   Hospitalised for
Deprivatio |       Covid-19
   n (IMD) |         0          1 |     Total
-----------+----------------------+----------
         1 |    21,159      5,292 |    26,451 
           |     79.99      20.01 |    100.00 
-----------+----------------------+----------
         2 |    23,604      5,802 |    29,406 
           |     80.27      19.73 |    100.00 
-----------+----------------------+----------
         3 |    23,170      5,740 |    28,910 
           |     80.15      19.85 |    100.00 
-----------+----------------------+----------
         4 |    22,613      5,509 |    28,122 
           |     80.41      19.59 |    100.00 
-----------+----------------------+----------
         5 |    22,967      5,654 |    28,621 
           |     80.25      19.75 |    100.00 
-----------+----------------------+----------
     Total |   113,513     27,997 |   141,510 
           |     80.22      19.78 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Admitted to ITU for
   Grouped |       Covid-19
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<40 |    33,936      1,729 |    35,665 
           |     95.15       4.85 |    100.00 
-----------+----------------------+----------
    40-<50 |    26,069      1,351 |    27,420 
           |     95.07       4.93 |    100.00 
-----------+----------------------+----------
    50-<60 |    28,306      1,471 |    29,777 
           |     95.06       4.94 |    100.00 
-----------+----------------------+----------
    60-<70 |    13,751        713 |    14,464 
           |     95.07       4.93 |    100.00 
-----------+----------------------+----------
    70-<80 |    11,193        570 |    11,763 
           |     95.15       4.85 |    100.00 
-----------+----------------------+----------
       80+ |    21,280      1,141 |    22,421 
           |     94.91       5.09 |    100.00 
-----------+----------------------+----------
     Total |   134,535      6,975 |   141,510 
           |     95.07       4.93 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Admitted to ITU for
           |       Covid-19
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |    73,885      3,812 |    77,697 
           |     95.09       4.91 |    100.00 
-----------+----------------------+----------
         1 |    60,650      3,163 |    63,813 
           |     95.04       4.96 |    100.00 
-----------+----------------------+----------
     Total |   134,535      6,975 |   141,510 
           |     95.07       4.93 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                     |  Admitted to ITU for
                     |       Covid-19
         Grouped BMI |         0          1 |     Total
---------------------+----------------------+----------
   Underweight (<18) |     8,519        441 |     8,960 
                     |     95.08       4.92 |    100.00 
---------------------+----------------------+----------
  Normal (15.4-24.9) |    20,036      1,024 |    21,060 
                     |     95.14       4.86 |    100.00 
---------------------+----------------------+----------
Overweight (25-29.9) |    17,582        900 |    18,482 
                     |     95.13       4.87 |    100.00 
---------------------+----------------------+----------
   Obese I (30-34.9) |    17,302        929 |    18,231 
                     |     94.90       5.10 |    100.00 
---------------------+----------------------+----------
  Obese II (35-39.9) |    15,713        815 |    16,528 
                     |     95.07       4.93 |    100.00 
---------------------+----------------------+----------
     Obese III (40+) |    33,909      1,730 |    35,639 
                     |     95.15       4.85 |    100.00 
---------------------+----------------------+----------
        Unknown (.u) |    21,474      1,136 |    22,610 
                     |     94.98       5.02 |    100.00 
---------------------+----------------------+----------
               Total |   134,535      6,975 |   141,510 
                     |     95.07       4.93 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

             |  Admitted to ITU for
     Smoking |       Covid-19
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |    40,525      2,090 |    42,615 
             |     95.10       4.90 |    100.00 
-------------+----------------------+----------
      Former |    56,462      2,930 |    59,392 
             |     95.07       4.93 |    100.00 
-------------+----------------------+----------
     Current |    22,589      1,140 |    23,729 
             |     95.20       4.80 |    100.00 
-------------+----------------------+----------
Unknown (.u) |    14,959        815 |    15,774 
             |     94.83       5.17 |    100.00 
-------------+----------------------+----------
       Total |   134,535      6,975 |   141,510 
             |     95.07       4.93 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

Respirator |
 y disease |  Admitted to ITU for
    (excl. |       Covid-19
   asthma) |         0          1 |     Total
-----------+----------------------+----------
         0 |   133,662      6,929 |   140,591 
           |     95.07       4.93 |    100.00 
-----------+----------------------+----------
         1 |       873         46 |       919 
           |     94.99       5.01 |    100.00 
-----------+----------------------+----------
     Total |   134,535      6,975 |   141,510 
           |     95.07       4.93 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Admitted to ITU for
           |       Covid-19
    Asthma |         0          1 |     Total
-----------+----------------------+----------
         0 |   134,535      6,975 |   141,510 
           |     95.07       4.93 |    100.00 
-----------+----------------------+----------
     Total |   134,535      6,975 |   141,510 
           |     95.07       4.93 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Admitted to ITU for
     Heart |       Covid-19
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |   112,808      5,823 |   118,631 
           |     95.09       4.91 |    100.00 
-----------+----------------------+----------
         1 |    21,727      1,152 |    22,879 
           |     94.96       5.04 |    100.00 
-----------+----------------------+----------
     Total |   134,535      6,975 |   141,510 
           |     95.07       4.93 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Admitted to ITU for
           |       Covid-19
  Diabetes |         0          1 |     Total
-----------+----------------------+----------
         0 |    94,613      4,868 |    99,481 
           |     95.11       4.89 |    100.00 
-----------+----------------------+----------
         1 |    39,922      2,107 |    42,029 
           |     94.99       5.01 |    100.00 
-----------+----------------------+----------
     Total |   134,535      6,975 |   141,510 
           |     95.07       4.93 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Admitted to ITU for
      Lung |       Covid-19
    cancer |         0          1 |     Total
-----------+----------------------+----------
         0 |   134,502      6,974 |   141,476 
           |     95.07       4.93 |    100.00 
-----------+----------------------+----------
         1 |        33          1 |        34 
           |     97.06       2.94 |    100.00 
-----------+----------------------+----------
     Total |   134,535      6,975 |   141,510 
           |     95.07       4.93 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Admitted to ITU for
     Haem. |       Covid-19
    cancer |         0          1 |     Total
-----------+----------------------+----------
         0 |   124,886      6,470 |   131,356 
           |     95.07       4.93 |    100.00 
-----------+----------------------+----------
         1 |     9,649        505 |    10,154 
           |     95.03       4.97 |    100.00 
-----------+----------------------+----------
     Total |   134,535      6,975 |   141,510 
           |     95.07       4.93 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Admitted to ITU for
           |       Covid-19
Any cancer |         0          1 |     Total
-----------+----------------------+----------
         0 |   133,815      6,938 |   140,753 
           |     95.07       4.93 |    100.00 
-----------+----------------------+----------
         1 |       720         37 |       757 
           |     95.11       4.89 |    100.00 
-----------+----------------------+----------
     Total |   134,535      6,975 |   141,510 
           |     95.07       4.93 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Admitted to ITU for
           |       Covid-19
    Cancer |         0          1 |     Total
-----------+----------------------+----------
         0 |   124,146      6,433 |   130,579 
           |     95.07       4.93 |    100.00 
-----------+----------------------+----------
         1 |    10,389        542 |    10,931 
           |     95.04       4.96 |    100.00 
-----------+----------------------+----------
     Total |   134,535      6,975 |   141,510 
           |     95.07       4.93 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Admitted to ITU for
           |       Covid-19
     Liver |         0          1 |     Total
-----------+----------------------+----------
         0 |   124,965      6,472 |   131,437 
           |     95.08       4.92 |    100.00 
-----------+----------------------+----------
         1 |     9,570        503 |    10,073 
           |     95.01       4.99 |    100.00 
-----------+----------------------+----------
     Total |   134,535      6,975 |   141,510 
           |     95.07       4.93 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Admitted to ITU for
Neurologic |       Covid-19
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 |   133,662      6,929 |   140,591 
           |     95.07       4.93 |    100.00 
-----------+----------------------+----------
         1 |       873         46 |       919 
           |     94.99       5.01 |    100.00 
-----------+----------------------+----------
     Total |   134,535      6,975 |   141,510 
           |     95.07       4.93 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Admitted to ITU for
    Kidney |       Covid-19
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |   134,535      6,975 |   141,510 
           |     95.07       4.93 |    100.00 
-----------+----------------------+----------
     Total |   134,535      6,975 |   141,510 
           |     95.07       4.93 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

     Organ |  Admitted to ITU for
transplant |       Covid-19
 recipient |         0          1 |     Total
-----------+----------------------+----------
         0 |   134,515      6,974 |   141,489 
           |     95.07       4.93 |    100.00 
-----------+----------------------+----------
         1 |        20          1 |        21 
           |     95.24       4.76 |    100.00 
-----------+----------------------+----------
     Total |   134,535      6,975 |   141,510 
           |     95.07       4.93 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Admitted to ITU for
           |       Covid-19
 Dysplenia |         0          1 |     Total
-----------+----------------------+----------
         0 |   124,990      6,474 |   131,464 
           |     95.08       4.92 |    100.00 
-----------+----------------------+----------
         1 |     9,545        501 |    10,046 
           |     95.01       4.99 |    100.00 
-----------+----------------------+----------
     Total |   134,535      6,975 |   141,510 
           |     95.07       4.93 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |  Admitted to ITU for
    Sickle |       Covid-19
      cell |         0          1 |     Total
-----------+----------------------+----------
         0 |   134,534      6,975 |   141,509 
           |     95.07       4.93 |    100.00 
-----------+----------------------+----------
         1 |         1          0 |         1 
           |    100.00       0.00 |    100.00 
-----------+----------------------+----------
     Total |   134,535      6,975 |   141,510 
           |     95.07       4.93 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

    Spleen |
  problems |
(dysplenia |  Admitted to ITU for
  , sickle |       Covid-19
     cell) |         0          1 |     Total
-----------+----------------------+----------
         0 |   124,989      6,474 |   131,463 
           |     95.08       4.92 |    100.00 
-----------+----------------------+----------
         1 |     9,546        501 |    10,047 
           |     95.01       4.99 |    100.00 
-----------+----------------------+----------
     Total |   134,535      6,975 |   141,510 
           |     95.07       4.93 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

       Any |  Admitted to ITU for
immunocond |       Covid-19
     ition |         0          1 |     Total
-----------+----------------------+----------
         0 |   133,662      6,929 |   140,591 
           |     95.07       4.93 |    100.00 
-----------+----------------------+----------
         1 |       873         46 |       919 
           |     94.99       5.01 |    100.00 
-----------+----------------------+----------
     Total |   134,535      6,975 |   141,510 
           |     95.07       4.93 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

  RA, SLE, |
 Psoriasis |  Admitted to ITU for
(autoimmun |       Covid-19
e disease) |         0          1 |     Total
-----------+----------------------+----------
         0 |   133,687      6,947 |   140,634 
           |     95.06       4.94 |    100.00 
-----------+----------------------+----------
         1 |       848         28 |       876 
           |     96.80       3.20 |    100.00 
-----------+----------------------+----------
     Total |   134,535      6,975 |   141,510 
           |     95.07       4.93 |    100.00 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

  Index of |
  Multiple |  Admitted to ITU for
Deprivatio |       Covid-19
   n (IMD) |         0          1 |     Total
-----------+----------------------+----------
         1 |    25,143      1,308 |    26,451 
           |     95.06       4.94 |    100.00 
-----------+----------------------+----------
         2 |    27,927      1,479 |    29,406 
           |     94.97       5.03 |    100.00 
-----------+----------------------+----------
         3 |    27,533      1,377 |    28,910 
           |     95.24       4.76 |    100.00 
-----------+----------------------+----------
         4 |    26,702      1,420 |    28,122 
           |     94.95       5.05 |    100.00 
-----------+----------------------+----------
         5 |    27,230      1,391 |    28,621 
           |     95.14       4.86 |    100.00 
-----------+----------------------+----------
     Total |   134,535      6,975 |   141,510 
           |     95.07       4.93 |    100.00 

. 
. 
. 
. * Close the log file
. log close
      name:  <unnamed>
       log:  C:\Users\emsuewil\Documents\Work\Covid\Risk profile\Git\opencorona-risk-factors-research\analysis\output/an_descriptive_tables.log
  log type:  text
 closed on:  17 Apr 2020, 11:07:05
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
