---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Github\opencorona-risk-factors-research\analysis\output/an_multivariable_cox_models.log
  log type:  text
 opened on:  23 Apr 2020, 13:08:20

. 
. use egdata, clear
(Poor factors dummy analysis dataset)

. 
. 
. ******************************
. *  Multivariable Cox models  *
. ******************************
. 
. *************************************************************************************
. *PROG TO DEFINE THE BASIC COX MODEL WITH OPTIONS FOR HANDLING OF AGE, BMI, ETHNICITY:
. cap prog drop basecoxmodel

. prog define basecoxmodel
  1.         syntax , age(string) bmi(string) smoke(string) bp(string) [ethnicity(real 0)] 
  2. 
.         if `ethnicity'==1 local ethnicity "i.ethnicity"
  3.         else local ethnicity
  4. timer clear
  5. timer on 1
  6.         capture stcox   `age'                                                   ///
>                         i.male                                                  ///
>                         `bmi'                                                   ///
>                         `smoke'                                                 ///
>                         `ethnicity'                                             ///
>                         i.imd                                                   ///
>                         `bp'                                                    ///
>                         i.chronic_respiratory_disease   ///
>                         i.asthma                                                ///
>                         i.chronic_cardiac_disease               ///
>                         i.diabetes                                              ///
>                         i.cancer_exhaem_lastyr                  ///
>                         i.haemmalig_aanaem_bmtrans_lastyr  ///
>                         i.chronic_liver_disease                 ///
>                         i.stroke_dementia                                       ///
>                         i.other_neuro                                   ///
>                         i.chronic_kidney_disease                ///
>                         i.organ_transplant                              ///
>                         i.spleen                                                ///
>                         i.ra_sle_psoriasis                      ///
>                         /*endocrine?*/                                  ///
>                         /*immunosuppression?*/                  ///
>                         , strata(stp)
  7. timer off 1
  8. timer list
  9. end

. *************************************************************************************
. 
. 
. foreach outcome of any /*ecdsevent*/ ituadmission cpnsdeath onscoviddeath{
  2. 
. stset stime_`outcome', fail(`outcome') enter(enter_date) origin(enter_date) id(patient_id) 
  3. 
. *Age spline model (not adj ethnicity)
. basecoxmodel, age("age1 age2 age3")  bmi("i.obese40") smoke(i.currentsmoke) bp(i.bphigh) ethnicity(0)
  4. if _rc==0{
  5. estimates
  6. estimates save ./output/models/an_multivariate_cox_models_`outcome'_MAINFULLYADJMODEL_agespline_bmicat_noeth, replace
  7. *estat concordance /*c-statistic*/
. }
  8. else di "WARNING AGE SPLINE MODEL DID NOT FIT"
  9.  
. *Age group model (not adj ethnicity)
. basecoxmodel, age("i.agegroup")  bmi("i.obese40") smoke(i.currentsmoke) bp(i.bphigh) ethnicity(0)
 10. if _rc==0{
 11. estimates
 12. estimates save ./output/models/an_multivariate_cox_models_`outcome'_MAINFULLYADJMODEL_agegroup_bmicat_noeth, replace
 13. *estat concordance /*c-statistic*/
. }
 14. else di "WARNING GROUP MODEL DID NOT FIT"
 15. 
. *Complete case ethnicity model
. basecoxmodel, age("age1 age2 age3")  bmi("i.obese40") smoke(i.currentsmoke) bp(i.bphigh) ethnicity(1)
 16. if _rc==0{
 17. estimates save ./output/models/an_multivariate_cox_models_`outcome'_MAINFULLYADJMODEL_agespline_bmicat_CCeth, replace
 18. *estat concordance /*c-statistic*/
.  }
 19.  else di "WARNING CC ETHNICITY MODEL DID NOT FIT"
 20.  
. 
. ************************************************************************
. * Add IBS 
. 
. * Calculate at 60 days
. *
. *stbrier, bt(60) efron
. 
. /*
> stbrier age1 age2 age3 male i.bmicat i.smoke                                                    ///
>                 resp asthma heart diabetes cancer liver neuro_dis kidney_dis    ///
>                 transplant spleen immunosup hypertension autoimmune sle                 ///
>                 endocrine                                                                                                               ///
>                 , shared(stp) bt(60)                                                                                    ///
>                 ipcw(age1 age2 age3 male i.bmicat i.smoke                                               ///
>                 resp asthma heart diabetes cancer liver neuro_dis kidney_dis    ///
>                 transplant spleen immunosup hypertension autoimmune sle                 ///
>                 endocrine)
> */
. 
. * Simple model just to try:
. /*
> stbrier age1 age2 age3 male                                                                                     ///
>                 , shared(stp) bt(60)                                                                                    ///
>                 ipcw(age1 age2 age3 male)
> */
. ************************************************************************
. 
. } /*end of looping round outcomes*/

                id:  patient_id
     failure event:  ituadmission != 0 & ituadmission < .
obs. time interval:  (stime_ituadmission[_n-1], stime_ituadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    100,570  total observations
          3  observations end on or before enter()
------------------------------------------------------------------------------
    100,567  observations remaining, representing
    100,567  subjects
          5  failures in single-failure-per-subject data
  7,944,253  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        79
   1:     17.45 /        1 =      17.4530

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       99,132                  Number of obs    =      99,132
No. of failures =            5
Time at risk    =      7830888
                                                LR chi2(9)       =       33.40
Log likelihood  =   -40.822786                  Prob > chi2      =      0.0001

---------------------------------------------------------------------------------------------------
                               _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------------------+----------------------------------------------------------------
                             age1 |   1.057531   .1035764     0.57   0.568     .8728206    1.281331
                             age2 |   .5711125     .24747    -1.29   0.196     .2442787    1.335235
                             age3 |   9.888353   16.77408     1.35   0.177     .3557878    274.8254
                           1.male |   6.448928   8.829686     1.36   0.173     .4406024    94.39047
                        1.obese40 |   2.20e-17          .        .       .            .           .
                   1.currentsmoke |   5.038134   5.477613     1.49   0.137     .5981603    42.43478
                                  |
                              imd |
                               2  |   3.46e-10          .        .       .            .           .
                               3  |   4.28e-10          .        .       .            .           .
                               4  |   3.44e+10   3.29e+10    25.36   0.000     5.27e+09    2.24e+11
                               5  |   7.96e+09          .        .       .            .           .
                                  |
                         1.bphigh |   .2342123   .2790234    -1.22   0.223     .0226752    2.419184
    1.chronic_respiratory_disease |   2.64e-19          .        .       .            .           .
                         1.asthma |   3.08e-17          .        .       .            .           .
        1.chronic_cardiac_disease |    53.1321   54.39712     3.88   0.000     7.143143     395.207
                       1.diabetes |   1.019685   1.332207     0.01   0.988     .0787735    13.19931
           1.cancer_exhaem_lastyr |   2.95e-14          .        .       .            .           .
1.haemmalig_aanaem_bmtrans_lastyr |   7.61e-16          .        .       .            .           .
          1.chronic_liver_disease |   2.94e-17          .        .       .            .           .
                1.stroke_dementia |   1.05e-18          .        .       .            .           .
                    1.other_neuro |   1.42e-18          .        .       .            .           .
         1.chronic_kidney_disease |   2.35e-19          .        .       .            .           .
               1.organ_transplant |   2.83e-17          .        .       .            .           .
                         1.spleen |   2.97e-17          .        .       .            .           .
               1.ra_sle_psoriasis |   8.28e-19          .        .       .            .           .
---------------------------------------------------------------------------------------------------
                                                             Stratified by stp
file ./output/models/an_multivariate_cox_models_ituadmission_MAINFULLYADJMODEL_agespline_bmicat_noeth.ster saved
   1:     19.79 /        1 =      19.7880

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       99,132                  Number of obs    =      99,132
No. of failures =            5
Time at risk    =      7830888
                                                LR chi2(8)       =       34.34
Log likelihood  =   -40.353236                  Prob > chi2      =      0.0000

---------------------------------------------------------------------------------------------------
                               _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------------------+----------------------------------------------------------------
                         agegroup |
                          40-<50  |     .43585    .514248    -0.70   0.482     .0431546    4.401973
                          50-<60  |   2.68e-20          .        .       .            .           .
                          60-<70  |   2.84e-20          .        .       .            .           .
                          70-<80  |   2.88e-20          .        .       .            .           .
                             80+  |   .1648752    .258781    -1.15   0.251     .0076058    3.574082
                                  |
                           1.male |   10.25382   16.24338     1.47   0.142     .4596981    228.7172
                        1.obese40 |   3.15e-17          .        .       .            .           .
                   1.currentsmoke |   4.284422   4.811051     1.30   0.195     .4743112    38.70091
                                  |
                              imd |
                               2  |   3.56e-10          .        .       .            .           .
                               3  |   4.49e-10          .        .       .            .           .
                               4  |   3.16e+10   3.08e+10    24.86   0.000     4.70e+09    2.13e+11
                               5  |   8.05e+09          .        .       .            .           .
                                  |
                         1.bphigh |   .2562783   .3096574    -1.13   0.260     .0240003     2.73657
    1.chronic_respiratory_disease |   2.82e-19          .        .       .            .           .
                         1.asthma |   3.18e-17          .        .       .            .           .
        1.chronic_cardiac_disease |   49.33615   51.26044     3.75   0.000     6.438191    378.0652
                       1.diabetes |   1.266935   1.663019     0.18   0.857     .0967029     16.5985
           1.cancer_exhaem_lastyr |   8.56e-14          .        .       .            .           .
1.haemmalig_aanaem_bmtrans_lastyr |   6.91e-16          .        .       .            .           .
          1.chronic_liver_disease |   7.33e-17          .        .       .            .           .
                1.stroke_dementia |   1.13e-18          .        .       .            .           .
                    1.other_neuro |   1.75e-18          .        .       .            .           .
         1.chronic_kidney_disease |   2.54e-19          .        .       .            .           .
               1.organ_transplant |   1.97e-16          .        .       .            .           .
                         1.spleen |   2.31e-17          .        .       .            .           .
               1.ra_sle_psoriasis |   8.01e-19          .        .       .            .           .
---------------------------------------------------------------------------------------------------
                                                             Stratified by stp
file ./output/models/an_multivariate_cox_models_ituadmission_MAINFULLYADJMODEL_agegroup_bmicat_noeth.ster saved
   1:      0.76 /        1 =       0.7550
file ./output/models/an_multivariate_cox_models_ituadmission_MAINFULLYADJMODEL_agespline_bmicat_CCeth.ster saved

                id:  patient_id
     failure event:  cpnsdeath != 0 & cpnsdeath < .
obs. time interval:  (stime_cpnsdeath[_n-1], stime_cpnsdeath]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    100,570  total observations
          3  observations end on or before enter()
------------------------------------------------------------------------------
    100,567  observations remaining, representing
    100,567  subjects
          1  failure in single-failure-per-subject data
  7,542,261  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        75
   1:      7.44 /        1 =       7.4360
WARNING AGE SPLINE MODEL DID NOT FIT
   1:     14.56 /        1 =      14.5610

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- no ties

No. of subjects =       99,132                  Number of obs    =      99,132
No. of failures =            1
Time at risk    =      7434636
                                                LR chi2(22)      =        8.41
Log likelihood  =   -7.2977683                  Prob > chi2      =      0.9959

---------------------------------------------------------------------------------------------------
                               _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------------------+----------------------------------------------------------------
                         agegroup |
                          40-<50  |   3.64e-18   2.69e-09    -0.00   1.000            0           .
                          50-<60  |   3.43e-18   2.51e-09    -0.00   1.000            0           .
                          60-<70  |   7.90e-33   1.54e-23    -0.00   1.000            0           .
                          70-<80  |   2.31e-18   2.26e-09    -0.00   1.000            0           .
                             80+  |   2.34e-18   1.95e-09    -0.00   1.000            0           .
                                  |
                           1.male |   3.12e-17   5.33e-09    -0.00   1.000            0           .
                        1.obese40 |   53.18319   1.35e+11     0.00   1.000            0           .
                   1.currentsmoke |   4.18e-16   7.60e-08    -0.00   1.000            0           .
                                  |
                              imd |
                               2  |   1.73e+15   8.31e+22     0.00   1.000            0           .
                               3  |    .008216    4845406    -0.00   1.000            0           .
                               4  |    .008346    6828993    -0.00   1.000            0           .
                               5  |   .0062645    3096883    -0.00   1.000            0           .
                                  |
                         1.bphigh |   1.31e-16   2.04e-08    -0.00   1.000            0           .
    1.chronic_respiratory_disease |   1.57e-15   1.08e-06    -0.00   1.000            0           .
                         1.asthma |   .0493743          .        .       .            .           .
        1.chronic_cardiac_disease |   7.17e-16   2.50e-07    -0.00   1.000            0           .
                       1.diabetes |   1.25e-15   2.48e-07    -0.00   1.000            0           .
           1.cancer_exhaem_lastyr |   4.02e+25          .        .       .            .           .
1.haemmalig_aanaem_bmtrans_lastyr |   3.46e+11          .        .       .            .           .
          1.chronic_liver_disease |   2.34e-16   3.90e-07    -0.00   1.000            0           .
                1.stroke_dementia |   4.13e-15   2.47e-06    -0.00   1.000            0           .
                    1.other_neuro |   4.58e-16   4.75e-07    -0.00   1.000            0           .
         1.chronic_kidney_disease |   2.02e-16   6.04e-08    -0.00   1.000            0           .
               1.organ_transplant |   .2649566          .        .       .            .           .
                         1.spleen |   2.27e+17   4.18e+26     0.00   1.000            0           .
               1.ra_sle_psoriasis |   2.06e-16   1.74e-07    -0.00   1.000            0           .
---------------------------------------------------------------------------------------------------
                                                             Stratified by stp
file ./output/models/an_multivariate_cox_models_cpnsdeath_MAINFULLYADJMODEL_agegroup_bmicat_noeth.ster saved
   1:      0.80 /        1 =       0.8010
file ./output/models/an_multivariate_cox_models_cpnsdeath_MAINFULLYADJMODEL_agespline_bmicat_CCeth.ster saved

                id:  patient_id
     failure event:  onscoviddeath != 0 & onscoviddeath < .
obs. time interval:  (stime_onscoviddeath[_n-1], stime_onscoviddeath]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    100,570  total observations
          3  observations end on or before enter()
------------------------------------------------------------------------------
    100,567  observations remaining, representing
    100,567  subjects
          1  failure in single-failure-per-subject data
  6,536,671  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        65
   1:     12.94 /        1 =      12.9410
WARNING AGE SPLINE MODEL DID NOT FIT
   1:     14.09 /        1 =      14.0890

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- no ties

No. of subjects =       99,132                  Number of obs    =      99,132
No. of failures =            1
Time at risk    =      6443396
                                                LR chi2(21)      =        9.45
Log likelihood  =   -6.7776466                  Prob > chi2      =      0.9852

---------------------------------------------------------------------------------------------------
                               _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------------------+----------------------------------------------------------------
                         agegroup |
                          40-<50  |    1.01792   5.82e+08     0.00   1.000            0           .
                          50-<60  |   .6123898   4.41e+08    -0.00   1.000            0           .
                          60-<70  |   .6823236   6.50e+08    -0.00   1.000            0           .
                          70-<80  |   .5761755   6.22e+08    -0.00   1.000            0           .
                             80+  |   4.73e+17          .        .       .            .           .
                                  |
                           1.male |   1.21e-16   1.03e-08    -0.00   1.000            0           .
                        1.obese40 |   1.655999   3.47e+09     0.00   1.000            0           .
                   1.currentsmoke |   3.33e-17   8.31e-09    -0.00   1.000            0           .
                                  |
                              imd |
                               2  |   7.24e+15          .        .       .            .           .
                               3  |   .0689356   1.81e+07    -0.00   1.000            0           .
                               4  |   .0106118   1.41e+07    -0.00   1.000            0           .
                               5  |   .0691869   2.09e+07    -0.00   1.000            0           .
                                  |
                         1.bphigh |   5.33e-16   3.69e-08    -0.00   1.000            0           .
    1.chronic_respiratory_disease |    .270714   1.56e+08    -0.00   1.000            0           .
                         1.asthma |   234.3066   4.39e+11     0.00   1.000            0           .
        1.chronic_cardiac_disease |   4.48e-15   7.42e-07    -0.00   1.000            0           .
                       1.diabetes |   1.14e-14   9.99e-07    -0.00   1.000            0           .
           1.cancer_exhaem_lastyr |   3.70e+12          .        .       .            .           .
1.haemmalig_aanaem_bmtrans_lastyr |   4.31e+11          .        .       .            .           .
          1.chronic_liver_disease |   515.6992   6.95e+10     0.00   1.000            0           .
                1.stroke_dementia |   7.89e-15   2.63e-06    -0.00   1.000            0           .
                    1.other_neuro |   9.04e-16   8.91e-07    -0.00   1.000            0           .
         1.chronic_kidney_disease |   5.18e-16   1.04e-07    -0.00   1.000            0           .
               1.organ_transplant |   .0489854          .        .       .            .           .
                         1.spleen |   4.092998   2.58e+09     0.00   1.000            0           .
               1.ra_sle_psoriasis |   7.19e-16   3.00e-07    -0.00   1.000            0           .
---------------------------------------------------------------------------------------------------
                                                             Stratified by stp
file ./output/models/an_multivariate_cox_models_onscoviddeath_MAINFULLYADJMODEL_agegroup_bmicat_noeth.ster saved
   1:      0.73 /        1 =       0.7290
file ./output/models/an_multivariate_cox_models_onscoviddeath_MAINFULLYADJMODEL_agespline_bmicat_CCeth.ster saved

. 
. * Close log file  (bootstrapping likely to take a while)
. log close
      name:  <unnamed>
       log:  C:\Github\opencorona-risk-factors-research\analysis\output/an_multivariable_cox_models.log
  log type:  text
 closed on:  23 Apr 2020, 13:09:51
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
