---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Github\opencorona-risk-factors-research\analysis\output/an_multivariable_cox_models.log
  log type:  text
 opened on:  23 Apr 2020, 19:29:14

. 
. use egdata, clear
(Poor factors dummy analysis dataset)

. 
. 
. ******************************
. *  Multivariable Cox models  *
. ******************************
. 
. *************************************************************************************
. *PROG TO DEFINE THE BASIC COX MODEL WITH OPTIONS FOR HANDLING OF AGE, BMI, ETHNICITY:
. cap prog drop basecoxmodel

. prog define basecoxmodel
  1.         syntax , age(string) bmi(string) smoke(string) bp(string) [ethnicity(real 0) if(string)] 
  2. 
.         if `ethnicity'==1 local ethnicity "i.ethnicity"
  3.         else local ethnicity
  4. timer clear
  5. timer on 1
  6.         capture stcox   `age'                                                   ///
>                         i.male                                                  ///
>                         `bmi'                                                   ///
>                         `smoke'                                                 ///
>                         `ethnicity'                                             ///
>                         i.imd                                                   ///
>                         `bp'                                                    ///
>                         i.chronic_respiratory_disease   ///
>                         i.asthma                                                ///
>                         i.chronic_cardiac_disease               ///
>                         i.diabetes                                              ///
>                         i.cancer_exhaem_lastyr                  ///
>                         i.haemmalig_aanaem_bmtrans_lastyr  ///
>                         i.chronic_liver_disease                 ///
>                         i.stroke_dementia                                       ///
>                         i.other_neuro                                   ///
>                         i.chronic_kidney_disease                ///
>                         i.organ_transplant                              ///
>                         i.spleen                                                ///
>                         i.ra_sle_psoriasis                      ///
>                         /*endocrine?*/                                  ///
>                         /*immunosuppression?*/                  ///
>                         `if'                                                    ///
>                         , strata(stp)
  7. timer off 1
  8. timer list
  9. end

. *************************************************************************************
. 
. 
. foreach outcome of any /*ecdsevent*/ cpnsdeath onscoviddeath ituadmission {
  2. 
. stset stime_`outcome', fail(`outcome') enter(enter_date) origin(enter_date) id(patient_id) 
  3. 
. *Age spline model (not adj ethnicity)
. basecoxmodel, age("age1 age2 age3")  bmi("i.obese40") smoke(i.currentsmoke) bp(i.bphigh) ethnicity(0)
  4. if _rc==0{
  5. estimates
  6. estimates save ./output/models/an_multivariate_cox_models_`outcome'_MAINFULLYADJMODEL_agespline_bmicat_noeth, replace
  7. *estat concordance /*c-statistic*/
. }
  8. else di "WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME `outcome')"
  9.  
. *Age group model (not adj ethnicity)
. basecoxmodel, age("ib3.agegroup")  bmi("i.obese40") smoke(i.currentsmoke) bp(i.bphigh) ethnicity(0)
 10. if _rc==0{
 11. estimates
 12. estimates save ./output/models/an_multivariate_cox_models_`outcome'_MAINFULLYADJMODEL_agegroup_bmicat_noeth, replace
 13. *estat concordance /*c-statistic*/
. }
 14. else di "WARNING GROUP MODEL DID NOT FIT (OUTCOME `outcome')"
 15. 
. *Complete case ethnicity model
. basecoxmodel, age("age1 age2 age3")  bmi("i.obese40") smoke(i.currentsmoke) bp(i.bphigh) ethnicity(1)
 16. if _rc==0{
 17. estimates
 18. estimates save ./output/models/an_multivariate_cox_models_`outcome'_MAINFULLYADJMODEL_agespline_bmicat_CCeth, replace
 19. *estat concordance /*c-statistic*/
.  }
 20.  else di "WARNING CC ETHNICITY MODEL DID NOT FIT (OUTCOME `outcome')"
 21. 
.  
. *Model without ethnicity among ethnicity complete cases 
. basecoxmodel, age("age1 age2 age3")  bmi("i.obese40") smoke(i.currentsmoke) bp(i.bphigh) ethnicity(0) if("if ethnicity<.")
 22. if _rc==0{
 23. estimates
 24. estimates save ./output/models/an_multivariate_cox_models_`outcome'_MAINFULLYADJMODEL_agespline_bmicat_CCeth, replace
 25. *estat concordance /*c-statistic*/
.  }
 26.  else di "WARNING CC MODEL (excluding ethnicity) DID NOT FIT (OUTCOME `outcome')"
 27.  
.  
. 
. ************************************************************************
. * Add IBS 
. 
. * Calculate at 60 days
. *
. *stbrier, bt(60) efron
. 
. /*
> stbrier age1 age2 age3 male i.bmicat i.smoke                                                    ///
>                 resp asthma heart diabetes cancer liver neuro_dis kidney_dis    ///
>                 transplant spleen immunosup hypertension autoimmune sle                 ///
>                 endocrine                                                                                                               ///
>                 , shared(stp) bt(60)                                                                                    ///
>                 ipcw(age1 age2 age3 male i.bmicat i.smoke                                               ///
>                 resp asthma heart diabetes cancer liver neuro_dis kidney_dis    ///
>                 transplant spleen immunosup hypertension autoimmune sle                 ///
>                 endocrine)
> */
. 
. * Simple model just to try:
. /*
> stbrier age1 age2 age3 male                                                                                     ///
>                 , shared(stp) bt(60)                                                                                    ///
>                 ipcw(age1 age2 age3 male)
> */
. ************************************************************************
. 
. } /*end of looping round outcomes*/

                id:  patient_id
     failure event:  cpnsdeath != 0 & cpnsdeath < .
obs. time interval:  (stime_cpnsdeath[_n-1], stime_cpnsdeath]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    100,570  total observations
          3  observations end on or before enter()
------------------------------------------------------------------------------
    100,567  observations remaining, representing
    100,567  subjects
          1  failure in single-failure-per-subject data
  7,542,261  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        75
   1:      6.94 /        1 =       6.9390
WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME cpnsdeath)
   1:     14.27 /        1 =      14.2650

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- no ties

No. of subjects =       99,132                  Number of obs    =      99,132
No. of failures =            1
Time at risk    =      7434636
                                                LR chi2(23)      =        8.41
Log likelihood  =   -7.2977683                  Prob > chi2      =      0.9976

---------------------------------------------------------------------------------------------------
                               _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------------------+----------------------------------------------------------------
                         agegroup |
                          18-<40  |   7.54e+15   5.78e+23     0.00   1.000            0           .
                          40-<50  |   .1201313   4.34e+07    -0.00   1.000            0           .
                          60-<70  |   3.52e-14          .        .       .            .           .
                          70-<80  |   .1497648   5.32e+07    -0.00   1.000            0           .
                             80+  |   .1392373   4.33e+07    -0.00   1.000            0           .
                                  |
                           1.male |   2.32e-16   1.45e-08    -0.00   1.000            0           .
                        1.obese40 |   53.18497   4.96e+10     0.00   1.000            0           .
                   1.currentsmoke |   3.09e-15   2.07e-07    -0.00   1.000            0           .
                                  |
                              imd |
                               2  |   2.43e+15   1.89e+23     0.00   1.000            0           .
                               3  |   .0909228   2.04e+07    -0.00   1.000            0           .
                               4  |   .0865616   2.69e+07    -0.00   1.000            0           .
                               5  |    .016306    6038053    -0.00   1.000            0           .
                                  |
                         1.bphigh |   9.70e-16   5.56e-08    -0.00   1.000            0           .
    1.chronic_respiratory_disease |   1.16e-14   2.93e-06    -0.00   1.000            0           .
                         1.asthma |   .0643689   9.80e+07    -0.00   1.000            0           .
        1.chronic_cardiac_disease |   5.30e-15   6.78e-07    -0.00   1.000            0           .
                       1.diabetes |   9.24e-15   6.75e-07    -0.00   1.000            0           .
           1.cancer_exhaem_lastyr |   3.74e+25          .        .       .            .           .
1.haemmalig_aanaem_bmtrans_lastyr |   3.46e+11          .        .       .            .           .
          1.chronic_liver_disease |   1.73e-15   1.13e-06    -0.00   1.000            0           .
                1.stroke_dementia |   3.05e-14   6.71e-06    -0.00   1.000            0           .
                    1.other_neuro |   3.39e-15   1.29e-06    -0.00   1.000            0           .
         1.chronic_kidney_disease |   1.50e-15   1.64e-07    -0.00   1.000            0           .
               1.organ_transplant |   .2649566   5.06e+08    -0.00   1.000            0           .
                         1.spleen |   1.67e+15   5.28e+23     0.00   1.000            0           .
               1.ra_sle_psoriasis |   1.52e-15   4.74e-07    -0.00   1.000            0           .
---------------------------------------------------------------------------------------------------
                                                             Stratified by stp
file ./output/models/an_multivariate_cox_models_cpnsdeath_MAINFULLYADJMODEL_agegroup_bmicat_noeth.ster saved
   1:      0.74 /        1 =       0.7440

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- no ties

No. of subjects =       19,749                  Number of obs    =      19,749
No. of failures =            0
Time at risk    =      1481175
                                                LR chi2(0)       =        0.00
Log likelihood  =            0                  Prob > chi2      =           .

---------------------------------------------------------------------------------------------------
                               _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------------------+----------------------------------------------------------------
                             age1 |          1  (omitted)
                             age2 |          1  (omitted)
                             age3 |          1  (omitted)
                           1.male |          1  (omitted)
                        1.obese40 |          1  (omitted)
                   1.currentsmoke |          1  (omitted)
                                  |
                        ethnicity |
                     South Asian  |          1  (omitted)
                           Black  |          1  (omitted)
                           Other  |          1  (omitted)
                           Mixed  |          1  (omitted)
                                  |
                              imd |
                               2  |          1  (omitted)
                               3  |          1  (omitted)
                               4  |          1  (omitted)
                               5  |          1  (omitted)
                                  |
                         1.bphigh |          1  (omitted)
    1.chronic_respiratory_disease |          1  (omitted)
                         1.asthma |          1  (omitted)
        1.chronic_cardiac_disease |          1  (omitted)
                       1.diabetes |          1  (omitted)
           1.cancer_exhaem_lastyr |          1  (omitted)
1.haemmalig_aanaem_bmtrans_lastyr |          1  (omitted)
          1.chronic_liver_disease |          1  (omitted)
                1.stroke_dementia |          1  (omitted)
                    1.other_neuro |          1  (omitted)
         1.chronic_kidney_disease |          1  (omitted)
               0.organ_transplant |          1  (omitted)
                         0.spleen |          1  (omitted)
               1.ra_sle_psoriasis |          1  (omitted)
---------------------------------------------------------------------------------------------------
                                                             Stratified by stp
file ./output/models/an_multivariate_cox_models_cpnsdeath_MAINFULLYADJMODEL_agespline_bmicat_CCeth.ster saved
   1:      0.67 /        1 =       0.6740

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- no ties

No. of subjects =       19,749                  Number of obs    =      19,749
No. of failures =            0
Time at risk    =      1481175
                                                LR chi2(0)       =        0.00
Log likelihood  =            0                  Prob > chi2      =           .

---------------------------------------------------------------------------------------------------
                               _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------------------+----------------------------------------------------------------
                             age1 |          1  (omitted)
                             age2 |          1  (omitted)
                             age3 |          1  (omitted)
                           1.male |          1  (omitted)
                        1.obese40 |          1  (omitted)
                   1.currentsmoke |          1  (omitted)
                                  |
                              imd |
                               2  |          1  (omitted)
                               3  |          1  (omitted)
                               4  |          1  (omitted)
                               5  |          1  (omitted)
                                  |
                         1.bphigh |          1  (omitted)
    1.chronic_respiratory_disease |          1  (omitted)
                         1.asthma |          1  (omitted)
        1.chronic_cardiac_disease |          1  (omitted)
                       1.diabetes |          1  (omitted)
           1.cancer_exhaem_lastyr |          1  (omitted)
1.haemmalig_aanaem_bmtrans_lastyr |          1  (omitted)
          1.chronic_liver_disease |          1  (omitted)
                1.stroke_dementia |          1  (omitted)
                    1.other_neuro |          1  (omitted)
         1.chronic_kidney_disease |          1  (omitted)
               0.organ_transplant |          1  (omitted)
                         0.spleen |          1  (omitted)
               1.ra_sle_psoriasis |          1  (omitted)
---------------------------------------------------------------------------------------------------
                                                             Stratified by stp
file ./output/models/an_multivariate_cox_models_cpnsdeath_MAINFULLYADJMODEL_agespline_bmicat_CCeth.ster saved

                id:  patient_id
     failure event:  onscoviddeath != 0 & onscoviddeath < .
obs. time interval:  (stime_onscoviddeath[_n-1], stime_onscoviddeath]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    100,570  total observations
          3  observations end on or before enter()
------------------------------------------------------------------------------
    100,567  observations remaining, representing
    100,567  subjects
          1  failure in single-failure-per-subject data
  6,536,671  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        65
   1:     12.92 /        1 =      12.9180
WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME onscoviddeath)
   1:     14.69 /        1 =      14.6860

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- no ties

No. of subjects =       99,132                  Number of obs    =      99,132
No. of failures =            1
Time at risk    =      6443396
                                                LR chi2(21)      =        9.45
Log likelihood  =   -6.7776466                  Prob > chi2      =      0.9852

---------------------------------------------------------------------------------------------------
                               _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------------------+----------------------------------------------------------------
                         agegroup |
                          18-<40  |   .0077049    8395850    -0.00   1.000            0           .
                          40-<50  |   .0151995   1.68e+07    -0.00   1.000            0           .
                          60-<70  |   .0080171   1.22e+07    -0.00   1.000            0           .
                          70-<80  |   .0093775   1.67e+07    -0.00   1.000            0           .
                             80+  |   2.09e+16   1.56e+24     0.00   1.000            0           .
                                  |
                           1.male |   5.43e-17   6.65e-09    -0.00   1.000            0           .
                        1.obese40 |   1.358194          .        .       .            .           .
                   1.currentsmoke |   2.34e-17   9.16e-09    -0.00   1.000            0           .
                                  |
                              imd |
                               2  |   5.26e+15   3.94e+23     0.00   1.000            0           .
                               3  |   .0259721   1.15e+07    -0.00   1.000            0           .
                               4  |   .0028329    6204174    -0.00   1.000            0           .
                               5  |   .0184704    9294247    -0.00   1.000            0           .
                                  |
                         1.bphigh |   1.96e-16   2.24e-08    -0.00   1.000            0           .
    1.chronic_respiratory_disease |   .2576973   2.43e+08    -0.00   1.000            0           .
                         1.asthma |   324.5298          .        .       .            .           .
        1.chronic_cardiac_disease |   1.65e-15   4.50e-07    -0.00   1.000            0           .
                       1.diabetes |   4.19e-15   6.06e-07    -0.00   1.000            0           .
           1.cancer_exhaem_lastyr |   3.70e+12          .        .       .            .           .
1.haemmalig_aanaem_bmtrans_lastyr |   4.65e+11          .        .       .            .           .
          1.chronic_liver_disease |   248.7466   4.74e+10     0.00   1.000            0           .
                1.stroke_dementia |   2.90e-15   1.60e-06    -0.00   1.000            0           .
                    1.other_neuro |   3.33e-16   5.40e-07    -0.00   1.000            0           .
         1.chronic_kidney_disease |   1.90e-16   6.31e-08    -0.00   1.000            0           .
               1.organ_transplant |   .1771728          .        .       .            .           .
                         1.spleen |   4.066467   4.23e+09     0.00   1.000            0           .
               1.ra_sle_psoriasis |   2.64e-16   1.82e-07    -0.00   1.000            0           .
---------------------------------------------------------------------------------------------------
                                                             Stratified by stp
file ./output/models/an_multivariate_cox_models_onscoviddeath_MAINFULLYADJMODEL_agegroup_bmicat_noeth.ster saved
   1:      0.71 /        1 =       0.7110

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- no ties

No. of subjects =       19,749                  Number of obs    =      19,749
No. of failures =            0
Time at risk    =      1283685
                                                LR chi2(0)       =        0.00
Log likelihood  =            0                  Prob > chi2      =           .

---------------------------------------------------------------------------------------------------
                               _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------------------+----------------------------------------------------------------
                             age1 |          1  (omitted)
                             age2 |          1  (omitted)
                             age3 |          1  (omitted)
                           1.male |          1  (omitted)
                        1.obese40 |          1  (omitted)
                   1.currentsmoke |          1  (omitted)
                                  |
                        ethnicity |
                     South Asian  |          1  (omitted)
                           Black  |          1  (omitted)
                           Other  |          1  (omitted)
                           Mixed  |          1  (omitted)
                                  |
                              imd |
                               2  |          1  (omitted)
                               3  |          1  (omitted)
                               4  |          1  (omitted)
                               5  |          1  (omitted)
                                  |
                         1.bphigh |          1  (omitted)
    1.chronic_respiratory_disease |          1  (omitted)
                         1.asthma |          1  (omitted)
        1.chronic_cardiac_disease |          1  (omitted)
                       1.diabetes |          1  (omitted)
           1.cancer_exhaem_lastyr |          1  (omitted)
1.haemmalig_aanaem_bmtrans_lastyr |          1  (omitted)
          1.chronic_liver_disease |          1  (omitted)
                1.stroke_dementia |          1  (omitted)
                    1.other_neuro |          1  (omitted)
         1.chronic_kidney_disease |          1  (omitted)
               0.organ_transplant |          1  (omitted)
                         0.spleen |          1  (omitted)
               1.ra_sle_psoriasis |          1  (omitted)
---------------------------------------------------------------------------------------------------
                                                             Stratified by stp
file ./output/models/an_multivariate_cox_models_onscoviddeath_MAINFULLYADJMODEL_agespline_bmicat_CCeth.ster saved
   1:      0.69 /        1 =       0.6920

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- no ties

No. of subjects =       19,749                  Number of obs    =      19,749
No. of failures =            0
Time at risk    =      1283685
                                                LR chi2(0)       =        0.00
Log likelihood  =            0                  Prob > chi2      =           .

---------------------------------------------------------------------------------------------------
                               _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------------------+----------------------------------------------------------------
                             age1 |          1  (omitted)
                             age2 |          1  (omitted)
                             age3 |          1  (omitted)
                           1.male |          1  (omitted)
                        1.obese40 |          1  (omitted)
                   1.currentsmoke |          1  (omitted)
                                  |
                              imd |
                               2  |          1  (omitted)
                               3  |          1  (omitted)
                               4  |          1  (omitted)
                               5  |          1  (omitted)
                                  |
                         1.bphigh |          1  (omitted)
    1.chronic_respiratory_disease |          1  (omitted)
                         1.asthma |          1  (omitted)
        1.chronic_cardiac_disease |          1  (omitted)
                       1.diabetes |          1  (omitted)
           1.cancer_exhaem_lastyr |          1  (omitted)
1.haemmalig_aanaem_bmtrans_lastyr |          1  (omitted)
          1.chronic_liver_disease |          1  (omitted)
                1.stroke_dementia |          1  (omitted)
                    1.other_neuro |          1  (omitted)
         1.chronic_kidney_disease |          1  (omitted)
               0.organ_transplant |          1  (omitted)
                         0.spleen |          1  (omitted)
               1.ra_sle_psoriasis |          1  (omitted)
---------------------------------------------------------------------------------------------------
                                                             Stratified by stp
file ./output/models/an_multivariate_cox_models_onscoviddeath_MAINFULLYADJMODEL_agespline_bmicat_CCeth.ster saved

                id:  patient_id
     failure event:  ituadmission != 0 & ituadmission < .
obs. time interval:  (stime_ituadmission[_n-1], stime_ituadmission]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    100,570  total observations
          3  observations end on or before enter()
------------------------------------------------------------------------------
    100,567  observations remaining, representing
    100,567  subjects
          5  failures in single-failure-per-subject data
  7,944,253  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        79
   1:     17.14 /        1 =      17.1390

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       99,132                  Number of obs    =      99,132
No. of failures =            5
Time at risk    =      7830888
                                                LR chi2(9)       =       33.40
Log likelihood  =   -40.822786                  Prob > chi2      =      0.0001

---------------------------------------------------------------------------------------------------
                               _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------------------+----------------------------------------------------------------
                             age1 |   1.057531   .1035764     0.57   0.568     .8728206    1.281331
                             age2 |   .5711125     .24747    -1.29   0.196     .2442787    1.335235
                             age3 |   9.888353   16.77408     1.35   0.177     .3557878    274.8254
                           1.male |   6.448928   8.829686     1.36   0.173     .4406024    94.39047
                        1.obese40 |   2.20e-17          .        .       .            .           .
                   1.currentsmoke |   5.038134   5.477613     1.49   0.137     .5981603    42.43478
                                  |
                              imd |
                               2  |   3.46e-10          .        .       .            .           .
                               3  |   4.28e-10          .        .       .            .           .
                               4  |   3.44e+10   3.29e+10    25.36   0.000     5.27e+09    2.24e+11
                               5  |   7.96e+09          .        .       .            .           .
                                  |
                         1.bphigh |   .2342123   .2790234    -1.22   0.223     .0226752    2.419184
    1.chronic_respiratory_disease |   2.64e-19          .        .       .            .           .
                         1.asthma |   3.08e-17          .        .       .            .           .
        1.chronic_cardiac_disease |    53.1321   54.39712     3.88   0.000     7.143143     395.207
                       1.diabetes |   1.019685   1.332207     0.01   0.988     .0787735    13.19931
           1.cancer_exhaem_lastyr |   2.95e-14          .        .       .            .           .
1.haemmalig_aanaem_bmtrans_lastyr |   7.61e-16          .        .       .            .           .
          1.chronic_liver_disease |   2.94e-17          .        .       .            .           .
                1.stroke_dementia |   1.05e-18          .        .       .            .           .
                    1.other_neuro |   1.42e-18          .        .       .            .           .
         1.chronic_kidney_disease |   2.35e-19          .        .       .            .           .
               1.organ_transplant |   2.83e-17          .        .       .            .           .
                         1.spleen |   2.97e-17          .        .       .            .           .
               1.ra_sle_psoriasis |   8.28e-19          .        .       .            .           .
---------------------------------------------------------------------------------------------------
                                                             Stratified by stp
file ./output/models/an_multivariate_cox_models_ituadmission_MAINFULLYADJMODEL_agespline_bmicat_noeth.ster saved
   1:     19.84 /        1 =      19.8410

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       99,132                  Number of obs    =      99,132
No. of failures =            5
Time at risk    =      7830888
                                                LR chi2(8)       =       34.34
Log likelihood  =   -40.353236                  Prob > chi2      =      0.0000

---------------------------------------------------------------------------------------------------
                               _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------------------+----------------------------------------------------------------
                         agegroup |
                          18-<40  |   1.04e+10   1.63e+10    14.69   0.000     4.78e+08    2.25e+11
                          40-<50  |   4.52e+09   8.01e+09    12.54   0.000     1.40e+08    1.46e+11
                          60-<70  |   2.94e-10          .        .       .            .           .
                          70-<80  |   2.98e-10          .        .       .            .           .
                             80+  |   1.71e+09          .        .       .            .           .
                                  |
                           1.male |   10.25382   16.24338     1.47   0.142     .4596981    228.7172
                        1.obese40 |   3.15e-17          .        .       .            .           .
                   1.currentsmoke |   4.284422   4.811051     1.30   0.195     .4743112    38.70091
                                  |
                              imd |
                               2  |   3.53e-10          .        .       .            .           .
                               3  |   4.47e-10          .        .       .            .           .
                               4  |   3.14e+10   3.06e+10    24.85   0.000     4.67e+09    2.12e+11
                               5  |   8.00e+09          .        .       .            .           .
                                  |
                         1.bphigh |   .2562783   .3096574    -1.13   0.260     .0240003     2.73657
    1.chronic_respiratory_disease |   2.82e-19          .        .       .            .           .
                         1.asthma |   3.18e-17          .        .       .            .           .
        1.chronic_cardiac_disease |   49.33615   51.26044     3.75   0.000     6.438191    378.0652
                       1.diabetes |   1.266935   1.663019     0.18   0.857     .0967029     16.5985
           1.cancer_exhaem_lastyr |   8.56e-14          .        .       .            .           .
1.haemmalig_aanaem_bmtrans_lastyr |   6.91e-16          .        .       .            .           .
          1.chronic_liver_disease |   7.33e-17          .        .       .            .           .
                1.stroke_dementia |   1.13e-18          .        .       .            .           .
                    1.other_neuro |   1.75e-18          .        .       .            .           .
         1.chronic_kidney_disease |   2.54e-19          .        .       .            .           .
               1.organ_transplant |   1.97e-16          .        .       .            .           .
                         1.spleen |   2.31e-17          .        .       .            .           .
               1.ra_sle_psoriasis |   8.01e-19          .        .       .            .           .
---------------------------------------------------------------------------------------------------
                                                             Stratified by stp
file ./output/models/an_multivariate_cox_models_ituadmission_MAINFULLYADJMODEL_agegroup_bmicat_noeth.ster saved
   1:      0.76 /        1 =       0.7580

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- no ties

No. of subjects =       19,749                  Number of obs    =      19,749
No. of failures =            0
Time at risk    =      1560171
                                                LR chi2(0)       =        0.00
Log likelihood  =            0                  Prob > chi2      =           .

---------------------------------------------------------------------------------------------------
                               _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------------------+----------------------------------------------------------------
                             age1 |          1  (omitted)
                             age2 |          1  (omitted)
                             age3 |          1  (omitted)
                           1.male |          1  (omitted)
                        1.obese40 |          1  (omitted)
                   1.currentsmoke |          1  (omitted)
                                  |
                        ethnicity |
                     South Asian  |          1  (omitted)
                           Black  |          1  (omitted)
                           Other  |          1  (omitted)
                           Mixed  |          1  (omitted)
                                  |
                              imd |
                               2  |          1  (omitted)
                               3  |          1  (omitted)
                               4  |          1  (omitted)
                               5  |          1  (omitted)
                                  |
                         1.bphigh |          1  (omitted)
    1.chronic_respiratory_disease |          1  (omitted)
                         1.asthma |          1  (omitted)
        1.chronic_cardiac_disease |          1  (omitted)
                       1.diabetes |          1  (omitted)
           1.cancer_exhaem_lastyr |          1  (omitted)
1.haemmalig_aanaem_bmtrans_lastyr |          1  (omitted)
          1.chronic_liver_disease |          1  (omitted)
                1.stroke_dementia |          1  (omitted)
                    1.other_neuro |          1  (omitted)
         1.chronic_kidney_disease |          1  (omitted)
               0.organ_transplant |          1  (omitted)
                         0.spleen |          1  (omitted)
               1.ra_sle_psoriasis |          1  (omitted)
---------------------------------------------------------------------------------------------------
                                                             Stratified by stp
file ./output/models/an_multivariate_cox_models_ituadmission_MAINFULLYADJMODEL_agespline_bmicat_CCeth.ster saved
   1:      0.70 /        1 =       0.6970

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- no ties

No. of subjects =       19,749                  Number of obs    =      19,749
No. of failures =            0
Time at risk    =      1560171
                                                LR chi2(0)       =        0.00
Log likelihood  =            0                  Prob > chi2      =           .

---------------------------------------------------------------------------------------------------
                               _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------------------+----------------------------------------------------------------
                             age1 |          1  (omitted)
                             age2 |          1  (omitted)
                             age3 |          1  (omitted)
                           1.male |          1  (omitted)
                        1.obese40 |          1  (omitted)
                   1.currentsmoke |          1  (omitted)
                                  |
                              imd |
                               2  |          1  (omitted)
                               3  |          1  (omitted)
                               4  |          1  (omitted)
                               5  |          1  (omitted)
                                  |
                         1.bphigh |          1  (omitted)
    1.chronic_respiratory_disease |          1  (omitted)
                         1.asthma |          1  (omitted)
        1.chronic_cardiac_disease |          1  (omitted)
                       1.diabetes |          1  (omitted)
           1.cancer_exhaem_lastyr |          1  (omitted)
1.haemmalig_aanaem_bmtrans_lastyr |          1  (omitted)
          1.chronic_liver_disease |          1  (omitted)
                1.stroke_dementia |          1  (omitted)
                    1.other_neuro |          1  (omitted)
         1.chronic_kidney_disease |          1  (omitted)
               0.organ_transplant |          1  (omitted)
                         0.spleen |          1  (omitted)
               1.ra_sle_psoriasis |          1  (omitted)
---------------------------------------------------------------------------------------------------
                                                             Stratified by stp
file ./output/models/an_multivariate_cox_models_ituadmission_MAINFULLYADJMODEL_agespline_bmicat_CCeth.ster saved

. 
. * Close log file  (bootstrapping likely to take a while)
. log close
      name:  <unnamed>
       log:  C:\Github\opencorona-risk-factors-research\analysis\output/an_multivariable_cox_models.log
  log type:  text
 closed on:  23 Apr 2020, 19:30:47
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
