---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Github\opencorona-risk-factors-research\analysis\output/an_multivariable_cox_models_cpnsdeath.log
  log type:  text
 opened on:  29 Apr 2020, 22:19:51

. 
. use cr_create_analysis_dataset, clear
(Analysis dataset for the poor outcomes in Covid project)

. 
. 
. ******************************
. *  Multivariable Cox models  *
. ******************************
. 
. *************************************************************************************
. *PROG TO DEFINE THE BASIC COX MODEL WITH OPTIONS FOR HANDLING OF AGE, BMI, ETHNICITY:
. cap prog drop basecoxmodel

. prog define basecoxmodel
  1.         syntax , age(string) bp(string) [ethnicity(real 0) if(string)] 
  2. 
.         if `ethnicity'==1 local ethnicity "i.ethnicity"
  3.         else local ethnicity
  4. timer clear
  5. timer on 1
  6.         capture stcox   `age'                                   ///
>                         i.male                                                  ///
>                         i.obese4cat                                             ///
>                         i.smoke_nomiss                                  ///
>                         `ethnicity'                                             ///
>                         i.imd                                                   ///
>                         `bp'                                                    ///
>                         i.chronic_respiratory_disease   ///
>                         i.asthmacat                                             ///
>                         i.chronic_cardiac_disease               ///
>                         i.diabcat                                               ///
>                         i.cancer_exhaem_cat                             ///
>                         i.cancer_haem_cat                               ///
>                         i.chronic_liver_disease                 ///
>                         i.stroke_dementia                               ///
>                         i.other_neuro                                   ///
>                         i.chronic_kidney_disease                ///
>                         i.organ_transplant                              ///
>                         i.spleen                                                ///
>                         i.ra_sle_psoriasis                      ///
>                         i.other_immunosuppression                       ///
>                         `if'                                                    ///
>                         , strata(stp)
  7. timer off 1
  8. timer list
  9. end

. *************************************************************************************
. 
. 
. 
. stset stime_`outcome', fail(`outcome') enter(enter_date) origin(enter_date) id(patient_id) 

                id:  patient_id
     failure event:  cpnsdeath != 0 & cpnsdeath < .
obs. time interval:  (stime_cpnsdeath[_n-1], stime_cpnsdeath]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
    100,575  total observations
          3  observations end on or before enter()
------------------------------------------------------------------------------
    100,572  observations remaining, representing
    100,572  subjects
          1  failure in single-failure-per-subject data
  8,447,712  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        84

. 
. *Age spline model (not adj ethnicity)
. basecoxmodel, age("age1 age2 age3")  bp("i.htdiag_or_highbp") ethnicity(0)
   1:      9.84 /        1 =       9.8390

. if _rc==0{
. estimates
. estimates save ./output/models/an_multivariate_cox_models_`outcome'_MAINFULLYADJMODEL_agespline_bmicat_noeth, replace
. *estat concordance /*c-statistic*/
. }

. else di "WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME `outcome')"
WARNING AGE SPLINE MODEL DID NOT FIT (OUTCOME cpnsdeath)

.  
. *Age group model (not adj ethnicity)
. basecoxmodel, age("ib3.agegroup") bp("i.htdiag_or_highbp") ethnicity(0)
   1:     17.84 /        1 =      17.8350

. if _rc==0{
. estimates

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- no ties

No. of subjects =       99,185                  Number of obs    =      99,185
No. of failures =            1
Time at risk    =      8331204
                                                LR chi2(24)      =        8.01
Log likelihood  =   -6.1092476                  Prob > chi2      =      0.9991

-----------------------------------------------------------------------------------------------
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                     agegroup |
                      18-<40  |   1.68e+15   8.88e+22     0.00   1.000            0           .
                      40-<50  |    .054629   1.30e+07    -0.00   1.000            0           .
                      60-<70  |   .0363014   1.09e+07    -0.00   1.000            0           .
                      70-<80  |   .0289758    9823647    -0.00   1.000            0           .
                         80+  |   .0201041    8077462    -0.00   1.000            0           .
                              |
                       1.male |   2.10e-16   1.53e-08    -0.00   1.000            0           .
                              |
                    obese4cat |
           Obese I (30-34.9)  |   7.26e-15   1.28e-06    -0.00   1.000            0           .
          Obese II (35-39.9)  |   .2549946   1.48e+08    -0.00   1.000            0           .
             Obese III (40+)  |   .2131442   1.89e+08    -0.00   1.000            0           .
                              |
                 smoke_nomiss |
                      Former  |   3.88e-15   6.55e-07    -0.00   1.000            0           .
                     Current  |   1.65e-15   1.57e-07    -0.00   1.000            0           .
                              |
                          imd |
                           2  |   .1515111   5.37e+07    -0.00   1.000            0           .
                           3  |   .1580505   3.95e+07    -0.00   1.000            0           .
                           4  |   7.02e+15   3.66e+23     0.00   1.000            0           .
             5 most deprived  |   .1280819   4.53e+07    -0.00   1.000            0           .
                              |
           1.htdiag_or_highbp |   1.49e-15   2.58e-07    -0.00   1.000            0           .
1.chronic_respiratory_disease |   .1528128   1.13e+08    -0.00   1.000            0           .
                              |
                    asthmacat |
                 Yes, no OCS  |   7.44e-16   2.59e-07    -0.00   1.000            0           .
    1.chronic_cardiac_disease |   2.79e-15   1.12e-06    -0.00   1.000            0           .
                              |
                      diabcat |
  Diabetes, no hba1c measure  |   2.70e-15   2.35e-07    -0.00   1.000            0           .
                              |
            cancer_exhaem_cat |
                   Last year  |   2.45e+47          .        .       .            .           .
               2-5 years ago  |   7.95e+12          .        .       .            .           .
                    5+ years  |   4.77e-16   3.28e-07    -0.00   1.000            0           .
                              |
              cancer_haem_cat |
                   Last year  |   3.64e+11          .        .       .            .           .
               2-5 years ago  |   7.97e+22          .        .       .            .           .
                    5+ years  |   2.45e+13          .        .       .            .           .
                              |
      1.chronic_liver_disease |   2.56e+28          .        .       .            .           .
            1.stroke_dementia |   .9897295   1.92e+09    -0.00   1.000            0           .
                1.other_neuro |   2.24e+14          .        .       .            .           .
     1.chronic_kidney_disease |   1.05e-15   6.86e-07    -0.00   1.000            0           .
           1.organ_transplant |   1.02e-45          .        .       .            .           .
                     1.spleen |   6.10e+28          .        .       .            .           .
           1.ra_sle_psoriasis |   1.842286   1.49e+09     0.00   1.000            0           .
    1.other_immunosuppression |   4.06e-17          .        .       .            .           .
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
. estimates save ./output/models/an_multivariate_cox_models_`outcome'_MAINFULLYADJMODEL_agegroup_bmicat_noeth, replace
(note: file ./output/models/an_multivariate_cox_models_cpnsdeath_MAINFULLYADJMODEL_agegroup_bmicat_noeth.ster not found)
file ./output/models/an_multivariate_cox_models_cpnsdeath_MAINFULLYADJMODEL_agegroup_bmicat_noeth.ster saved
. *estat concordance /*c-statistic*/
. }

. else di "WARNING GROUP MODEL DID NOT FIT (OUTCOME `outcome')"

. 
. *Complete case ethnicity model
. basecoxmodel, age("age1 age2 age3") bp("i.htdiag_or_highbp") ethnicity(1)
   1:      0.94 /        1 =       0.9350

. if _rc==0{
. estimates

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- no ties

No. of subjects =       19,794                  Number of obs    =      19,794
No. of failures =            0
Time at risk    =      1662696
                                                LR chi2(0)       =        0.00
Log likelihood  =            0                  Prob > chi2      =           .

-----------------------------------------------------------------------------------------------
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                         age1 |          1  (omitted)
                         age2 |          1  (omitted)
                         age3 |          1  (omitted)
                       1.male |          1  (omitted)
                              |
                    obese4cat |
           Obese I (30-34.9)  |          1  (omitted)
          Obese II (35-39.9)  |          1  (omitted)
             Obese III (40+)  |          1  (omitted)
                              |
                 smoke_nomiss |
                      Former  |          1  (omitted)
                     Current  |          1  (omitted)
                              |
                    ethnicity |
                       Mixed  |          1  (omitted)
      Asian or Asian British  |          1  (omitted)
                       Black  |          1  (omitted)
                       Other  |          1  (omitted)
                              |
                          imd |
                           2  |          1  (omitted)
                           3  |          1  (omitted)
                           4  |          1  (omitted)
             5 most deprived  |          1  (omitted)
                              |
           1.htdiag_or_highbp |          1  (omitted)
1.chronic_respiratory_disease |          1  (omitted)
                              |
                    asthmacat |
                 Yes, no OCS  |          1  (omitted)
    1.chronic_cardiac_disease |          1  (omitted)
                              |
                      diabcat |
  Diabetes, no hba1c measure  |          1  (omitted)
                              |
            cancer_exhaem_cat |
                   Last year  |          1  (omitted)
               2-5 years ago  |          1  (omitted)
                    5+ years  |          1  (omitted)
                              |
              cancer_haem_cat |
                    5+ years  |          1  (omitted)
      1.chronic_liver_disease |          1  (omitted)
            1.stroke_dementia |          1  (omitted)
                1.other_neuro |          1  (omitted)
     1.chronic_kidney_disease |          1  (omitted)
           0.organ_transplant |          1  (omitted)
                     0.spleen |          1  (omitted)
           1.ra_sle_psoriasis |          1  (omitted)
    1.other_immunosuppression |          1  (omitted)
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
. estimates save ./output/models/an_multivariate_cox_models_`outcome'_MAINFULLYADJMODEL_agespline_bmicat_CCeth, replace
(note: file ./output/models/an_multivariate_cox_models_cpnsdeath_MAINFULLYADJMODEL_agespline_bmicat_CCeth.ster not found)
file ./output/models/an_multivariate_cox_models_cpnsdeath_MAINFULLYADJMODEL_agespline_bmicat_CCeth.ster saved
. *estat concordance /*c-statistic*/
.  }

.  else di "WARNING CC ETHNICITY MODEL DID NOT FIT (OUTCOME `outcome')"

. 
. *Model without ethnicity among ethnicity complete cases 
. basecoxmodel, age("age1 age2 age3") bp("i.htdiag_or_highbp") ethnicity(0) if("if ethnicity<.")
   1:      0.79 /        1 =       0.7850

. if _rc==0{
. estimates

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- no ties

No. of subjects =       19,794                  Number of obs    =      19,794
No. of failures =            0
Time at risk    =      1662696
                                                LR chi2(0)       =        0.00
Log likelihood  =            0                  Prob > chi2      =           .

-----------------------------------------------------------------------------------------------
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                         age1 |          1  (omitted)
                         age2 |          1  (omitted)
                         age3 |          1  (omitted)
                       1.male |          1  (omitted)
                              |
                    obese4cat |
           Obese I (30-34.9)  |          1  (omitted)
          Obese II (35-39.9)  |          1  (omitted)
             Obese III (40+)  |          1  (omitted)
                              |
                 smoke_nomiss |
                      Former  |          1  (omitted)
                     Current  |          1  (omitted)
                              |
                          imd |
                           2  |          1  (omitted)
                           3  |          1  (omitted)
                           4  |          1  (omitted)
             5 most deprived  |          1  (omitted)
                              |
           1.htdiag_or_highbp |          1  (omitted)
1.chronic_respiratory_disease |          1  (omitted)
                              |
                    asthmacat |
                 Yes, no OCS  |          1  (omitted)
    1.chronic_cardiac_disease |          1  (omitted)
                              |
                      diabcat |
  Diabetes, no hba1c measure  |          1  (omitted)
                              |
            cancer_exhaem_cat |
                   Last year  |          1  (omitted)
               2-5 years ago  |          1  (omitted)
                    5+ years  |          1  (omitted)
                              |
              cancer_haem_cat |
                    5+ years  |          1  (omitted)
      1.chronic_liver_disease |          1  (omitted)
            1.stroke_dementia |          1  (omitted)
                1.other_neuro |          1  (omitted)
     1.chronic_kidney_disease |          1  (omitted)
           0.organ_transplant |          1  (omitted)
                     0.spleen |          1  (omitted)
           1.ra_sle_psoriasis |          1  (omitted)
    1.other_immunosuppression |          1  (omitted)
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
. estimates save ./output/models/an_multivariate_cox_models_`outcome'_MAINFULLYADJMODEL_agespline_bmicat_CCnoeth, replace
(note: file ./output/models/an_multivariate_cox_models_cpnsdeath_MAINFULLYADJMODEL_agespline_bmicat_CCnoeth.ster not found)
file ./output/models/an_multivariate_cox_models_cpnsdeath_MAINFULLYADJMODEL_agespline_bmicat_CCnoeth.ster saved
. *estat concordance /*c-statistic*/
.  }

.  else di "WARNING CC MODEL (excluding ethnicity) DID NOT FIT (OUTCOME `outcome')"

.  
.  *BP SENS ANALYSES
.  *Model with coded hypertension 
. basecoxmodel, age("age1 age2 age3") bp("i.hypertension") ethnicity(1)
   1:      0.86 /        1 =       0.8600

. if _rc==0{
. estimates

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- no ties

No. of subjects =       19,794                  Number of obs    =      19,794
No. of failures =            0
Time at risk    =      1662696
                                                LR chi2(0)       =        0.00
Log likelihood  =            0                  Prob > chi2      =           .

-----------------------------------------------------------------------------------------------
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                         age1 |          1  (omitted)
                         age2 |          1  (omitted)
                         age3 |          1  (omitted)
                       1.male |          1  (omitted)
                              |
                    obese4cat |
           Obese I (30-34.9)  |          1  (omitted)
          Obese II (35-39.9)  |          1  (omitted)
             Obese III (40+)  |          1  (omitted)
                              |
                 smoke_nomiss |
                      Former  |          1  (omitted)
                     Current  |          1  (omitted)
                              |
                    ethnicity |
                       Mixed  |          1  (omitted)
      Asian or Asian British  |          1  (omitted)
                       Black  |          1  (omitted)
                       Other  |          1  (omitted)
                              |
                          imd |
                           2  |          1  (omitted)
                           3  |          1  (omitted)
                           4  |          1  (omitted)
             5 most deprived  |          1  (omitted)
                              |
               1.hypertension |          1  (omitted)
1.chronic_respiratory_disease |          1  (omitted)
                              |
                    asthmacat |
                 Yes, no OCS  |          1  (omitted)
    1.chronic_cardiac_disease |          1  (omitted)
                              |
                      diabcat |
  Diabetes, no hba1c measure  |          1  (omitted)
                              |
            cancer_exhaem_cat |
                   Last year  |          1  (omitted)
               2-5 years ago  |          1  (omitted)
                    5+ years  |          1  (omitted)
                              |
              cancer_haem_cat |
                    5+ years  |          1  (omitted)
      1.chronic_liver_disease |          1  (omitted)
            1.stroke_dementia |          1  (omitted)
                1.other_neuro |          1  (omitted)
     1.chronic_kidney_disease |          1  (omitted)
           0.organ_transplant |          1  (omitted)
                     0.spleen |          1  (omitted)
           1.ra_sle_psoriasis |          1  (omitted)
    1.other_immunosuppression |          1  (omitted)
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
. estimates save ./output/models/an_multivariate_cox_models_`outcome'_MAINFULLYADJMODEL_agespline_bmicat_HTN, replace
file ./output/models/an_multivariate_cox_models_cpnsdeath_MAINFULLYADJMODEL_agespline_bmicat_HTN.ster saved
. *estat concordance /*c-statistic*/
.  }

.  else di "WARNING CC MODEL (excluding ethnicity) DID NOT FIT (OUTCOME `outcome')"

.  
. 
. 
. *Model with categorised bp
. basecoxmodel, age("age1 age2 age3") bp("i.bpcat_nomiss") ethnicity(1)
   1:      0.87 /        1 =       0.8720

. if _rc==0{
. estimates

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
active results
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Stratified Cox regr. -- no ties

No. of subjects =       19,794                  Number of obs    =      19,794
No. of failures =            0
Time at risk    =      1662696
                                                LR chi2(0)       =        0.00
Log likelihood  =            0                  Prob > chi2      =           .

-----------------------------------------------------------------------------------------------
                           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------------------+----------------------------------------------------------------
                         age1 |          1  (omitted)
                         age2 |          1  (omitted)
                         age3 |          1  (omitted)
                       1.male |          1  (omitted)
                              |
                    obese4cat |
           Obese I (30-34.9)  |          1  (omitted)
          Obese II (35-39.9)  |          1  (omitted)
             Obese III (40+)  |          1  (omitted)
                              |
                 smoke_nomiss |
                      Former  |          1  (omitted)
                     Current  |          1  (omitted)
                              |
                    ethnicity |
                       Mixed  |          1  (omitted)
      Asian or Asian British  |          1  (omitted)
                       Black  |          1  (omitted)
                       Other  |          1  (omitted)
                              |
                          imd |
                           2  |          1  (omitted)
                           3  |          1  (omitted)
                           4  |          1  (omitted)
             5 most deprived  |          1  (omitted)
                              |
                 bpcat_nomiss |
                    Elevated  |          1  (omitted)
               High, stage I  |          1  (omitted)
              High, stage II  |          1  (omitted)
                              |
1.chronic_respiratory_disease |          1  (omitted)
                              |
                    asthmacat |
                 Yes, no OCS  |          1  (omitted)
    1.chronic_cardiac_disease |          1  (omitted)
                              |
                      diabcat |
  Diabetes, no hba1c measure  |          1  (omitted)
                              |
            cancer_exhaem_cat |
                   Last year  |          1  (omitted)
               2-5 years ago  |          1  (omitted)
                    5+ years  |          1  (omitted)
                              |
              cancer_haem_cat |
                    5+ years  |          1  (omitted)
      1.chronic_liver_disease |          1  (omitted)
            1.stroke_dementia |          1  (omitted)
                1.other_neuro |          1  (omitted)
     1.chronic_kidney_disease |          1  (omitted)
           0.organ_transplant |          1  (omitted)
                     0.spleen |          1  (omitted)
           1.ra_sle_psoriasis |          1  (omitted)
    1.other_immunosuppression |          1  (omitted)
-----------------------------------------------------------------------------------------------
                                                             Stratified by stp
. estimates save ./output/models/an_multivariate_cox_models_`outcome'_MAINFULLYADJMODEL_agespline_bmicat_BPCAT, replace
file ./output/models/an_multivariate_cox_models_cpnsdeath_MAINFULLYADJMODEL_agespline_bmicat_BPCAT.ster saved
. *estat concordance /*c-statistic*/
.  }

.  else di "WARNING CC MODEL (excluding ethnicity) DID NOT FIT (OUTCOME `outcome')"

.  
. 
.  
. 
. 
. log close
      name:  <unnamed>
       log:  C:\Github\opencorona-risk-factors-research\analysis\output/an_multivariable_cox_models_cpnsdeath.log
  log type:  text
 closed on:  29 Apr 2020, 22:20:23
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
